Repository: pypi-data/pypi-mirror-357
Catalog: packages/zibanu-django-auth/zibanu_django_auth-1.2.7.tar.gz/zibanu_django_auth-1.2.7/zibanu/django/auth/locale/*/LC_MESSAGES/django.po
Languages: es

source: Group level admin
es: Administración de Niveles de Grupo

source: The user does not have allowed multiple login. Please close previous sessions.
es: El usuario no tiene permitido iniciar múltiples sesiones. Por favor cierre las sesiones abiertas previamente.

source: The token does not have associated user.
es: El token no tiene un usuario asociado.

source: The user does not have associated profile.
es: El usuario no tiene perfil asociado.

source: Critical Error! Not controlled exception.
es: Error Crítico! Excepción no controlada.

source: You're trying to refresh and invalid token.
es: Está tratando de refrescar un token inválido.

source: Email already in use
es: El correo ya se encuentra registrado con nosotros.

source: The password is required.
es: La clave es obligatoria.

source: Email is already registered in our database.
es: El correo ya se encuentra registrado con nosotros.

source: The created user level cannot be higher than that of authenticated user.
es: El nivel del usuario creado no puede ser mayor que el del usuario autenticado.

source: Error creating user
es: Error creando el usuario

source: New User
es: Nuevo Usuario

source: You cannot upgrade a user with a higher level.
es: No puede actualizar un usuario con un nivel superior.

source: 'email' or 'id' not found in request data
es: Los valores de 'email' o 'id' son requeridos.

source: User does not exist.
es: El usuario no existe.

source: Only staff or superuser can delete another superuser or staff.
es: Solo un usuario administrador o superusuario puede eliminar a otro administrador o superusuario.

source: Cannot delete yourself.
es: No se puede eliminar a si mismo.

source: User has protected child records. Cannot delete.
es: El usuario tiene registros dependientes. No se puede eliminar.

source: Change password
es: Cambio de contraseña

source: The old and new password must be different
es: El nuevo password debe ser diferente del antiguo

source: The password must meet the following criteria: It must be between %(min_length)d and %(max_length)d characters, at least one uppercase letter (A-Z), at least one lowercase letter (a-z), at least one number (0-9), at least one special character from the following: !#$%(percentage)s&()*+.-@/_ and must not contain blank spaces or the letter (ñ or Ñ).
es: La contraseña debe cumplir con los siguientes criterios: debe tener entre %(min_length)d y %(max_length)d caracteres, al menos una letra mayúscula (A-Z), al menos una letra minúscula (a-z), al menos un número (0-9), al menos un carácter especial de los siguientes: !#$%(percentage)s&()*+.-@/_ y no debe contener espacios en blanco ni la letra (ñ o Ñ).

source: The password must meet the following criteria: It must be between %(min_length)d and %(max_length)d characters long, may contain letters (a-z, A-Z), special characters !#$%(percentage)s&()*+.-@/_ and digits (0-9). It must not contain blank spaces or the letter (ñ or Ñ).
es: La contraseña debe cumplir con los siguientes criterios: debe tener entre %(min_length)d y %(max_length)d caracteres, puede contener letras (a-z, A-Z), caracteres especiales !#$%(percentage)s&()*+.-@/_ y dígitos (0-9). No debe contener espacios en blanco ni la letra (ñ o Ñ).

source: Password change
es: Cambio de clave

source: Old password does not match.
es: La clave antigua no coincide.

source: Old/New password are required.
es: Se requiere la clave antigua y la nueva.

source: Request password.
es: Solicitar clave.

source: Email is not registered or user is not active.
es: El correo electrónico no está registrado o el usuario no está activo.

source: Zibanu Auth for Django
es: Módulo de autenticación Zibanu

source: Superuser
es: Super Usuario

source: Staff
es: Ejecutivos

source: Super Administrator
es: Super Administrador

source: Administrator
es: Administrador

source: Operator
es: Operador

source: Guest
es: Invitado

source: Time Zone
es: Zona Horaria

source: User Theme
es: Tema de Usuario

source: Language
es: Lenguaje

source: Message's Timeout
es: Tiempo de espera de mensajes

source: Keep Logged In
es: Mantener sesión abierta

source: Allow multiple login
es: Permite acceso múltiple

source: Force secure password
es: Forzar contraseña segura.

source: Custom Application Profile
es: Perfil de aplicación

source: Can change multiple logged in user's profile
es: Puede cambiar la opción de 'múltiple ingreso' en el perfil del usuario.

source: User Profile
es: Perfil del Usuario

source: You are not allowed to change multiple logged in user's profile.
es: No tiene permitido cambiar la opción de 'múltiple ingreso' en el perfil del usuario.

source: Group
es: Grupo

source: Group to assign level
es: Grupo al que se le asigna el nivel

source: Group level
es: Nivel del grupo

source: Level assigned to the group
es: Nivel asignado al grupo

source: Hello
es: Hola

source: You have changed your password successfully.
es: Su clave ha sido cambiada de manera exitosa.

source: This email was generated automatically at %(email_datetime)s with id %(email_id)s. Please do not answer it.
es: Este correo ha sido generado automaticamente a las %(email_datetime)s con el id %(email_id)s. Por favor no lo responda.

source: A new user has been created for your email. To login to the system, use the password found below.
es: Un nuevo usuario ha sido creado para su correo electrónico. Para ingresar al sistema, utilice la contraseña que encuentra a continuación.

source: This email was generated automatically at %(email_datetime)s with id %(email_id)s. Please do not answer it.
es: Este correo ha sido generado automaticamente a las %(email_datetime)s con el id %(email_id)s. Por favor no lo responda.

source: The system has generated a new password for you:
es: El sistema ha generado un nuevo password para usted:
