import re
from typing import (
    List,
    Dict
)


ETC_LAND_PATTERN: re.Pattern = r'\d+-?\d*\s?외\s?\d*'

ETC_LAND_PATTERN_FOR_SPLIT: re.Pattern = r'외\s*\d+\s*필지'

LOAD_PATTERN: re.Pattern = r'((?:\S*\s+)?(?:길|로)\s*\S*\s*(?:\d+(?:-\d+)?)\s*(?:외\s*\d+필지)?\s*)'

JIBUN_PATTERN: re.Pattern = r'((?:\S*\s+)?(?:동|리|가|로)\s*\S*\s*(?:\d+(?:-\d+)?)\s*(?:외\s*\d+필지)?\s*)'

LOAD_PATTERN_FOR_SLICE: re.Pattern = r'((?:\S+\s+)*?\S*(?:길)\b\s*\S*\s*(?:\d+(?:-\d+)?)\s*)'

JIBUN_PATTERN_FOR_SLICE: re.Pattern = r'((?:\S+\s+)*?(?:\S+(?:시|도)\s+)?\S*(?:동|리|가|로)\b\s*\S*\s*(?:\d{1,4}(?:-\d{1,4})\b)?)'

ADD_BJD_CHANGED_DICTIONARY: Dict[str, str] = {
    # 법정동코드 : 과거 법정동코드
    "4812110100": "4811010100", # 경상남도 창원시 북동 -> 경상남도 창원시 의창구 북동
    "4812110200": "4811010200", # 경상남도 창원시 중동 -> 경상남도 창원시 의창구 중동
    "4812110300": "4811010300", # 경상남도 창원시 서상동 -> 경상남도 창원시 의창구 서상동
    "4812110400": "4811010400", # 경상남도 창원시 소답동 -> 경상남도 창원시 의창구 소답동
    "4812110500": "4811010500", # 경상남도 창원시 도계동 -> 경상남도 창원시 의창구 도계동
    "4812110600": "4811010600", # 경상남도 창원시 동정동 -> 경상남도 창원시 의창구 동정동
    "4812110700": "4811010700", # 경상남도 창원시 소계동 -> 경상남도 창원시 의창구 소계동
    "4812110800": "4811010800", # 경상남도 창원시 용동 -> 경상남도 창원시 의창구 용동
    "4812111200": "4811012400", # 경상남도 창원시 덕정동 -> 경상남도 창원시 의창구 덕정동
    "4812111300": "4811013400", # 경상남도 창원시 지귀동 -> 경상남도 창원시 의창구 지귀동
    "4812111400": "4811013500", # 경상남도 창원시 서곡동 -> 경상남도 창원시 의창구 서곡동
    "4812111600": "4811013700", # 경상남도 창원시 봉림동 -> 경상남도 창원시 의창구 봉림동
    "4812111700": "4811013800", # 경상남도 창원시 퇴촌동 -> 경상남도 창원시 의창구 퇴촌동
    "4812111800": "4811013900", # 경상남도 창원시 명곡동 -> 경상남도 창원시 의창구 명곡동
    "4812111900": "4811014000", # 경상남도 창원시 반계동 -> 경상남도 창원시 의창구 반계동
    "4812112000": "4811014100", # 경상남도 창원시 사화동 -> 경상남도 창원시 의창구 사화동
    "4812112100": "4811014200", # 경상남도 창원시 차용동 -> 경상남도 창원시 의창구 차용동
    "4812112200": "4811014300", # 경상남도 창원시 내리동 -> 경상남도 창원시 의창구 내리동
    "4812112400": "4811014900", # 경상남도 창원시 명서동 -> 경상남도 창원시 의창구 명서동
    "4812112500": "4811015600", # 경상남도 창원시 사림동 -> 경상남도 창원시 의창구 사림동
    "4812112700": "4811016000", # 경상남도 창원시 봉곡동 -> 경상남도 창원시 의창구 봉곡동
    "4812112900": "4811016200", # 경상남도 창원시 팔용동 -> 경상남도 창원시 의창구 팔용동
    "4812125000": "4811025000", # 경상남도 창원시 동읍 -> 경상남도 창원시 의창구 동읍
    "4812125021": "4811025021", # 경상남도 창원시 동읍 용강리 -> 경상남도 창원시 의창구 동읍 용강리
    "4812125022": "4811025022", # 경상남도 창원시 동읍 용전리 -> 경상남도 창원시 의창구 동읍 용전리
    "4812125023": "4811025023", # 경상남도 창원시 동읍 남산리 -> 경상남도 창원시 의창구 동읍 남산리
    "4812125024": "4811025024", # 경상남도 창원시 동읍 덕천리 -> 경상남도 창원시 의창구 동읍 덕천리
    "4812125025": "4811025025", # 경상남도 창원시 동읍 덕산리 -> 경상남도 창원시 의창구 동읍 덕산리
    "4812125026": "4811025026", # 경상남도 창원시 동읍 봉산리 -> 경상남도 창원시 의창구 동읍 봉산리
    "4812125027": "4811025027", # 경상남도 창원시 동읍 송정리 -> 경상남도 창원시 의창구 동읍 송정리
    "4812125028": "4811025028", # 경상남도 창원시 동읍 용정리 -> 경상남도 창원시 의창구 동읍 용정리
    "4812125029": "4811025029", # 경상남도 창원시 동읍 단계리 -> 경상남도 창원시 의창구 동읍 단계리
    "4812125030": "4811025030", # 경상남도 창원시 동읍 무성리 -> 경상남도 창원시 의창구 동읍 무성리
    "4812125031": "4811025031", # 경상남도 창원시 동읍 무점리 -> 경상남도 창원시 의창구 동읍 무점리
    "4812125032": "4811025032", # 경상남도 창원시 동읍 용잠리 -> 경상남도 창원시 의창구 동읍 용잠리
    "4812125033": "4811025033", # 경상남도 창원시 동읍 신방리 -> 경상남도 창원시 의창구 동읍 신방리
    "4812125034": "4811025034", # 경상남도 창원시 동읍 다호리 -> 경상남도 창원시 의창구 동읍 다호리
    "4812125035": "4811025035", # 경상남도 창원시 동읍 월잠리 -> 경상남도 창원시 의창구 동읍 월잠리
    "4812125036": "4811025036", # 경상남도 창원시 동읍 화양리 -> 경상남도 창원시 의창구 동읍 화양리
    "4812125037": "4811025037", # 경상남도 창원시 동읍 석산리 -> 경상남도 창원시 의창구 동읍 석산리
    "4812125038": "4811025038", # 경상남도 창원시 동읍 금산리 -> 경상남도 창원시 의창구 동읍 금산리
    "4812125039": "4811025039", # 경상남도 창원시 동읍 봉곡리 -> 경상남도 창원시 의창구 동읍 봉곡리
    "4812125040": "4811025040", # 경상남도 창원시 동읍 봉강리 -> 경상남도 창원시 의창구 동읍 봉강리
    "4812125041": "4811025041", # 경상남도 창원시 동읍 본포리 -> 경상남도 창원시 의창구 동읍 본포리
    "4812125042": "4811025042", # 경상남도 창원시 동읍 노연리 -> 경상남도 창원시 의창구 동읍 노연리
    "4812125043": "4811025043", # 경상남도 창원시 동읍 산남리 -> 경상남도 창원시 의창구 동읍 산남리
    "4812125044": "4811025044", # 경상남도 창원시 동읍 죽동리 -> 경상남도 창원시 의창구 동읍 죽동리
    "4812131000": "4811032000", # 경상남도 창원시 북면 -> 경상남도 창원시 의창구 북면
    "4812131021": "4811032021", # 경상남도 창원시 북면 지개리 -> 경상남도 창원시 의창구 북면 지개리
    "4812131022": "4811032022", # 경상남도 창원시 북면 고암리 -> 경상남도 창원시 의창구 북면 고암리
    "4812131023": "4811032023", # 경상남도 창원시 북면 대산리 -> 경상남도 창원시 의창구 북면 대산리
    "4812131024": "4811032024", # 경상남도 창원시 북면 월촌리 -> 경상남도 창원시 의창구 북면 월촌리
    "4812131025": "4811032025", # 경상남도 창원시 북면 월백리 -> 경상남도 창원시 의창구 북면 월백리
    "4812131026": "4811032026", # 경상남도 창원시 북면 화천리 -> 경상남도 창원시 의창구 북면 화천리
    "4812131027": "4811032027", # 경상남도 창원시 북면 외감리 -> 경상남도 창원시 의창구 북면 외감리
    "4812131028": "4811032028", # 경상남도 창원시 북면 감계리 -> 경상남도 창원시 의창구 북면 감계리
    "4812131029": "4811032029", # 경상남도 창원시 북면 동전리 -> 경상남도 창원시 의창구 북면 동전리
    "4812131030": "4811032030", # 경상남도 창원시 북면 무동리 -> 경상남도 창원시 의창구 북면 무동리
    "4812131031": "4811032031", # 경상남도 창원시 북면 무곡리 -> 경상남도 창원시 의창구 북면 무곡리
    "4812131032": "4811032032", # 경상남도 창원시 북면 내곡리 -> 경상남도 창원시 의창구 북면 내곡리
    "4812131033": "4811032033", # 경상남도 창원시 북면 상천리 -> 경상남도 창원시 의창구 북면 상천리
    "4812131034": "4811032034", # 경상남도 창원시 북면 하천리 -> 경상남도 창원시 의창구 북면 하천리
    "4812131035": "4811032035", # 경상남도 창원시 북면 외산리 -> 경상남도 창원시 의창구 북면 외산리
    "4812131036": "4811032036", # 경상남도 창원시 북면 신촌리 -> 경상남도 창원시 의창구 북면 신촌리
    "4812131037": "4811032037", # 경상남도 창원시 북면 마산리 -> 경상남도 창원시 의창구 북면 마산리
    "4812131038": "4811032038", # 경상남도 창원시 북면 월계리 -> 경상남도 창원시 의창구 북면 월계리
    "4812132000": "4811033000", # 경상남도 창원시 대산면 -> 경상남도 창원시 의창구 대산면
    "4812132021": "4811033021", # 경상남도 창원시 대산면 갈전리 -> 경상남도 창원시 의창구 대산면 갈전리
    "4812132022": "4811033022", # 경상남도 창원시 대산면 일동리 -> 경상남도 창원시 의창구 대산면 일동리
    "4812132023": "4811033023", # 경상남도 창원시 대산면 모산리 -> 경상남도 창원시 의창구 대산면 모산리
    "4812132024": "4811033024", # 경상남도 창원시 대산면 가술리 -> 경상남도 창원시 의창구 대산면 가술리
    "4812132025": "4811033025", # 경상남도 창원시 대산면 제동리 -> 경상남도 창원시 의창구 대산면 제동리
    "4812132026": "4811033026", # 경상남도 창원시 대산면 우암리 -> 경상남도 창원시 의창구 대산면 우암리
    "4812132027": "4811033027", # 경상남도 창원시 대산면 북부리 -> 경상남도 창원시 의창구 대산면 북부리
    "4812132028": "4811033028", # 경상남도 창원시 대산면 유등리 -> 경상남도 창원시 의창구 대산면 유등리
    "4812132029": "4811033029", # 경상남도 창원시 대산면 대방리 -> 경상남도 창원시 의창구 대산면 대방리
    "4812310100": "4811011000", # 경상남도 창원시 토월동 -> 경상남도 창원시 성산구 토월동
    "4812310200": "4811011100", # 경상남도 창원시 사파정동 -> 경상남도 창원시 성산구 사파정동
    "4812310300": "4811011200", # 경상남도 창원시 가음정동 -> 경상남도 창원시 성산구 가음정동
    "4812310400": "4811011300", # 경상남도 창원시 외동 -> 경상남도 창원시 성산구 외동
    "4812310500": "4811011400", # 경상남도 창원시 대방동 -> 경상남도 창원시 성산구 대방동
    "4812310600": "4811011500", # 경상남도 창원시 남산동 -> 경상남도 창원시 성산구 남산동
    "4812310700": "4811011600", # 경상남도 창원시 삼정자동 -> 경상남도 창원시 성산구 삼정자동
    "4812310800": "4811011700", # 경상남도 창원시 천선동 -> 경상남도 창원시 성산구 천선동
    "4812310900": "4811011800", # 경상남도 창원시 불모산동 -> 경상남도 창원시 성산구 불모산동
    "4812311000": "4811011900", # 경상남도 창원시 안민동 -> 경상남도 창원시 성산구 안민동
    "4812311100": "4811012100", # 경상남도 창원시 내동 -> 경상남도 창원시 성산구 내동
    "4812311200": "4811012700", # 경상남도 창원시 남지동 -> 경상남도 창원시 성산구 남지동
    "4812311300": "4811012800", # 경상남도 창원시 상복동 -> 경상남도 창원시 성산구 상복동
    "4812311400": "4811012900", # 경상남도 창원시 완암동 -> 경상남도 창원시 성산구 완암동
    "4812311500": "4811013000", # 경상남도 창원시 창곡동 -> 경상남도 창원시 성산구 창곡동
    "4812311600": "4811013100", # 경상남도 창원시 월림동 -> 경상남도 창원시 성산구 월림동
    "4812311700": "4811013200", # 경상남도 창원시 적현동 -> 경상남도 창원시 성산구 적현동
    "4812311800": "4811013300", # 경상남도 창원시 양곡동 -> 경상남도 창원시 성산구 양곡동
    "4812311900": "4811013600", # 경상남도 창원시 반송동 -> 경상남도 창원시 성산구 반송동
    "4812312000": "4811014400", # 경상남도 창원시 귀산동 -> 경상남도 창원시 성산구 귀산동
    "4812312100": "4811014500", # 경상남도 창원시 귀곡동 -> 경상남도 창원시 성산구 귀곡동
    "4812312200": "4811014600", # 경상남도 창원시 귀현동 -> 경상남도 창원시 성산구 귀현동
    "4812312300": "4811014700", # 경상남도 창원시 신촌동 -> 경상남도 창원시 성산구 신촌동
    "4812312400": "4811015000", # 경상남도 창원시 반지동 -> 경상남도 창원시 성산구 반지동
    "4812312500": "4811015100", # 경상남도 창원시 중앙동 -> 경상남도 창원시 성산구 중앙동
    "4812312600": "4811015200", # 경상남도 창원시 반림동 -> 경상남도 창원시 성산구 반림동
    "4812312700": "4811015300", # 경상남도 창원시 상남동 -> 경상남도 창원시 성산구 상남동
    "4812312800": "4811015400", # 경상남도 창원시 성주동 -> 경상남도 창원시 성산구 성주동
    "4812312900": "4811015500", # 경상남도 창원시 웅남동 -> 경상남도 창원시 성산구 웅남동
    "4812313000": "4811015700", # 경상남도 창원시 사파동 -> 경상남도 창원시 성산구 사파동
    "4812313100": "4811015900", # 경상남도 창원시 가음동 -> 경상남도 창원시 성산구 가음동
    "4812313200": "4811016300", # 경상남도 창원시 성산동 -> 경상남도 창원시 성산구 성산동
    "4812313300": "4811016400", # 경상남도 창원시 남양동 -> 경상남도 창원시 성산구 남양동
    "4812313400": "4811010900", # 경상남도 창원시 용지동 -> 경상남도 창원시 성산구 용지동
    "4812313500": "4811016100", # 경상남도 창원시 용호동 -> 경상남도 창원시 성산구 용호동
    "4812313600": "4811015800", # 경상남도 창원시 신월동 -> 경상남도 창원시 성산구 신월동
    "4812313700": "4811014800", # 경상남도 창원시 대원동 -> 경상남도 창원시 성산구 대원동
    "4812313800": "4811012300", # 경상남도 창원시 두대동 -> 경상남도 창원시 성산구 두대동
    "4812313900": "4811012200", # 경상남도 창원시 삼동동 -> 경상남도 창원시 성산구 삼동동
    "4812314000": "4811012400", # 경상남도 창원시 덕정동 -> 경상남도 창원시 성산구 덕정동
    "4812314100": "4811013800", # 경상남도 창원시 퇴촌동 -> 경상남도 창원시 성산구 퇴촌동
    "4812510100": "4816010100", # 경상남도 마산시 가포동 -> 경상남도 창원시 마산합포구 가포동
    "4812510200": "4816010200", # 경상남도 마산시 교방동 -> 경상남도 창원시 마산합포구 교방동
    "4812510300": "4816010300", # 경상남도 마산시 교원동 -> 경상남도 창원시 마산합포구 교원동
    "4812510400": "4816010400", # 경상남도 마산시 남성동 -> 경상남도 창원시 마산합포구 남성동
    "4812510500": "4816010500", # 경상남도 마산시 대내동 -> 경상남도 창원시 마산합포구 대내동
    "4812510600": "4816010600", # 경상남도 마산시 대성동1가 -> 경상남도 창원시 마산합포구 대성동1가
    "4812510700": "4816010700", # 경상남도 마산시 대성동2가 -> 경상남도 창원시 마산합포구 대성동2가
    "4812510800": "4816010800", # 경상남도 마산시 대외동 -> 경상남도 창원시 마산합포구 대외동
    "4812510900": "4816010900", # 경상남도 마산시 대창동 -> 경상남도 창원시 마산합포구 대창동
    "4812511000": "4816011000", # 경상남도 마산시 덕동동 -> 경상남도 창원시 마산합포구 덕동동
    "4812511100": "4816011100", # 경상남도 마산시 동성동 -> 경상남도 창원시 마산합포구 동성동
    "4812511200": "4816011200", # 경상남도 마산시 두월동1가 -> 경상남도 창원시 마산합포구 두월동1가
    "4812511300": "4816011300", # 경상남도 마산시 두월동2가 -> 경상남도 창원시 마산합포구 두월동2가
    "4812511400": "4816011400", # 경상남도 마산시 두월동3가 -> 경상남도 창원시 마산합포구 두월동3가
    "4812511500": "4816011500", # 경상남도 마산시 문화동 -> 경상남도 창원시 마산합포구 문화동
    "4812511600": "4816011600", # 경상남도 마산시 반월동 -> 경상남도 창원시 마산합포구 반월동
    "4812511700": "4816011700", # 경상남도 마산시 부림동 -> 경상남도 창원시 마산합포구 부림동
    "4812511800": "4816011800", # 경상남도 마산시 산호동 -> 경상남도 창원시 마산합포구 산호동
    "4812511900": "4816011900", # 경상남도 마산시 상남동 -> 경상남도 창원시 마산합포구 상남동
    "4812512000": "4816012000", # 경상남도 마산시 서성동 -> 경상남도 창원시 마산합포구 서성동
    "4812512100": "4816012100", # 경상남도 마산시 성호동 -> 경상남도 창원시 마산합포구 성호동
    "4812512200": "4816012200", # 경상남도 마산시 수성동 -> 경상남도 창원시 마산합포구 수성동
    "4812512300": "4816012300", # 경상남도 마산시 신월동 -> 경상남도 창원시 마산합포구 신월동
    "4812512400": "4816012400", # 경상남도 마산시 신창동 -> 경상남도 창원시 마산합포구 신창동
    "4812512500": "4816012500", # 경상남도 마산시 신포동1가 -> 경상남도 창원시 마산합포구 신포동1가
    "4812512600": "4816012600", # 경상남도 마산시 신포동2가 -> 경상남도 창원시 마산합포구 신포동2가
    "4812512700": "4816012700", # 경상남도 마산시 신흥동 -> 경상남도 창원시 마산합포구 신흥동
    "4812512800": "4816012800", # 경상남도 마산시 완월동 -> 경상남도 창원시 마산합포구 완월동
    "4812512900": "4816012900", # 경상남도 마산시 월남동1가 -> 경상남도 창원시 마산합포구 월남동1가
    "4812513000": "4816013000", # 경상남도 마산시 월남동2가 -> 경상남도 창원시 마산합포구 월남동2가
    "4812513100": "4816013100", # 경상남도 마산시 월남동3가 -> 경상남도 창원시 마산합포구 월남동3가
    "4812513200": "4816013200", # 경상남도 마산시 월남동4가 -> 경상남도 창원시 마산합포구 월남동4가
    "4812513300": "4816013300", # 경상남도 마산시 월남동5가 -> 경상남도 창원시 마산합포구 월남동5가
    "4812513400": "4816013400", # 경상남도 마산시 월영동 -> 경상남도 창원시 마산합포구 월영동
    "4812513500": "4816013500", # 경상남도 마산시 월포동 -> 경상남도 창원시 마산합포구 월포동
    "4812513600": "4816013600", # 경상남도 마산시 예곡동 -> 경상남도 창원시 마산합포구 예곡동
    "4812513700": "4816013700", # 경상남도 마산시 오동동 -> 경상남도 창원시 마산합포구 오동동
    "4812513800": "4816013800", # 경상남도 마산시 우산동 -> 경상남도 창원시 마산합포구 우산동
    "4812513900": "4816013900", # 경상남도 마산시 유록동 -> 경상남도 창원시 마산합포구 유록동
    "4812514000": "4816014000", # 경상남도 마산시 자산동 -> 경상남도 창원시 마산합포구 자산동
    "4812514100": "4816014100", # 경상남도 마산시 장군동1가 -> 경상남도 창원시 마산합포구 장군동1가
    "4812514200": "4816014200", # 경상남도 마산시 장군동2가 -> 경상남도 창원시 마산합포구 장군동2가
    "4812514300": "4816014300", # 경상남도 마산시 장군동3가 -> 경상남도 창원시 마산합포구 장군동3가
    "4812514400": "4816014400", # 경상남도 마산시 장군동4가 -> 경상남도 창원시 마산합포구 장군동4가
    "4812514500": "4816014500", # 경상남도 마산시 장군동5가 -> 경상남도 창원시 마산합포구 장군동5가
    "4812514600": "4816014600", # 경상남도 마산시 중성동 -> 경상남도 창원시 마산합포구 중성동
    "4812514700": "4816014700", # 경상남도 마산시 중앙동1가 -> 경상남도 창원시 마산합포구 중앙동1가
    "4812514800": "4816014800", # 경상남도 마산시 중앙동2가 -> 경상남도 창원시 마산합포구 중앙동2가
    "4812514900": "4816014900", # 경상남도 마산시 중앙동3가 -> 경상남도 창원시 마산합포구 중앙동3가
    "4812515000": "4816015000", # 경상남도 마산시 창동 -> 경상남도 창원시 마산합포구 창동
    "4812515100": "4816015100", # 경상남도 마산시 창포동1가 -> 경상남도 창원시 마산합포구 창포동1가
    "4812515200": "4816015200", # 경상남도 마산시 창포동2가 -> 경상남도 창원시 마산합포구 창포동2가
    "4812515300": "4816015300", # 경상남도 마산시 창포동3가 -> 경상남도 창원시 마산합포구 창포동3가
    "4812515400": "4816015400", # 경상남도 마산시 청계동 -> 경상남도 창원시 마산합포구 청계동
    "4812515500": "4816015500", # 경상남도 마산시 추산동 -> 경상남도 창원시 마산합포구 추산동
    "4812515600": "4816015600", # 경상남도 마산시 평화동 -> 경상남도 창원시 마산합포구 평화동
    "4812515700": "4816015700", # 경상남도 마산시 화영동 -> 경상남도 창원시 마산합포구 화영동
    "4812515800": "4816015800", # 경상남도 마산시 해운동 -> 경상남도 창원시 마산합포구 해운동
    "4812515900": "4816015900", # 경상남도 마산시 현동 -> 경상남도 창원시 마산합포구 현동
    "4812516000": "4816016000", # 경상남도 마산시 홍문동 -> 경상남도 창원시 마산합포구 홍문동
    "4812531000": "4816031000", # 경상남도 마산시 구산면 -> 경상남도 창원시 마산합포구 구산면
    "4812531021": "4816031021", # 경상남도 마산시 구산면 유산리 -> 경상남도 창원시 마산합포구 구산면 유산리
    "4812531022": "4816031022", # 경상남도 마산시 구산면 마전리 -> 경상남도 창원시 마산합포구 구산면 마전리
    "4812531023": "4816031023", # 경상남도 마산시 구산면 석곡리 -> 경상남도 창원시 마산합포구 구산면 석곡리
    "4812531024": "4816031024", # 경상남도 마산시 구산면 수정리 -> 경상남도 창원시 마산합포구 구산면 수정리
    "4812531025": "4816031025", # 경상남도 마산시 구산면 내포리 -> 경상남도 창원시 마산합포구 구산면 내포리
    "4812531026": "4816031026", # 경상남도 마산시 구산면 옥계리 -> 경상남도 창원시 마산합포구 구산면 옥계리
    "4812531027": "4816031027", # 경상남도 마산시 구산면 반동리 -> 경상남도 창원시 마산합포구 구산면 반동리
    "4812531028": "4816031028", # 경상남도 마산시 구산면 구복리 -> 경상남도 창원시 마산합포구 구산면 구복리
    "4812531029": "4816031029", # 경상남도 마산시 구산면 심리 -> 경상남도 창원시 마산합포구 구산면 심리
    "4812531030": "4816031030", # 경상남도 마산시 구산면 난포리 -> 경상남도 창원시 마산합포구 구산면 난포리
    "4812532000": "4816032000", # 경상남도 마산시 진동면 -> 경상남도 창원시 마산합포구 진동면
    "4812532021": "4816032021", # 경상남도 마산시 진동면 고현리 -> 경상남도 창원시 마산합포구 진동면 고현리
    "4812532022": "4816032022", # 경상남도 마산시 진동면 신기리 -> 경상남도 창원시 마산합포구 진동면 신기리
    "4812532023": "4816032023", # 경상남도 마산시 진동면 사동리 -> 경상남도 창원시 마산합포구 진동면 사동리
    "4812532024": "4816032024", # 경상남도 마산시 진동면 진동리 -> 경상남도 창원시 마산합포구 진동면 진동리
    "4812532025": "4816032025", # 경상남도 마산시 진동면 요장리 -> 경상남도 창원시 마산합포구 진동면 요장리
    "4812532026": "4816032026", # 경상남도 마산시 진동면 다구리 -> 경상남도 창원시 마산합포구 진동면 다구리
    "4812532027": "4816032027", # 경상남도 마산시 진동면 교동리 -> 경상남도 창원시 마산합포구 진동면 교동리
    "4812532028": "4816032028", # 경상남도 마산시 진동면 인곡리 -> 경상남도 창원시 마산합포구 진동면 인곡리
    "4812532029": "4816032029", # 경상남도 마산시 진동면 태봉리 -> 경상남도 창원시 마산합포구 진동면 태봉리
    "4812532030": "4816032030", # 경상남도 마산시 진동면 동전리 -> 경상남도 창원시 마산합포구 진동면 동전리
    "4812533000": "4816033000", # 경상남도 마산시 진북면 -> 경상남도 창원시 마산합포구 진북면
    "4812533021": "4816033021", # 경상남도 마산시 진북면 지산리 -> 경상남도 창원시 마산합포구 진북면 지산리
    "4812533022": "4816033022", # 경상남도 마산시 진북면 예곡리 -> 경상남도 창원시 마산합포구 진북면 예곡리
    "4812533023": "4816033023", # 경상남도 마산시 진북면 인곡리 -> 경상남도 창원시 마산합포구 진북면 인곡리
    "4812533024": "4816033024", # 경상남도 마산시 진북면 대평리 -> 경상남도 창원시 마산합포구 진북면 대평리
    "4812533025": "4816033025", # 경상남도 마산시 진북면 이목리 -> 경상남도 창원시 마산합포구 진북면 이목리
    "4812533026": "4816033026", # 경상남도 마산시 진북면 금산리 -> 경상남도 창원시 마산합포구 진북면 금산리
    "4812533027": "4816033027", # 경상남도 마산시 진북면 영학리 -> 경상남도 창원시 마산합포구 진북면 영학리
    "4812533028": "4816033028", # 경상남도 마산시 진북면 부산리 -> 경상남도 창원시 마산합포구 진북면 부산리
    "4812533029": "4816033029", # 경상남도 마산시 진북면 덕곡리 -> 경상남도 창원시 마산합포구 진북면 덕곡리
    "4812533030": "4816033030", # 경상남도 마산시 진북면 신촌리 -> 경상남도 창원시 마산합포구 진북면 신촌리
    "4812533031": "4816033031", # 경상남도 마산시 진북면 망곡리 -> 경상남도 창원시 마산합포구 진북면 망곡리
    "4812533032": "4816033032", # 경상남도 마산시 진북면 부평리 -> 경상남도 창원시 마산합포구 진북면 부평리
    "4812533033": "4816033033", # 경상남도 마산시 진북면 추곡리 -> 경상남도 창원시 마산합포구 진북면 추곡리
    "4812533034": "4816033034", # 경상남도 마산시 진북면 대티리 -> 경상남도 창원시 마산합포구 진북면 대티리
    "4812533035": "4816033035", # 경상남도 마산시 진북면 정현리 -> 경상남도 창원시 마산합포구 진북면 정현리
    "4812534000": "4816034000", # 경상남도 마산시 진전면 -> 경상남도 창원시 마산합포구 진전면
    "4812534021": "4816034021", # 경상남도 마산시 진전면 율티리 -> 경상남도 창원시 마산합포구 진전면 율티리
    "4812534022": "4816034022", # 경상남도 마산시 진전면 근곡리 -> 경상남도 창원시 마산합포구 진전면 근곡리
    "4812534023": "4816034023", # 경상남도 마산시 진전면 임곡리 -> 경상남도 창원시 마산합포구 진전면 임곡리
    "4812534024": "4816034024", # 경상남도 마산시 진전면 봉곡리 -> 경상남도 창원시 마산합포구 진전면 봉곡리
    "4812534025": "4816034025", # 경상남도 마산시 진전면 곡안리 -> 경상남도 창원시 마산합포구 진전면 곡안리
    "4812534026": "4816034026", # 경상남도 마산시 진전면 동산리 -> 경상남도 창원시 마산합포구 진전면 동산리
    "4812534027": "4816034027", # 경상남도 마산시 진전면 양촌리 -> 경상남도 창원시 마산합포구 진전면 양촌리
    "4812534028": "4816034028", # 경상남도 마산시 진전면 봉암리 -> 경상남도 창원시 마산합포구 진전면 봉암리
    "4812534029": "4816034029", # 경상남도 마산시 진전면 일암리 -> 경상남도 창원시 마산합포구 진전면 일암리
    "4812534030": "4816034030", # 경상남도 마산시 진전면 오서리 -> 경상남도 창원시 마산합포구 진전면 오서리
    "4812534031": "4816034031", # 경상남도 마산시 진전면 이명리 -> 경상남도 창원시 마산합포구 진전면 이명리
    "4812534032": "4816034032", # 경상남도 마산시 진전면 창포리 -> 경상남도 창원시 마산합포구 진전면 창포리
    "4812534033": "4816034033", # 경상남도 마산시 진전면 시락리 -> 경상남도 창원시 마산합포구 진전면 시락리
    "4812534034": "4816034034", # 경상남도 마산시 진전면 평암리 -> 경상남도 창원시 마산합포구 진전면 평암리
    "4812534035": "4816034035", # 경상남도 마산시 진전면 금암리 -> 경상남도 창원시 마산합포구 진전면 금암리
    "4812534036": "4816034036", # 경상남도 마산시 진전면 고사리 -> 경상남도 창원시 마산합포구 진전면 고사리
    "4812534037": "4816034037", # 경상남도 마산시 진전면 여양리 -> 경상남도 창원시 마산합포구 진전면 여양리
    "4812710100": "4816016100", # 경상남도 마산시 구암동 -> 경상남도 창원시 마산회원구 구암동
    "4812710200": "4816016200", # 경상남도 마산시 두척동 -> 경상남도 창원시 마산회원구 두척동
    "4812710300": "4816016300", # 경상남도 마산시 봉암동 -> 경상남도 창원시 마산회원구 봉암동
    "4812710400": "4816016400", # 경상남도 마산시 석전동 -> 경상남도 창원시 마산회원구 석전동
    "4812710500": "4816016500", # 경상남도 마산시 양덕동 -> 경상남도 창원시 마산회원구 양덕동
    "4812710600": "4816016600", # 경상남도 마산시 합성동 -> 경상남도 창원시 마산회원구 합성동
    "4812710700": "4816016700", # 경상남도 마산시 회성동 -> 경상남도 창원시 마산회원구 회성동
    "4812710800": "4816016800", # 경상남도 마산시 회원동 -> 경상남도 창원시 마산회원구 회원동
    "4812725000": "4816025000", # 경상남도 마산시 내서읍 -> 경상남도 창원시 마산회원구 내서읍
    "4812725021": "4816025021", # 경상남도 마산시 내서읍 안성리 -> 경상남도 창원시 마산회원구 내서읍 안성리
    "4812725022": "4816025022", # 경상남도 마산시 내서읍 평성리 -> 경상남도 창원시 마산회원구 내서읍 평성리
    "4812725023": "4816025023", # 경상남도 마산시 내서읍 호계리 -> 경상남도 창원시 마산회원구 내서읍 호계리
    "4812725024": "4816025024", # 경상남도 마산시 내서읍 용담리 -> 경상남도 창원시 마산회원구 내서읍 용담리
    "4812725025": "4816025025", # 경상남도 마산시 내서읍 중리 -> 경상남도 창원시 마산회원구 내서읍 중리
    "4812725026": "4816025026", # 경상남도 마산시 내서읍 상곡리 -> 경상남도 창원시 마산회원구 내서읍 상곡리
    "4812725027": "4816025027", # 경상남도 마산시 내서읍 원계리 -> 경상남도 창원시 마산회원구 내서읍 원계리
    "4812725028": "4816025028", # 경상남도 마산시 내서읍 삼계리 -> 경상남도 창원시 마산회원구 내서읍 삼계리
    "4812725029": "4816025029", # 경상남도 마산시 내서읍 신감리 -> 경상남도 창원시 마산회원구 내서읍 신감리
    "4812725030": "4816025030", # 경상남도 마산시 내서읍 감천리 -> 경상남도 창원시 마산회원구 내서읍 감천리
    "4812910100": "4819010100", # 경상남도 진해시 동상동 -> 경상남도 창원시 진해구 동상동
    "4812910200": "4819010200", # 경상남도 진해시 도천동 -> 경상남도 창원시 진해구 도천동
    "4812910300": "4819010300", # 경상남도 진해시 도만동 -> 경상남도 창원시 진해구 도만동
    "4812910400": "4819010400", # 경상남도 진해시 신흥동 -> 경상남도 창원시 진해구 신흥동
    "4812910500": "4819010500", # 경상남도 진해시 현동 -> 경상남도 창원시 진해구 현동
    "4812910600": "4819010600", # 경상남도 진해시 비봉동 -> 경상남도 창원시 진해구 비봉동
    "4812910700": "4819010700", # 경상남도 진해시 태평동 -> 경상남도 창원시 진해구 태평동
    "4812910800": "4819010800", # 경상남도 진해시 충의동 -> 경상남도 창원시 진해구 충의동
    "4812910900": "4819010900", # 경상남도 진해시 무송동 -> 경상남도 창원시 진해구 무송동
    "4812911000": "4819011000", # 경상남도 진해시 인의동 -> 경상남도 창원시 진해구 인의동
    "4812911100": "4819011100", # 경상남도 진해시 숭인동 -> 경상남도 창원시 진해구 숭인동
    "4812911200": "4819011200", # 경상남도 진해시 대영동 -> 경상남도 창원시 진해구 대영동
    "4812911300": "4819011300", # 경상남도 진해시 남빈동 -> 경상남도 창원시 진해구 남빈동
    "4812911400": "4819011400", # 경상남도 진해시 앵곡동 -> 경상남도 창원시 진해구 앵곡동
    "4812911500": "4819011500", # 경상남도 진해시 제황산동 -> 경상남도 창원시 진해구 제황산동
    "4812911600": "4819011600", # 경상남도 진해시 속천동 -> 경상남도 창원시 진해구 속천동
    "4812911700": "4819011700", # 경상남도 진해시 대죽동 -> 경상남도 창원시 진해구 대죽동
    "4812911800": "4819011800", # 경상남도 진해시 안곡동 -> 경상남도 창원시 진해구 안곡동
    "4812911900": "4819011900", # 경상남도 진해시 수송동 -> 경상남도 창원시 진해구 수송동
    "4812912000": "4819012000", # 경상남도 진해시 회현동 -> 경상남도 창원시 진해구 회현동
    "4812912100": "4819012100", # 경상남도 진해시 익선동 -> 경상남도 창원시 진해구 익선동
    "4812912200": "4819012200", # 경상남도 진해시 창선동 -> 경상남도 창원시 진해구 창선동
    "4812912300": "4819012300", # 경상남도 진해시 대천동 -> 경상남도 창원시 진해구 대천동
    "4812912400": "4819012400", # 경상남도 진해시 광화동 -> 경상남도 창원시 진해구 광화동
    "4812912500": "4819012500", # 경상남도 진해시 통신동 -> 경상남도 창원시 진해구 통신동
    "4812912600": "4819012600", # 경상남도 진해시 중앙동 -> 경상남도 창원시 진해구 중앙동
    "4812912700": "4819012700", # 경상남도 진해시 부흥동 -> 경상남도 창원시 진해구 부흥동
    "4812912800": "4819012800", # 경상남도 진해시 중평동 -> 경상남도 창원시 진해구 중평동
    "4812912900": "4819012900", # 경상남도 진해시 근화동 -> 경상남도 창원시 진해구 근화동
    "4812913000": "4819013000", # 경상남도 진해시 송죽동 -> 경상남도 창원시 진해구 송죽동
    "4812913100": "4819013100", # 경상남도 진해시 화천동 -> 경상남도 창원시 진해구 화천동
    "4812913200": "4819013200", # 경상남도 진해시 송학동 -> 경상남도 창원시 진해구 송학동
    "4812913300": "4819013300", # 경상남도 진해시 대흥동 -> 경상남도 창원시 진해구 대흥동
    "4812913400": "4819013400", # 경상남도 진해시 평안동 -> 경상남도 창원시 진해구 평안동
    "4812913500": "4819013500", # 경상남도 진해시 충무동 -> 경상남도 창원시 진해구 충무동
    "4812913600": "4819013600", # 경상남도 진해시 인사동 -> 경상남도 창원시 진해구 인사동
    "4812913700": "4819013700", # 경상남도 진해시 여좌동 -> 경상남도 창원시 진해구 여좌동
    "4812913800": "4819013800", # 경상남도 진해시 태백동 -> 경상남도 창원시 진해구 태백동
    "4812913900": "4819013900", # 경상남도 진해시 경화동 -> 경상남도 창원시 진해구 경화동
    "4812914000": "4819014000", # 경상남도 진해시 석동 -> 경상남도 창원시 진해구 석동
    "4812914100": "4819014100", # 경상남도 진해시 이동 -> 경상남도 창원시 진해구 이동
    "4812914200": "4819014200", # 경상남도 진해시 자은동 -> 경상남도 창원시 진해구 자은동
    "4812914300": "4819014300", # 경상남도 진해시 덕산동 -> 경상남도 창원시 진해구 덕산동
    "4812914400": "4819014400", # 경상남도 진해시 풍호동 -> 경상남도 창원시 진해구 풍호동
    "4812914500": "4819014500", # 경상남도 진해시 장천동 -> 경상남도 창원시 진해구 장천동
    "4812914600": "4819014600", # 경상남도 진해시 행암동 -> 경상남도 창원시 진해구 행암동
    "4812914700": "4819014700", # 경상남도 진해시 북부동 -> 경상남도 창원시 진해구 북부동
    "4812914800": "4819014800", # 경상남도 진해시 성내동 -> 경상남도 창원시 진해구 성내동
    "4812914900": "4819014900", # 경상남도 진해시 서중동 -> 경상남도 창원시 진해구 서중동
    "4812915000": "4819015000", # 경상남도 진해시 남문동 -> 경상남도 창원시 진해구 남문동
    "4812915100": "4819015100", # 경상남도 진해시 제덕동 -> 경상남도 창원시 진해구 제덕동
    "4812915200": "4819015200", # 경상남도 진해시 수도동 -> 경상남도 창원시 진해구 수도동
    "4812915300": "4819015300", # 경상남도 진해시 연도동 -> 경상남도 창원시 진해구 연도동
    "4812915400": "4819015400", # 경상남도 진해시 명동 -> 경상남도 창원시 진해구 명동
    "4812915500": "4819015500", # 경상남도 진해시 죽곡동 -> 경상남도 창원시 진해구 죽곡동
    "4812915600": "4819015600", # 경상남도 진해시 원포동 -> 경상남도 창원시 진해구 원포동
    "4812915700": "4819015700", # 경상남도 진해시 남양동 -> 경상남도 창원시 진해구 남양동
    "4812915800": "4819015800", # 경상남도 진해시 마천동 -> 경상남도 창원시 진해구 마천동
    "4812915900": "4819015900", # 경상남도 진해시 소사동 -> 경상남도 창원시 진해구 소사동
    "4812916000": "4819016000", # 경상남도 진해시 대장동 -> 경상남도 창원시 진해구 대장동
    "4812916100": "4819016100", # 경상남도 진해시 두동 -> 경상남도 창원시 진해구 두동
    "4812916200": "4819016200", # 경상남도 진해시 청안동 -> 경상남도 창원시 진해구 청안동
    "4812916300": "4819016300", # 경상남도 진해시 안골동 -> 경상남도 창원시 진해구 안골동
    "4812916400": "4819016400", # 경상남도 진해시 용원동 -> 경상남도 창원시 진해구 용원동
    "4812916500": "4819016500", # 경상남도 진해시 가주동 -> 경상남도 창원시 진해구 가주동

    "4413110100": "4413010100", # 충청남도 천안시 대흥동 -> 충청남도 천안시 동남구 대흥동
    "4413110200": "4413010300", # 충청남도 천안시 성황동 -> 충청남도 천안시 동남구 성황동
    "4413110300": "4413010400", # 충청남도 천안시 문화동 -> 충청남도 천안시 동남구 문화동
    "4413110400": "4413010500", # 충청남도 천안시 사직동 -> 충청남도 천안시 동남구 사직동
    "4413110500": "4413010600", # 충청남도 천안시 영성동 -> 충청남도 천안시 동남구 영성동
    "4413110600": "4413010700", # 충청남도 천안시 오룡동 -> 충청남도 천안시 동남구 오룡동
    "4413110700": "4413010800", # 충청남도 천안시 원성동 -> 충청남도 천안시 동남구 원성동
    "4413110800": "4413010900", # 충청남도 천안시 구성동 -> 충청남도 천안시 동남구 구성동
    "4413110900": "4413011000", # 충청남도 천안시 청수동 -> 충청남도 천안시 동남구 청수동
    "4413111000": "4413011100", # 충청남도 천안시 삼룡동 -> 충청남도 천안시 동남구 삼룡동
    "4413111100": "4413011200", # 충청남도 천안시 청당동 -> 충청남도 천안시 동남구 청당동
    "4413111200": "4413011300", # 충청남도 천안시 유량동 -> 충청남도 천안시 동남구 유량동
    "4413111300": "4413011900", # 충청남도 천안시 봉명동 -> 충청남도 천안시 동남구 봉명동
    "4413111400": "4413012000", # 충청남도 천안시 다가동 -> 충청남도 천안시 동남구 다가동
    "4413111500": "4413012100", # 충청남도 천안시 용곡동 -> 충청남도 천안시 동남구 용곡동
    "4413111600": "4413012200", # 충청남도 천안시 신방동 -> 충청남도 천안시 동남구 신방동
    "4413111700": "4413012300", # 충청남도 천안시 쌍용동 -> 충청남도 천안시 동남구 쌍용동
    "4413111800": "4413012500", # 충청남도 천안시 신부동 -> 충청남도 천안시 동남구 신부동
    "4413111900": "4413012900", # 충청남도 천안시 안서동 -> 충청남도 천안시 동남구 안서동
    "4413112000": "4413013000", # 충청남도 천안시 구룡동 -> 충청남도 천안시 동남구 구룡동
    "4413125000": "4413025900", # 충청남도 천안시 목천읍 -> 충청남도 천안시 동남구 목천읍
    "4413131000": "4413031000", # 충청남도 천안시 풍세면 -> 충청남도 천안시 동남구 풍세면
    "4413131021": "4413031021", # 충청남도 천안시 풍세면 풍서리 -> 충청남도 천안시 동남구 풍세면 풍서리
    "4413131022": "4413031022", # 충청남도 천안시 풍세면 가송리 -> 충청남도 천안시 동남구 풍세면 가송리
    "4413131023": "4413031023", # 충청남도 천안시 풍세면 미죽리 -> 충청남도 천안시 동남구 풍세면 미죽리
    "4413131024": "4413031024", # 충청남도 천안시 풍세면 두남리 -> 충청남도 천안시 동남구 풍세면 두남리
    "4413131025": "4413031025", # 충청남도 천안시 풍세면 남관리 -> 충청남도 천안시 동남구 풍세면 남관리
    "4413131026": "4413031026", # 충청남도 천안시 풍세면 삼태리 -> 충청남도 천안시 동남구 풍세면 삼태리
    "4413131027": "4413031027", # 충청남도 천안시 풍세면 용정리 -> 충청남도 천안시 동남구 풍세면 용정리
    "4413131028": "4413031028", # 충청남도 천안시 풍세면 보성리 -> 충청남도 천안시 동남구 풍세면 보성리
    "4413132000": "4413032000", # 충청남도 천안시 광덕면 -> 충청남도 천안시 동남구 광덕면
    "4413132021": "4413032021", # 충청남도 천안시 광덕면 광덕리 -> 충청남도 천안시 동남구 광덕면 광덕리
    "4413132022": "4413032022", # 충청남도 천안시 광덕면 지장리 -> 충청남도 천안시 동남구 광덕면 지장리
    "4413132023": "4413032023", # 충청남도 천안시 광덕면 보산원리 -> 충청남도 천안시 동남구 광덕면 보산원리
    "4413132024": "4413032024", # 충청남도 천안시 광덕면 대덕리 -> 충청남도 천안시 동남구 광덕면 대덕리
    "4413132025": "4413032025", # 충청남도 천안시 광덕면 매당리 -> 충청남도 천안시 동남구 광덕면 매당리
    "4413132026": "4413032026", # 충청남도 천안시 광덕면 신흥리 -> 충청남도 천안시 동남구 광덕면 신흥리
    "4413132027": "4413032027", # 충청남도 천안시 광덕면 무학리 -> 충청남도 천안시 동남구 광덕면 무학리
    "4413132028": "4413032028", # 충청남도 천안시 광덕면 신덕리 -> 충청남도 천안시 동남구 광덕면 신덕리
    "4413132029": "4413032029", # 충청남도 천안시 광덕면 행정리 -> 충청남도 천안시 동남구 광덕면 행정리
    "4413132030": "4413032030", # 충청남도 천안시 광덕면 대평리 -> 충청남도 천안시 동남구 광덕면 대평리
    "4413132031": "4413032031", # 충청남도 천안시 광덕면 원덕리 -> 충청남도 천안시 동남구 광덕면 원덕리
    "4413133000": "4413034000", # 충청남도 천안시 북면 -> 충청남도 천안시 동남구 북면
    "4413133021": "4413034021", # 충청남도 천안시 북면 연춘리 -> 충청남도 천안시 동남구 북면 연춘리
    "4413133022": "4413034022", # 충청남도 천안시 북면 상동리 -> 충청남도 천안시 동남구 북면 상동리
    "4413133023": "4413034023", # 충청남도 천안시 북면 은지리 -> 충청남도 천안시 동남구 북면 은지리
    "4413133024": "4413034024", # 충청남도 천안시 북면 용암리 -> 충청남도 천안시 동남구 북면 용암리
    "4413133025": "4413034025", # 충청남도 천안시 북면 매송리 -> 충청남도 천안시 동남구 북면 매송리
    "4413133026": "4413034026", # 충청남도 천안시 북면 명덕리 -> 충청남도 천안시 동남구 북면 명덕리
    "4413133027": "4413034027", # 충청남도 천안시 북면 오곡리 -> 충청남도 천안시 동남구 북면 오곡리
    "4413133028": "4413034028", # 충청남도 천안시 북면 사담리 -> 충청남도 천안시 동남구 북면 사담리
    "4413133029": "4413034029", # 충청남도 천안시 북면 전곡리 -> 충청남도 천안시 동남구 북면 전곡리
    "4413133030": "4413034030", # 충청남도 천안시 북면 양곡리 -> 충청남도 천안시 동남구 북면 양곡리
    "4413133031": "4413034031", # 충청남도 천안시 북면 납안리 -> 충청남도 천안시 동남구 북면 납안리
    "4413133032": "4413034032", # 충청남도 천안시 북면 운용리 -> 충청남도 천안시 동남구 북면 운용리
    "4413133033": "4413034033", # 충청남도 천안시 북면 대평리 -> 충청남도 천안시 동남구 북면 대평리
    "4413134000": "4413035000", # 충청남도 천안시 성남면 -> 충청남도 천안시 동남구 성남면
    "4413134021": "4413035021", # 충청남도 천안시 성남면 신덕리 -> 충청남도 천안시 동남구 성남면 신덕리
    "4413134022": "4413035022", # 충청남도 천안시 성남면 봉양리 -> 충청남도 천안시 동남구 성남면 봉양리
    "4413134023": "4413035023", # 충청남도 천안시 성남면 대흥리 -> 충청남도 천안시 동남구 성남면 대흥리
    "4413134024": "4413035024", # 충청남도 천안시 성남면 대정리 -> 충청남도 천안시 동남구 성남면 대정리
    "4413134025": "4413035025", # 충청남도 천안시 성남면 석곡리 -> 충청남도 천안시 동남구 성남면 석곡리
    "4413134026": "4413035026", # 충청남도 천안시 성남면 용원리 -> 충청남도 천안시 동남구 성남면 용원리
    "4413134027": "4413035027", # 충청남도 천안시 성남면 신사리 -> 충청남도 천안시 동남구 성남면 신사리
    "4413134028": "4413035028", # 충청남도 천안시 성남면 대화리 -> 충청남도 천안시 동남구 성남면 대화리
    "4413134029": "4413035029", # 충청남도 천안시 성남면 화성리 -> 충청남도 천안시 동남구 성남면 화성리
    "4413135000": "4413036000", # 충청남도 천안시 수신면 -> 충청남도 천안시 동남구 수신면
    "4413135021": "4413036021", # 충청남도 천안시 수신면 속창리 -> 충청남도 천안시 동남구 수신면 속창리
    "4413135022": "4413036022", # 충청남도 천안시 수신면 신풍리 -> 충청남도 천안시 동남구 수신면 신풍리
    "4413135023": "4413036023", # 충청남도 천안시 수신면 해정리 -> 충청남도 천안시 동남구 수신면 해정리
    "4413135024": "4413036024", # 충청남도 천안시 수신면 백자리 -> 충청남도 천안시 동남구 수신면 백자리
    "4413135025": "4413036025", # 충청남도 천안시 수신면 발산리 -> 충청남도 천안시 동남구 수신면 발산리
    "4413135026": "4413036026", # 충청남도 천안시 수신면 장산리 -> 충청남도 천안시 동남구 수신면 장산리
    "4413136000": "4413037000", # 충청남도 천안시 병천면 -> 충청남도 천안시 동남구 병천면
    "4413136021": "4413037021", # 충청남도 천안시 병천면 가전리 -> 충청남도 천안시 동남구 병천면 가전리
    "4413136022": "4413037022", # 충청남도 천안시 병천면 병천리 -> 충청남도 천안시 동남구 병천면 병천리
    "4413136023": "4413037023", # 충청남도 천안시 병천면 탑원리 -> 충청남도 천안시 동남구 병천면 탑원리
    "4413136024": "4413037024", # 충청남도 천안시 병천면 도원리 -> 충청남도 천안시 동남구 병천면 도원리
    "4413136025": "4413037025", # 충청남도 천안시 병천면 매성리 -> 충청남도 천안시 동남구 병천면 매성리
    "4413136026": "4413037026", # 충청남도 천안시 병천면 관성리 -> 충청남도 천안시 동남구 병천면 관성리
    "4413136027": "4413037027", # 충청남도 천안시 병천면 봉항리 -> 충청남도 천안시 동남구 병천면 봉항리
    "4413136028": "4413037028", # 충청남도 천안시 병천면 용두리 -> 충청남도 천안시 동남구 병천면 용두리
    "4413136029": "4413037029", # 충청남도 천안시 병천면 송정리 -> 충청남도 천안시 동남구 병천면 송정리
    "4413137000": "4413038000", # 충청남도 천안시 동면 -> 충청남도 천안시 동남구 동면
    "4413137021": "4413038021", # 충청남도 천안시 동면 구도리 -> 충청남도 천안시 동남구 동면 구도리
    "4413137022": "4413038022", # 충청남도 천안시 동면 송연리 -> 충청남도 천안시 동남구 동면 송연리
    "4413137023": "4413038023", # 충청남도 천안시 동면 화계리 -> 충청남도 천안시 동남구 동면 화계리
    "4413137024": "4413038024", # 충청남도 천안시 동면 광덕리 -> 충청남도 천안시 동남구 동면 광덕리
    "4413137025": "4413038025", # 충청남도 천안시 동면 동산리 -> 충청남도 천안시 동남구 동면 동산리
    "4413137026": "4413038026", # 충청남도 천안시 동면 행암리 -> 충청남도 천안시 동남구 동면 행암리
    "4413137027": "4413038027", # 충청남도 천안시 동면 덕성리 -> 충청남도 천안시 동남구 동면 덕성리
    "4413137028": "4413038028", # 충청남도 천안시 동면 죽계리 -> 충청남도 천안시 동남구 동면 죽계리
    "4413137029": "4413038029", # 충청남도 천안시 동면 장송리 -> 충청남도 천안시 동남구 동면 장송리
    "4413137030": "4413038030", # 충청남도 천안시 동면 수남리 -> 충청남도 천안시 동남구 동면 수남리
    "4413137031": "4413038031", # 충청남도 천안시 동면 화덕리 -> 충청남도 천안시 동남구 동면 화덕리
    "4413310100": "4413010200", # 충청남도 천안시 와촌동 -> 충청남도 천안시 서북구 와촌동
    "4413310200": "4413011400", # 충청남도 천안시 성정동 -> 충청남도 천안시 서북구 성정동
    "4413310300": "4413011500", # 충청남도 천안시 백석동 -> 충청남도 천안시 서북구 백석동
    "4413310400": "4413011600", # 충청남도 천안시 두정동 -> 충청남도 천안시 서북구 두정동
    "4413310500": "4413011700", # 충청남도 천안시 성성동 -> 충청남도 천안시 서북구 성성동
    "4413310600": "4413011800", # 충청남도 천안시 차암동 -> 충청남도 천안시 서북구 차암동
    "4413310700": "4413012300", # 충청남도 천안시 쌍용동 -> 충청남도 천안시 서북구 쌍용동
    "4413310800": "4413012400", # 충청남도 천안시 불당동 -> 충청남도 천안시 서북구 불당동
    "4413310900": "4413012600", # 충청남도 천안시 업성동 -> 충청남도 천안시 서북구 업성동
    "4413311000": "4413012700", # 충청남도 천안시 신당동 -> 충청남도 천안시 서북구 신당동
    "4413311100": "4413012800", # 충청남도 천안시 부대동 -> 충청남도 천안시 서북구 부대동
    "4413325000": "4413025000", # 충청남도 천안시 성환읍 -> 충청남도 천안시 서북구 성환읍
    "4413325021": "4413025021", # 충청남도 천안시 성환읍 성환리 -> 충청남도 천안시 서북구 성환읍 성환리
    "4413325022": "4413025022", # 충청남도 천안시 성환읍 성월리 -> 충청남도 천안시 서북구 성환읍 성월리
    "4413325023": "4413025023", # 충청남도 천안시 성환읍 매주리 -> 충청남도 천안시 서북구 성환읍 매주리
    "4413325024": "4413025024", # 충청남도 천안시 성환읍 율금리 -> 충청남도 천안시 서북구 성환읍 율금리
    "4413325025": "4413025025", # 충청남도 천안시 성환읍 왕림리 -> 충청남도 천안시 서북구 성환읍 왕림리
    "4413325026": "4413025026", # 충청남도 천안시 성환읍 신방리 -> 충청남도 천안시 서북구 성환읍 신방리
    "4413325027": "4413025027", # 충청남도 천안시 성환읍 송덕리 -> 충청남도 천안시 서북구 성환읍 송덕리
    "4413325028": "4413025028", # 충청남도 천안시 성환읍 우신리 -> 충청남도 천안시 서북구 성환읍 우신리
    "4413325029": "4413025029", # 충청남도 천안시 성환읍 어룡리 -> 충청남도 천안시 서북구 성환읍 어룡리
    "4413325030": "4413025030", # 충청남도 천안시 성환읍 복모리 -> 충청남도 천안시 서북구 성환읍 복모리
    "4413325031": "4413025031", # 충청남도 천안시 성환읍 신가리 -> 충청남도 천안시 서북구 성환읍 신가리
    "4413325032": "4413025032", # 충청남도 천안시 성환읍 와룡리 -> 충청남도 천안시 서북구 성환읍 와룡리
    "4413325033": "4413025033", # 충청남도 천안시 성환읍 학정리 -> 충청남도 천안시 서북구 성환읍 학정리
    "4413325034": "4413025034", # 충청남도 천안시 성환읍 대홍리 -> 충청남도 천안시 서북구 성환읍 대홍리
    "4413325035": "4413025035", # 충청남도 천안시 성환읍 수향리 -> 충청남도 천안시 서북구 성환읍 수향리
    "4413325036": "4413025036", # 충청남도 천안시 성환읍 안궁리 -> 충청남도 천안시 서북구 성환읍 안궁리
    "4413325037": "4413025037", # 충청남도 천안시 성환읍 양령리 -> 충청남도 천안시 서북구 성환읍 양령리
    "4413325038": "4413025038", # 충청남도 천안시 성환읍 도하리 -> 충청남도 천안시 서북구 성환읍 도하리
    "4413325300": "4413025300", # 충청남도 천안시 성거읍 -> 충청남도 천안시 서북구 성거읍
    "4413325321": "4413025321", # 충청남도 천안시 성거읍 송남리 -> 충청남도 천안시 서북구 성거읍 송남리
    "4413325322": "4413025322", # 충청남도 천안시 성거읍 천흥리 -> 충청남도 천안시 서북구 성거읍 천흥리
    "4413325323": "4413025323", # 충청남도 천안시 성거읍 오목리 -> 충청남도 천안시 서북구 성거읍 오목리
    "4413325324": "4413025324", # 충청남도 천안시 성거읍 오색당리 -> 충청남도 천안시 서북구 성거읍 오색당리
    "4413325325": "4413025325", # 충청남도 천안시 성거읍 저리 -> 충청남도 천안시 서북구 성거읍 저리
    "4413325326": "4413025326", # 충청남도 천안시 성거읍 모전리 -> 충청남도 천안시 서북구 성거읍 모전리
    "4413325327": "4413025327", # 충청남도 천안시 성거읍 삼곡리 -> 충청남도 천안시 서북구 성거읍 삼곡리
    "4413325328": "4413025328", # 충청남도 천안시 성거읍 정촌리 -> 충청남도 천안시 서북구 성거읍 정촌리
    "4413325329": "4413025329", # 충청남도 천안시 성거읍 문덕리 -> 충청남도 천안시 서북구 성거읍 문덕리
    "4413325330": "4413025330", # 충청남도 천안시 성거읍 석교리 -> 충청남도 천안시 서북구 성거읍 석교리
    "4413325331": "4413025331", # 충청남도 천안시 성거읍 요방리 -> 충청남도 천안시 서북구 성거읍 요방리
    "4413325332": "4413025332", # 충청남도 천안시 성거읍 소우리 -> 충청남도 천안시 서북구 성거읍 소우리
    "4413325333": "4413025333", # 충청남도 천안시 성거읍 신월리 -> 충청남도 천안시 서북구 성거읍 신월리
    "4413325600": "4413025600", # 충청남도 천안시 직산읍 -> 충청남도 천안시 서북구 직산읍
    "4413325621": "4413025621", # 충청남도 천안시 직산읍 군동리 -> 충청남도 천안시 서북구 직산읍 군동리
    "4413325622": "4413025622", # 충청남도 천안시 직산읍 군서리 -> 충청남도 천안시 서북구 직산읍 군서리
    "4413325623": "4413025623", # 충청남도 천안시 직산읍 남산리 -> 충청남도 천안시 서북구 직산읍 남산리
    "4413325624": "4413025624", # 충청남도 천안시 직산읍 판정리 -> 충청남도 천안시 서북구 직산읍 판정리
    "4413325625": "4413025625", # 충청남도 천안시 직산읍 수헐리 -> 충청남도 천안시 서북구 직산읍 수헐리
    "4413325626": "4413025626", # 충청남도 천안시 직산읍 삼은리 -> 충청남도 천안시 서북구 직산읍 삼은리
    "4413325627": "4413025627", # 충청남도 천안시 직산읍 상덕리 -> 충청남도 천안시 서북구 직산읍 상덕리
    "4413325628": "4413025628", # 충청남도 천안시 직산읍 부송리 -> 충청남도 천안시 서북구 직산읍 부송리
    "4413325629": "4413025629", # 충청남도 천안시 직산읍 모시리 -> 충청남도 천안시 서북구 직산읍 모시리
    "4413325630": "4413025630", # 충청남도 천안시 직산읍 자은가리 -> 충청남도 천안시 서북구 직산읍 자은가리
    "4413325631": "4413025631", # 충청남도 천안시 직산읍 양당리 -> 충청남도 천안시 서북구 직산읍 양당리
    "4413325632": "4413025632", # 충청남도 천안시 직산읍 신갈리 -> 충청남도 천안시 서북구 직산읍 신갈리
    "4413325633": "4413025633", # 충청남도 천안시 직산읍 마정리 -> 충청남도 천안시 서북구 직산읍 마정리
    "4413325634": "4413025634", # 충청남도 천안시 직산읍 석곡리 -> 충청남도 천안시 서북구 직산읍 석곡리
    "4413331000": "4413040000", # 충청남도 천안시 입장면 -> 충청남도 천안시 서북구 입장면
    "4413331021": "4413040021", # 충청남도 천안시 입장면 하장리 -> 충청남도 천안시 서북구 입장면 하장리
    "4413331022": "4413040022", # 충청남도 천안시 입장면 상장리 -> 충청남도 천안시 서북구 입장면 상장리
    "4413331023": "4413040023", # 충청남도 천안시 입장면 기로리 -> 충청남도 천안시 서북구 입장면 기로리
    "4413331024": "4413040024", # 충청남도 천안시 입장면 도림리 -> 충청남도 천안시 서북구 입장면 도림리
    "4413331025": "4413040025", # 충청남도 천안시 입장면 양대리 -> 충청남도 천안시 서북구 입장면 양대리
    "4413331026": "4413040026", # 충청남도 천안시 입장면 홍천리 -> 충청남도 천안시 서북구 입장면 홍천리
    "4413331027": "4413040027", # 충청남도 천안시 입장면 호당리 -> 충청남도 천안시 서북구 입장면 호당리
    "4413331028": "4413040028", # 충청남도 천안시 입장면 시장리 -> 충청남도 천안시 서북구 입장면 시장리
    "4413331029": "4413040029", # 충청남도 천안시 입장면 효계리 -> 충청남도 천안시 서북구 입장면 효계리
    "4413331030": "4413040030", # 충청남도 천안시 입장면 신덕리 -> 충청남도 천안시 서북구 입장면 신덕리
    "4413331031": "4413040031", # 충청남도 천안시 입장면 신두리 -> 충청남도 천안시 서북구 입장면 신두리
    "4413331032": "4413040032", # 충청남도 천안시 입장면 용정리 -> 충청남도 천안시 서북구 입장면 용정리
    "4413331033": "4413040033", # 충청남도 천안시 입장면 흑암리 -> 충청남도 천안시 서북구 입장면 흑암리
    "4413331034": "4413040034", # 충청남도 천안시 입장면 산정리 -> 충청남도 천안시 서북구 입장면 산정리
    "4413331035": "4413040035", # 충청남도 천안시 입장면 연곡리 -> 충청남도 천안시 서북구 입장면 연곡리
    "4413331036": "4413040036", # 충청남도 천안시 입장면 가산리 -> 충청남도 천안시 서북구 입장면 가산리
    "4413331037": "4413040037", # 충청남도 천안시 입장면 유리 -> 충청남도 천안시 서북구 입장면 유리
    "4413331038": "4413040038", # 충청남도 천안시 입장면 독정리 -> 충청남도 천안시 서북구 입장면 독정리

    "4122025300": "4122038000", # 경기도 평택시 안중면 -> 경기도 평택시 안중읍
    "4122025321": "4122038021", # 경기도 평택시 안중면 안중리 -> 경기도 평택시 안중읍 안중리
    "4122025322": "4122038022", # 경기도 평택시 안중면 학현리 -> 경기도 평택시 안중읍 학현리
    "4122025323": "4122038023", # 경기도 평택시 안중면 금곡리 -> 경기도 평택시 안중읍 금곡리
    "4122025324": "4122038024", # 경기도 평택시 안중면 대반리 -> 경기도 평택시 안중읍 대반리
    "4122025325": "4122038025", # 경기도 평택시 안중면 삼정리 -> 경기도 평택시 안중읍 삼정리
    "4122025326": "4122038026", # 경기도 평택시 안중면 용성리 -> 경기도 평택시 안중읍 용성리
    "4122025327": "4122038027", # 경기도 평택시 안중면 덕우리 -> 경기도 평택시 안중읍 덕우리
    "4122025328": "4122038028", # 경기도 평택시 안중면 성해리 -> 경기도 평택시 안중읍 성해리
    "4122025329": "4122038029", # 경기도 평택시 안중면 송담리 -> 경기도 평택시 안중읍 송담리
    "4122025330": "4122038030", # 경기도 평택시 안중면 현화리 -> 경기도 평택시 안중읍 현화리

    "4161025000": "4179031000", # 경기도 광주군 오포면 -> 경기도 광주시 오포읍
    "4161025021": "4179031021", # 경기도 광주군 오포면 고산리 -> 경기도 광주시 오포읍 고산리
    "4161025022": "4179031022", # 경기도 광주군 오포면 신현리 -> 경기도 광주시 오포읍 신현리
    "4161025023": "4179031023", # 경기도 광주군 오포면 능평리 -> 경기도 광주시 오포읍 능평리
    "4161025024": "4179031024", # 경기도 광주군 오포면 문형리 -> 경기도 광주시 오포읍 문형리
    "4161025025": "4179031025", # 경기도 광주군 오포면 추자리 -> 경기도 광주시 오포읍 추자리
    "4161025026": "4179031026", # 경기도 광주군 오포면 매산리 -> 경기도 광주시 오포읍 매산리
    "4161025027": "4179031027", # 경기도 광주군 오포면 양벌리 -> 경기도 광주시 오포읍 양벌리

    "4155037000": "4186037000", # 경기도 안성군 공도면 -> 경기도 안성시 공도면
    "4155037021": "4186037021", # 경기도 안성군 공도면 양기리 -> 경기도 안성시 공도면 양기리
    "4155037022": "4186037022", # 경기도 안성군 공도면 웅교리 -> 경기도 안성시 공도면 웅교리
    "4155037023": "4186037023", # 경기도 안성군 공도면 신두리 -> 경기도 안성시 공도면 신두리
    "4155037024": "4186037024", # 경기도 안성군 공도면 중복리 -> 경기도 안성시 공도면 중복리
    "4155037025": "4186037025", # 경기도 안성군 공도면 용두리 -> 경기도 안성시 공도면 용두리
    "4155037026": "4186037026", # 경기도 안성군 공도면 승두리 -> 경기도 안성시 공도면 승두리
    "4155037027": "4186037027", # 경기도 안성군 공도면 건천리 -> 경기도 안성시 공도면 건천리
    "4155037028": "4186037028", # 경기도 안성군 공도면 불당리 -> 경기도 안성시 공도면 불당리
    "4155037029": "4186037029", # 경기도 안성군 공도면 만정리 -> 경기도 안성시 공도면 만정리
    "4155037030": "4186037030", # 경기도 안성군 공도면 마정리 -> 경기도 안성시 공도면 마정리
    "4155037031": "4186037031", # 경기도 안성군 공도면 진사리 -> 경기도 안성시 공도면 진사리

    "4155025000": "4155037000", # 경기도 안성시 공도면 -> 경기도 안성시 공도읍
    "4155025021": "4155037021", # 경기도 안성시 공도면 양기리 -> 경기도 안성시 공도읍 양기리
    "4155025022": "4155037022", # 경기도 안성시 공도면 웅교리 -> 경기도 안성시 공도읍 웅교리
    "4155025023": "4155037023", # 경기도 안성시 공도면 신두리 -> 경기도 안성시 공도읍 신두리
    "4155025024": "4155037024", # 경기도 안성시 공도면 중복리 -> 경기도 안성시 공도읍 중복리
    "4155025025": "4155037025", # 경기도 안성시 공도면 용두리 -> 경기도 안성시 공도읍 용두리
    "4155025026": "4155037026", # 경기도 안성시 공도면 승두리 -> 경기도 안성시 공도읍 승두리
    "4155025027": "4155037027", # 경기도 안성시 공도면 건천리 -> 경기도 안성시 공도읍 건천리
    "4155025028": "4155037028", # 경기도 안성시 공도면 불당리 -> 경기도 안성시 공도읍 불당리
    "4155025029": "4155037029", # 경기도 안성시 공도면 만정리 -> 경기도 안성시 공도읍 만정리
    "4155025030": "4155037030", # 경기도 안성시 공도면 마정리 -> 경기도 안성시 공도읍 마정리
    "4155025031": "4155037031", # 경기도 안성시 공도면 진사리 -> 경기도 안성시 공도읍 진사리

    "4172013000": "4172032000", # 경기도 남양주군 진접면 -> 경기도 남양주군 진접읍
    "4172013021": "4172032021", # 경기도 남양주군 진접면 장현리 -> 경기도 남양주군 진접읍 장현리
    "4172013022": "4172032022", # 경기도 남양주군 진접면 내각리 -> 경기도 남양주군 진접읍 내각리
    "4172013023": "4172032023", # 경기도 남양주군 진접면 내곡리 -> 경기도 남양주군 진접읍 내곡리
    "4172013024": "4172032024", # 경기도 남양주군 진접면 연평리 -> 경기도 남양주군 진접읍 연평리
    "4172013025": "4172032025", # 경기도 남양주군 진접면 부평리 -> 경기도 남양주군 진접읍 부평리
    "4172013026": "4172032026", # 경기도 남양주군 진접면 팔야리 -> 경기도 남양주군 진접읍 팔야리
    "4172013027": "4172032027", # 경기도 남양주군 진접면 진벌리 -> 경기도 남양주군 진접읍 진벌리
    "4172013028": "4172032028", # 경기도 남양주군 진접면 금곡리 -> 경기도 남양주군 진접읍 금곡리
    "4172013029": "4172032029", # 경기도 남양주군 진접면 양지리 -> 경기도 남양주군 진접읍 양지리
    "4172013030": "4172032030", # 경기도 남양주군 진접면 팔현리 -> 경기도 남양주군 진접읍 팔현리
    "4172013031": "4172032031", # 경기도 남양주군 진접면 오남리 -> 경기도 남양주군 진접읍 오남리

    "4136025300": "4172013000", # 경기도 남양주군 진접읍 -> 경기도 남양주시 진접읍
    "4136025321": "4172013021", # 경기도 남양주군 진접읍 장현리 -> 경기도 남양주시 진접읍 장현리
    "4136025322": "4172013022", # 경기도 남양주군 진접읍 내각리 -> 경기도 남양주시 진접읍 내각리
    "4136025323": "4172013023", # 경기도 남양주군 진접읍 내곡리 -> 경기도 남양주시 진접읍 내곡리
    "4136025324": "4172013024", # 경기도 남양주군 진접읍 연평리 -> 경기도 남양주시 진접읍 연평리
    "4136025325": "4172013025", # 경기도 남양주군 진접읍 부평리 -> 경기도 남양주시 진접읍 부평리
    "4136025326": "4172013026", # 경기도 남양주군 진접읍 팔야리 -> 경기도 남양주시 진접읍 팔야리
    "4136025327": "4172013027", # 경기도 남양주군 진접읍 진벌리 -> 경기도 남양주시 진접읍 진벌리
    "4136025328": "4172013028", # 경기도 남양주군 진접읍 금곡리 -> 경기도 남양주시 진접읍 금곡리
    "4136025329": "4172013029", # 경기도 남양주군 진접읍 양지리 -> 경기도 남양주시 진접읍 양지리
    "4136025330": "4172013030", # 경기도 남양주군 진접읍 팔현리 -> 경기도 남양주시 진접읍 팔현리
    "4136025331": "4172013031", # 경기도 남양주군 진접읍 오남리 -> 경기도 남양주시 진접읍 오남리

    "2600000000": "2100000000", # 부산직할시 -> 부산광역시
    "2611000000": "2111000000", # 부산직할시 중구 -> 부산광역시 중구
    "2611010100": "2111010100", # 부산직할시 중구 영주동 -> 부산광역시 중구 영주동
    "2611010200": "2111010200", # 부산직할시 중구 대창동1가 -> 부산광역시 중구 대창동1가
    "2611010300": "2111010300", # 부산직할시 중구 대창동2가 -> 부산광역시 중구 대창동2가
    "2611010400": "2111010400", # 부산직할시 중구 중앙동1가 -> 부산광역시 중구 중앙동1가
    "2611010500": "2111010500", # 부산직할시 중구 중앙동2가 -> 부산광역시 중구 중앙동2가
    "2611010600": "2111010600", # 부산직할시 중구 중앙동3가 -> 부산광역시 중구 중앙동3가
    "2611010700": "2111010700", # 부산직할시 중구 중앙동4가 -> 부산광역시 중구 중앙동4가
    "2611010800": "2111010800", # 부산직할시 중구 중앙동5가 -> 부산광역시 중구 중앙동5가
    "2611010900": "2111010900", # 부산직할시 중구 중앙동6가 -> 부산광역시 중구 중앙동6가
    "2611011000": "2111011000", # 부산직할시 중구 중앙동7가 -> 부산광역시 중구 중앙동7가
    "2611011100": "2111011100", # 부산직할시 중구 동광동1가 -> 부산광역시 중구 동광동1가
    "2611011200": "2111011200", # 부산직할시 중구 동광동2가 -> 부산광역시 중구 동광동2가
    "2611011300": "2111011300", # 부산직할시 중구 동광동3가 -> 부산광역시 중구 동광동3가
    "2611011400": "2111011400", # 부산직할시 중구 동광동4가 -> 부산광역시 중구 동광동4가
    "2611011500": "2111011500", # 부산직할시 중구 동광동5가 -> 부산광역시 중구 동광동5가
    "2611011600": "2111011600", # 부산직할시 중구 대청동1가 -> 부산광역시 중구 대청동1가
    "2611011700": "2111011700", # 부산직할시 중구 대청동2가 -> 부산광역시 중구 대청동2가
    "2611011800": "2111011800", # 부산직할시 중구 대청동3가 -> 부산광역시 중구 대청동3가
    "2611011900": "2111011900", # 부산직할시 중구 대청동4가 -> 부산광역시 중구 대청동4가
    "2611012000": "2111012000", # 부산직할시 중구 보수동1가 -> 부산광역시 중구 보수동1가
    "2611012100": "2111012100", # 부산직할시 중구 보수동2가 -> 부산광역시 중구 보수동2가
    "2611012200": "2111012200", # 부산직할시 중구 보수동3가 -> 부산광역시 중구 보수동3가
    "2611012300": "2111012300", # 부산직할시 중구 부평동1가 -> 부산광역시 중구 부평동1가
    "2611012400": "2111012400", # 부산직할시 중구 부평동2가 -> 부산광역시 중구 부평동2가
    "2611012500": "2111012500", # 부산직할시 중구 부평동3가 -> 부산광역시 중구 부평동3가
    "2611012600": "2111012600", # 부산직할시 중구 부평동4가 -> 부산광역시 중구 부평동4가
    "2611012700": "2111012700", # 부산직할시 중구 신창동1가 -> 부산광역시 중구 신창동1가
    "2611012800": "2111012800", # 부산직할시 중구 신창동2가 -> 부산광역시 중구 신창동2가
    "2611012900": "2111012900", # 부산직할시 중구 신창동3가 -> 부산광역시 중구 신창동3가
    "2611013000": "2111013000", # 부산직할시 중구 신창동4가 -> 부산광역시 중구 신창동4가
    "2611013100": "2111013100", # 부산직할시 중구 창선동1가 -> 부산광역시 중구 창선동1가
    "2611013200": "2111013200", # 부산직할시 중구 창선동2가 -> 부산광역시 중구 창선동2가
    "2611013300": "2111013300", # 부산직할시 중구 광복동1가 -> 부산광역시 중구 광복동1가
    "2611013400": "2111013400", # 부산직할시 중구 광복동2가 -> 부산광역시 중구 광복동2가
    "2611013500": "2111013500", # 부산직할시 중구 광복동3가 -> 부산광역시 중구 광복동3가
    "2611013600": "2111013600", # 부산직할시 중구 남포동1가 -> 부산광역시 중구 남포동1가
    "2611013700": "2111013700", # 부산직할시 중구 남포동2가 -> 부산광역시 중구 남포동2가
    "2611013800": "2111013800", # 부산직할시 중구 남포동3가 -> 부산광역시 중구 남포동3가
    "2611013900": "2111013900", # 부산직할시 중구 남포동4가 -> 부산광역시 중구 남포동4가
    "2611014000": "2111014000", # 부산직할시 중구 남포동5가 -> 부산광역시 중구 남포동5가
    "2611014100": "2111014100", # 부산직할시 중구 남포동6가 -> 부산광역시 중구 남포동6가
    "2614000000": "2114000000", # 부산직할시 서구 -> 부산광역시 서구
    "2614010100": "2114010100", # 부산직할시 서구 동대신동1가 -> 부산광역시 서구 동대신동1가
    "2614010200": "2114010200", # 부산직할시 서구 동대신동2가 -> 부산광역시 서구 동대신동2가
    "2614010300": "2114010300", # 부산직할시 서구 동대신동3가 -> 부산광역시 서구 동대신동3가
    "2614010400": "2114010400", # 부산직할시 서구 서대신동1가 -> 부산광역시 서구 서대신동1가
    "2614010500": "2114010500", # 부산직할시 서구 서대신동2가 -> 부산광역시 서구 서대신동2가
    "2614010600": "2114010600", # 부산직할시 서구 서대신동3가 -> 부산광역시 서구 서대신동3가
    "2614010700": "2114010700", # 부산직할시 서구 부용동1가 -> 부산광역시 서구 부용동1가
    "2614010800": "2114010800", # 부산직할시 서구 부용동2가 -> 부산광역시 서구 부용동2가
    "2614010900": "2114010900", # 부산직할시 서구 부민동1가 -> 부산광역시 서구 부민동1가
    "2614011000": "2114011000", # 부산직할시 서구 부민동2가 -> 부산광역시 서구 부민동2가
    "2614011100": "2114011100", # 부산직할시 서구 부민동3가 -> 부산광역시 서구 부민동3가
    "2614011200": "2114011200", # 부산직할시 서구 토성동1가 -> 부산광역시 서구 토성동1가
    "2614011300": "2114011300", # 부산직할시 서구 토성동2가 -> 부산광역시 서구 토성동2가
    "2614011400": "2114011400", # 부산직할시 서구 토성동3가 -> 부산광역시 서구 토성동3가
    "2614011500": "2114011500", # 부산직할시 서구 아미동1가 -> 부산광역시 서구 아미동1가
    "2614011600": "2114011600", # 부산직할시 서구 아미동2가 -> 부산광역시 서구 아미동2가
    "2614011700": "2114011700", # 부산직할시 서구 토성동4가 -> 부산광역시 서구 토성동4가
    "2614011800": "2114011800", # 부산직할시 서구 토성동5가 -> 부산광역시 서구 토성동5가
    "2614011900": "2114011900", # 부산직할시 서구 초장동 -> 부산광역시 서구 초장동
    "2614012000": "2114012000", # 부산직할시 서구 충무동1가 -> 부산광역시 서구 충무동1가
    "2614012100": "2114012100", # 부산직할시 서구 충무동2가 -> 부산광역시 서구 충무동2가
    "2614012200": "2114012200", # 부산직할시 서구 충무동3가 -> 부산광역시 서구 충무동3가
    "2614012300": "2114012300", # 부산직할시 서구 남부민동 -> 부산광역시 서구 남부민동
    "2614012400": "2114012400", # 부산직할시 서구 암남동 -> 부산광역시 서구 암남동
    "2617000000": "2117000000", # 부산직할시 동구 -> 부산광역시 동구
    "2617010100": "2117010100", # 부산직할시 동구 초량동 -> 부산광역시 동구 초량동
    "2617010200": "2117010200", # 부산직할시 동구 수정동 -> 부산광역시 동구 수정동
    "2617010300": "2117010300", # 부산직할시 동구 좌천동 -> 부산광역시 동구 좌천동
    "2617010400": "2117010400", # 부산직할시 동구 범일동 -> 부산광역시 동구 범일동
    "2620000000": "2120000000", # 부산직할시 영도구 -> 부산광역시 영도구
    "2620010100": "2120010100", # 부산직할시 영도구 대교동1가 -> 부산광역시 영도구 대교동1가
    "2620010200": "2120010200", # 부산직할시 영도구 대교동2가 -> 부산광역시 영도구 대교동2가
    "2620010300": "2120010300", # 부산직할시 영도구 대평동1가 -> 부산광역시 영도구 대평동1가
    "2620010400": "2120010400", # 부산직할시 영도구 대평동2가 -> 부산광역시 영도구 대평동2가
    "2620010500": "2120010500", # 부산직할시 영도구 남항동1가 -> 부산광역시 영도구 남항동1가
    "2620010600": "2120010600", # 부산직할시 영도구 남항동2가 -> 부산광역시 영도구 남항동2가
    "2620010700": "2120010700", # 부산직할시 영도구 남항동3가 -> 부산광역시 영도구 남항동3가
    "2620010800": "2120010800", # 부산직할시 영도구 영선동1가 -> 부산광역시 영도구 영선동1가
    "2620010900": "2120010900", # 부산직할시 영도구 영선동2가 -> 부산광역시 영도구 영선동2가
    "2620011000": "2120011000", # 부산직할시 영도구 영선동3가 -> 부산광역시 영도구 영선동3가
    "2620011100": "2120011100", # 부산직할시 영도구 영선동4가 -> 부산광역시 영도구 영선동4가
    "2620011200": "2120011200", # 부산직할시 영도구 신선동1가 -> 부산광역시 영도구 신선동1가
    "2620011300": "2120011300", # 부산직할시 영도구 신선동2가 -> 부산광역시 영도구 신선동2가
    "2620011400": "2120011400", # 부산직할시 영도구 신선동3가 -> 부산광역시 영도구 신선동3가
    "2620011500": "2120011500", # 부산직할시 영도구 봉래동1가 -> 부산광역시 영도구 봉래동1가
    "2620011600": "2120011600", # 부산직할시 영도구 봉래동2가 -> 부산광역시 영도구 봉래동2가
    "2620011700": "2120011700", # 부산직할시 영도구 봉래동3가 -> 부산광역시 영도구 봉래동3가
    "2620011800": "2120011800", # 부산직할시 영도구 봉래동4가 -> 부산광역시 영도구 봉래동4가
    "2620011900": "2120011900", # 부산직할시 영도구 봉래동5가 -> 부산광역시 영도구 봉래동5가
    "2620012000": "2120012000", # 부산직할시 영도구 청학동 -> 부산광역시 영도구 청학동
    "2620012100": "2120012100", # 부산직할시 영도구 동삼동 -> 부산광역시 영도구 동삼동
    "2623000000": "2123000000", # 부산직할시 부산진구 -> 부산광역시 부산진구
    "2623010100": "2123010100", # 부산직할시 부산진구 양정동 -> 부산광역시 부산진구 양정동
    "2623010200": "2123010200", # 부산직할시 부산진구 전포동 -> 부산광역시 부산진구 전포동
    "2623010300": "2123010300", # 부산직할시 부산진구 부전동 -> 부산광역시 부산진구 부전동
    "2623010400": "2123010400", # 부산직할시 부산진구 범천동 -> 부산광역시 부산진구 범천동
    "2623010500": "2123010500", # 부산직할시 부산진구 범전동 -> 부산광역시 부산진구 범전동
    "2623010600": "2123010600", # 부산직할시 부산진구 연지동 -> 부산광역시 부산진구 연지동
    "2623010700": "2123010700", # 부산직할시 부산진구 초읍동 -> 부산광역시 부산진구 초읍동
    "2623010800": "2123010800", # 부산직할시 부산진구 부암동 -> 부산광역시 부산진구 부암동
    "2623010900": "2123010900", # 부산직할시 부산진구 당감동 -> 부산광역시 부산진구 당감동
    "2623011000": "2123011000", # 부산직할시 부산진구 가야동 -> 부산광역시 부산진구 가야동
    "2623011100": "2123011100", # 부산직할시 부산진구 개금동 -> 부산광역시 부산진구 개금동
    "2626000000": "2126000000", # 부산직할시 동래구 -> 부산광역시 동래구
    "2626010100": "2126010100", # 부산직할시 동래구 명장동 -> 부산광역시 동래구 명장동
    "2626010200": "2126010200", # 부산직할시 동래구 안락동 -> 부산광역시 동래구 안락동
    "2626010300": "2126010300", # 부산직할시 동래구 칠산동 -> 부산광역시 동래구 칠산동
    "2626010400": "2126010400", # 부산직할시 동래구 낙민동 -> 부산광역시 동래구 낙민동
    "2626010500": "2126010500", # 부산직할시 동래구 복천동 -> 부산광역시 동래구 복천동
    "2626010600": "2126010600", # 부산직할시 동래구 수안동 -> 부산광역시 동래구 수안동
    "2626010700": "2126010700", # 부산직할시 동래구 명륜동 -> 부산광역시 동래구 명륜동
    "2626010800": "2126010800", # 부산직할시 동래구 온천동 -> 부산광역시 동래구 온천동
    "2626010900": "2126010900", # 부산직할시 동래구 사직동 -> 부산광역시 동래구 사직동
    "2626011000": "2126011000", # 부산직할시 동래구 거제동 -> 부산광역시 동래구 거제동
    "2626011100": "2126011100", # 부산직할시 동래구 연산동 -> 부산광역시 동래구 연산동
    "2629000000": "2129000000", # 부산직할시 남구 -> 부산광역시 남구
    "2629010100": "2129010100", # 부산직할시 남구 망미동 -> 부산광역시 남구 망미동
    "2629010200": "2129010200", # 부산직할시 남구 수영동 -> 부산광역시 남구 수영동
    "2629010300": "2129010300", # 부산직할시 남구 민락동 -> 부산광역시 남구 민락동
    "2629010400": "2129010400", # 부산직할시 남구 광안동 -> 부산광역시 남구 광안동
    "2629010500": "2129010500", # 부산직할시 남구 남천동 -> 부산광역시 남구 남천동
    "2629010600": "2129010600", # 부산직할시 남구 대연동 -> 부산광역시 남구 대연동
    "2629010700": "2129010700", # 부산직할시 남구 용호동 -> 부산광역시 남구 용호동
    "2629010800": "2129010800", # 부산직할시 남구 용당동 -> 부산광역시 남구 용당동
    "2629010900": "2129010900", # 부산직할시 남구 문현동 -> 부산광역시 남구 문현동
    "2629011000": "2129011000", # 부산직할시 남구 우암동 -> 부산광역시 남구 우암동
    "2629011100": "2129011100", # 부산직할시 남구 감만동 -> 부산광역시 남구 감만동
    "2632000000": "2132000000", # 부산직할시 북구 -> 부산광역시 북구
    "2632010100": "2132010100", # 부산직할시 북구 금곡동 -> 부산광역시 북구 금곡동
    "2632010200": "2132010200", # 부산직할시 북구 화명동 -> 부산광역시 북구 화명동
    "2632010300": "2132010300", # 부산직할시 북구 만덕동 -> 부산광역시 북구 만덕동
    "2632010400": "2132010400", # 부산직할시 북구 덕천동 -> 부산광역시 북구 덕천동
    "2632010500": "2132010500", # 부산직할시 북구 구포동 -> 부산광역시 북구 구포동
    "2632010600": "2132010600", # 부산직할시 북구 삼락동 -> 부산광역시 북구 삼락동
    "2632010700": "2132010700", # 부산직할시 북구 모라동 -> 부산광역시 북구 모라동
    "2632010800": "2132010800", # 부산직할시 북구 덕포동 -> 부산광역시 북구 덕포동
    "2632010900": "2132010900", # 부산직할시 북구 괘법동 -> 부산광역시 북구 괘법동
    "2632011000": "2132011000", # 부산직할시 북구 감전동 -> 부산광역시 북구 감전동
    "2632011100": "2132011100", # 부산직할시 북구 주례동 -> 부산광역시 북구 주례동
    "2632011200": "2132011200", # 부산직할시 북구 학장동 -> 부산광역시 북구 학장동
    "2632011300": "2132011300", # 부산직할시 북구 엄궁동 -> 부산광역시 북구 엄궁동
    "2635000000": "2135000000", # 부산직할시 해운대구 -> 부산광역시 해운대구
    "2635010100": "2135010100", # 부산직할시 해운대구 반송동 -> 부산광역시 해운대구 반송동
    "2635010200": "2135010200", # 부산직할시 해운대구 석대동 -> 부산광역시 해운대구 석대동
    "2635010300": "2135010300", # 부산직할시 해운대구 반여동 -> 부산광역시 해운대구 반여동
    "2635010400": "2135010400", # 부산직할시 해운대구 재송동 -> 부산광역시 해운대구 재송동
    "2635010500": "2135010500", # 부산직할시 해운대구 우동 -> 부산광역시 해운대구 우동
    "2635010600": "2135010600", # 부산직할시 해운대구 중동 -> 부산광역시 해운대구 중동
    "2635010700": "2135010700", # 부산직할시 해운대구 좌동 -> 부산광역시 해운대구 좌동
    "2635010800": "2135010800", # 부산직할시 해운대구 송정동 -> 부산광역시 해운대구 송정동
    "2638000000": "2138000000", # 부산직할시 사하구 -> 부산광역시 사하구
    "2638010100": "2138010100", # 부산직할시 사하구 괴정동 -> 부산광역시 사하구 괴정동
    "2638010200": "2138010200", # 부산직할시 사하구 당리동 -> 부산광역시 사하구 당리동
    "2638010300": "2138010300", # 부산직할시 사하구 하단동 -> 부산광역시 사하구 하단동
    "2638010400": "2138010400", # 부산직할시 사하구 신평동 -> 부산광역시 사하구 신평동
    "2638010500": "2138010500", # 부산직할시 사하구 장림동 -> 부산광역시 사하구 장림동
    "2638010600": "2138010600", # 부산직할시 사하구 다대동 -> 부산광역시 사하구 다대동
    "2638010700": "2138010700", # 부산직할시 사하구 구평동 -> 부산광역시 사하구 구평동
    "2638010800": "2138010800", # 부산직할시 사하구 감천동 -> 부산광역시 사하구 감천동
    "2641000000": "2141000000", # 부산직할시 금정구 -> 부산광역시 금정구
    "2641010100": "2141010100", # 부산직할시 금정구 두구동 -> 부산광역시 금정구 두구동
    "2641010200": "2141010200", # 부산직할시 금정구 노포동 -> 부산광역시 금정구 노포동
    "2641010300": "2141010300", # 부산직할시 금정구 청룡동 -> 부산광역시 금정구 청룡동
    "2641010400": "2141010400", # 부산직할시 금정구 남산동 -> 부산광역시 금정구 남산동
    "2641010500": "2141010500", # 부산직할시 금정구 선동 -> 부산광역시 금정구 선동
    "2641010600": "2141010600", # 부산직할시 금정구 오륜동 -> 부산광역시 금정구 오륜동
    "2641010700": "2141010700", # 부산직할시 금정구 구서동 -> 부산광역시 금정구 구서동
    "2641010800": "2141010800", # 부산직할시 금정구 장전동 -> 부산광역시 금정구 장전동
    "2641010900": "2141010900", # 부산직할시 금정구 부곡동 -> 부산광역시 금정구 부곡동
    "2641011000": "2141011000", # 부산직할시 금정구 서동 -> 부산광역시 금정구 서동
    "2641011100": "2141011100", # 부산직할시 금정구 금사동 -> 부산광역시 금정구 금사동
    "2641011200": "2141011200", # 부산직할시 금정구 회동동 -> 부산광역시 금정구 회동동
    "2641011300": "2141011300", # 부산직할시 금정구 금성동 -> 부산광역시 금정구 금성동
    "2644000000": "2144000000", # 부산직할시 강서구 -> 부산광역시 강서구
    "2644010300": "2144010300", # 부산직할시 강서구 강동동 -> 부산광역시 강서구 강동동
    "2644010400": "2144010400", # 부산직할시 강서구 명지동 -> 부산광역시 강서구 명지동
    "2644010500": "2144010500", # 부산직할시 강서구 죽림동 -> 부산광역시 강서구 죽림동
    "2644010600": "2144010600", # 부산직할시 강서구 식만동 -> 부산광역시 강서구 식만동
    "2644010700": "2144010700", # 부산직할시 강서구 죽동동 -> 부산광역시 강서구 죽동동
    "2644010800": "2144010800", # 부산직할시 강서구 봉림동 -> 부산광역시 강서구 봉림동
    "2644010900": "2144010900", # 부산직할시 강서구 송정동 -> 부산광역시 강서구 송정동
    "2644011000": "2144011000", # 부산직할시 강서구 화전동 -> 부산광역시 강서구 화전동
    "2644011100": "2144011100", # 부산직할시 강서구 녹산동 -> 부산광역시 강서구 녹산동
    "2644011200": "2144011200", # 부산직할시 강서구 생곡동 -> 부산광역시 강서구 생곡동
    "2644011300": "2144011300", # 부산직할시 강서구 구랑동 -> 부산광역시 강서구 구랑동
    "2644011400": "2144011400", # 부산직할시 강서구 지사동 -> 부산광역시 강서구 지사동
    "2644011500": "2144011500", # 부산직할시 강서구 미음동 -> 부산광역시 강서구 미음동
    "2644011600": "2144011600", # 부산직할시 강서구 범방동 -> 부산광역시 강서구 범방동
    "2644011700": "2144011700", # 부산직할시 강서구 신호동 -> 부산광역시 강서구 신호동
    "2644011800": "2144011800", # 부산직할시 강서구 동선동 -> 부산광역시 강서구 동선동
    "2644011900": "2144011900", # 부산직할시 강서구 성북동 -> 부산광역시 강서구 성북동
    "2644012000": "2144012000", # 부산직할시 강서구 눌차동 -> 부산광역시 강서구 눌차동
    "2644012100": "2144012100", # 부산직할시 강서구 천성동 -> 부산광역시 강서구 천성동
    "2644012200": "2144012200", # 부산직할시 강서구 대항동 -> 부산광역시 강서구 대항동

    "2700000000": "2200000000", # 대구직할시 -> 대구광역시
    "2711000000": "2211000000", # 대구직할시 중구 -> 대구광역시 중구
    "2711010100": "2211010100", # 대구직할시 중구 동인동1가 -> 대구광역시 중구 동인동1가
    "2711010200": "2211010200", # 대구직할시 중구 동인동2가 -> 대구광역시 중구 동인동2가
    "2711010300": "2211010300", # 대구직할시 중구 동인동3가 -> 대구광역시 중구 동인동3가
    "2711010400": "2211010400", # 대구직할시 중구 동인동4가 -> 대구광역시 중구 동인동4가
    "2711010500": "2211010500", # 대구직할시 중구 삼덕동1가 -> 대구광역시 중구 삼덕동1가
    "2711010600": "2211010600", # 대구직할시 중구 삼덕동2가 -> 대구광역시 중구 삼덕동2가
    "2711010700": "2211010700", # 대구직할시 중구 삼덕동3가 -> 대구광역시 중구 삼덕동3가
    "2711010800": "2211010800", # 대구직할시 중구 봉산동 -> 대구광역시 중구 봉산동
    "2711010900": "2211010900", # 대구직할시 중구 장관동 -> 대구광역시 중구 장관동
    "2711011000": "2211011000", # 대구직할시 중구 상서동 -> 대구광역시 중구 상서동
    "2711011100": "2211011100", # 대구직할시 중구 수동 -> 대구광역시 중구 수동
    "2711011200": "2211011200", # 대구직할시 중구 덕산동 -> 대구광역시 중구 덕산동
    "2711011300": "2211011300", # 대구직할시 중구 종로1가 -> 대구광역시 중구 종로1가
    "2711011400": "2211011400", # 대구직할시 중구 종로2가 -> 대구광역시 중구 종로2가
    "2711011500": "2211011500", # 대구직할시 중구 사일동 -> 대구광역시 중구 사일동
    "2711011600": "2211011600", # 대구직할시 중구 동일동 -> 대구광역시 중구 동일동
    "2711011700": "2211011700", # 대구직할시 중구 남일동 -> 대구광역시 중구 남일동
    "2711011800": "2211011800", # 대구직할시 중구 전동 -> 대구광역시 중구 전동
    "2711011900": "2211011900", # 대구직할시 중구 동성로3가 -> 대구광역시 중구 동성로3가
    "2711012000": "2211012000", # 대구직할시 중구 동문동 -> 대구광역시 중구 동문동
    "2711012100": "2211012100", # 대구직할시 중구 문화동 -> 대구광역시 중구 문화동
    "2711012200": "2211012200", # 대구직할시 중구 공평동 -> 대구광역시 중구 공평동
    "2711012300": "2211012300", # 대구직할시 중구 동성로2가 -> 대구광역시 중구 동성로2가
    "2711012400": "2211012400", # 대구직할시 중구 태평로1가 -> 대구광역시 중구 태평로1가
    "2711012500": "2211012500", # 대구직할시 중구 교동 -> 대구광역시 중구 교동
    "2711012600": "2211012600", # 대구직할시 중구 용덕동 -> 대구광역시 중구 용덕동
    "2711012700": "2211012700", # 대구직할시 중구 상덕동 -> 대구광역시 중구 상덕동
    "2711012800": "2211012800", # 대구직할시 중구 완전동 -> 대구광역시 중구 완전동
    "2711012900": "2211012900", # 대구직할시 중구 도원동 -> 대구광역시 중구 도원동
    "2711013000": "2211013000", # 대구직할시 중구 수창동 -> 대구광역시 중구 수창동
    "2711013100": "2211013100", # 대구직할시 중구 태평로3가 -> 대구광역시 중구 태평로3가
    "2711013200": "2211013200", # 대구직할시 중구 인교동 -> 대구광역시 중구 인교동
    "2711013300": "2211013300", # 대구직할시 중구 서야동 -> 대구광역시 중구 서야동
    "2711013400": "2211013400", # 대구직할시 중구 서성로1가 -> 대구광역시 중구 서성로1가
    "2711013500": "2211013500", # 대구직할시 중구 시장북로 -> 대구광역시 중구 시장북로
    "2711013600": "2211013600", # 대구직할시 중구 하서동 -> 대구광역시 중구 하서동
    "2711013700": "2211013700", # 대구직할시 중구 남성로 -> 대구광역시 중구 남성로
    "2711013800": "2211013800", # 대구직할시 중구 계산동1가 -> 대구광역시 중구 계산동1가
    "2711013900": "2211013900", # 대구직할시 중구 계산동2가 -> 대구광역시 중구 계산동2가
    "2711014000": "2211014000", # 대구직할시 중구 동산동 -> 대구광역시 중구 동산동
    "2711014100": "2211014100", # 대구직할시 중구 서문로2가 -> 대구광역시 중구 서문로2가
    "2711014200": "2211014200", # 대구직할시 중구 서성로2가 -> 대구광역시 중구 서성로2가
    "2711014300": "2211014300", # 대구직할시 중구 포정동 -> 대구광역시 중구 포정동
    "2711014400": "2211014400", # 대구직할시 중구 서문로1가 -> 대구광역시 중구 서문로1가
    "2711014500": "2211014500", # 대구직할시 중구 서내동 -> 대구광역시 중구 서내동
    "2711014600": "2211014600", # 대구직할시 중구 북성로2가 -> 대구광역시 중구 북성로2가
    "2711014700": "2211014700", # 대구직할시 중구 대안동 -> 대구광역시 중구 대안동
    "2711014800": "2211014800", # 대구직할시 중구 동성로1가 -> 대구광역시 중구 동성로1가
    "2711014900": "2211014900", # 대구직할시 중구 태평로2가 -> 대구광역시 중구 태평로2가
    "2711015000": "2211015000", # 대구직할시 중구 북성로1가 -> 대구광역시 중구 북성로1가
    "2711015100": "2211015100", # 대구직할시 중구 화전동 -> 대구광역시 중구 화전동
    "2711015200": "2211015200", # 대구직할시 중구 향촌동 -> 대구광역시 중구 향촌동
    "2711015300": "2211015300", # 대구직할시 중구 북내동 -> 대구광역시 중구 북내동
    "2711015400": "2211015400", # 대구직할시 중구 대신동 -> 대구광역시 중구 대신동
    "2711015500": "2211015500", # 대구직할시 중구 달성동 -> 대구광역시 중구 달성동
    "2711015600": "2211015600", # 대구직할시 중구 남산동 -> 대구광역시 중구 남산동
    "2711015700": "2211015700", # 대구직할시 중구 대봉동 -> 대구광역시 중구 대봉동
    "2714000000": "2214000000", # 대구직할시 동구 -> 대구광역시 동구
    "2714010100": "2214010100", # 대구직할시 동구 신암동 -> 대구광역시 동구 신암동
    "2714010200": "2214010200", # 대구직할시 동구 신천동 -> 대구광역시 동구 신천동
    "2714010300": "2214010300", # 대구직할시 동구 효목동 -> 대구광역시 동구 효목동
    "2714010400": "2214010400", # 대구직할시 동구 평광동 -> 대구광역시 동구 평광동
    "2714010500": "2214010500", # 대구직할시 동구 봉무동 -> 대구광역시 동구 봉무동
    "2714010600": "2214010600", # 대구직할시 동구 불로동 -> 대구광역시 동구 불로동
    "2714010700": "2214010700", # 대구직할시 동구 도동 -> 대구광역시 동구 도동
    "2714010800": "2214010800", # 대구직할시 동구 지저동 -> 대구광역시 동구 지저동
    "2714010900": "2214010900", # 대구직할시 동구 입석동 -> 대구광역시 동구 입석동
    "2714011000": "2214011000", # 대구직할시 동구 검사동 -> 대구광역시 동구 검사동
    "2714011100": "2214011100", # 대구직할시 동구 방촌동 -> 대구광역시 동구 방촌동
    "2714011200": "2214011200", # 대구직할시 동구 둔산동 -> 대구광역시 동구 둔산동
    "2714011300": "2214011300", # 대구직할시 동구 부동 -> 대구광역시 동구 부동
    "2714011400": "2214011400", # 대구직할시 동구 신평동 -> 대구광역시 동구 신평동
    "2714011500": "2214011500", # 대구직할시 동구 서호동 -> 대구광역시 동구 서호동
    "2714011600": "2214011600", # 대구직할시 동구 동호동 -> 대구광역시 동구 동호동
    "2714011700": "2214011700", # 대구직할시 동구 신기동 -> 대구광역시 동구 신기동
    "2714011800": "2214011800", # 대구직할시 동구 율하동 -> 대구광역시 동구 율하동
    "2714011900": "2214011900", # 대구직할시 동구 용계동 -> 대구광역시 동구 용계동
    "2714012000": "2214012000", # 대구직할시 동구 율암동 -> 대구광역시 동구 율암동
    "2714012100": "2214012100", # 대구직할시 동구 상매동 -> 대구광역시 동구 상매동
    "2714012200": "2214012200", # 대구직할시 동구 매여동 -> 대구광역시 동구 매여동
    "2714012300": "2214012300", # 대구직할시 동구 각산동 -> 대구광역시 동구 각산동
    "2714012400": "2214012400", # 대구직할시 동구 신서동 -> 대구광역시 동구 신서동
    "2714012500": "2214012500", # 대구직할시 동구 동내동 -> 대구광역시 동구 동내동
    "2714012600": "2214012600", # 대구직할시 동구 괴전동 -> 대구광역시 동구 괴전동
    "2714012700": "2214012700", # 대구직할시 동구 금강동 -> 대구광역시 동구 금강동
    "2714012800": "2214012800", # 대구직할시 동구 대림동 -> 대구광역시 동구 대림동
    "2714012900": "2214012900", # 대구직할시 동구 사복동 -> 대구광역시 동구 사복동
    "2714013000": "2214013000", # 대구직할시 동구 숙천동 -> 대구광역시 동구 숙천동
    "2714013100": "2214013100", # 대구직할시 동구 내곡동 -> 대구광역시 동구 내곡동
    "2714013200": "2214013200", # 대구직할시 동구 능성동 -> 대구광역시 동구 능성동
    "2714013300": "2214013300", # 대구직할시 동구 진인동 -> 대구광역시 동구 진인동
    "2714013400": "2214013400", # 대구직할시 동구 도학동 -> 대구광역시 동구 도학동
    "2714013500": "2214013500", # 대구직할시 동구 백안동 -> 대구광역시 동구 백안동
    "2714013600": "2214013600", # 대구직할시 동구 미곡동 -> 대구광역시 동구 미곡동
    "2714013700": "2214013700", # 대구직할시 동구 용수동 -> 대구광역시 동구 용수동
    "2714013800": "2214013800", # 대구직할시 동구 신무동 -> 대구광역시 동구 신무동
    "2714013900": "2214013900", # 대구직할시 동구 미대동 -> 대구광역시 동구 미대동
    "2714014000": "2214014000", # 대구직할시 동구 내동 -> 대구광역시 동구 내동
    "2714014100": "2214014100", # 대구직할시 동구 신용동 -> 대구광역시 동구 신용동
    "2714014200": "2214014200", # 대구직할시 동구 중대동 -> 대구광역시 동구 중대동
    "2714014300": "2214014300", # 대구직할시 동구 송정동 -> 대구광역시 동구 송정동
    "2714014400": "2214014400", # 대구직할시 동구 덕곡동 -> 대구광역시 동구 덕곡동
    "2714014500": "2214014500", # 대구직할시 동구 지묘동 -> 대구광역시 동구 지묘동
    "2714500000": "2214500000", # 대구직할시 동구안심출장 -> 대구광역시 동구안심출장
    "2717000000": "2217000000", # 대구직할시 서구 -> 대구광역시 서구
    "2717010100": "2217010100", # 대구직할시 서구 내당동 -> 대구광역시 서구 내당동
    "2717010200": "2217010200", # 대구직할시 서구 비산동 -> 대구광역시 서구 비산동
    "2717010300": "2217010300", # 대구직할시 서구 평리동 -> 대구광역시 서구 평리동
    "2717010400": "2217010400", # 대구직할시 서구 상리동 -> 대구광역시 서구 상리동
    "2717010500": "2217010500", # 대구직할시 서구 중리동 -> 대구광역시 서구 중리동
    "2717010600": "2217010600", # 대구직할시 서구 이현동 -> 대구광역시 서구 이현동
    "2717010700": "2217010700", # 대구직할시 서구 원대동1가 -> 대구광역시 서구 원대동1가
    "2717010800": "2217010800", # 대구직할시 서구 원대동2가 -> 대구광역시 서구 원대동2가
    "2717010900": "2217010900", # 대구직할시 서구 원대동3가 -> 대구광역시 서구 원대동3가
    "2720000000": "2220000000", # 대구직할시 남구 -> 대구광역시 남구
    "2720010100": "2220010100", # 대구직할시 남구 이천동 -> 대구광역시 남구 이천동
    "2720010200": "2220010200", # 대구직할시 남구 봉덕동 -> 대구광역시 남구 봉덕동
    "2720010300": "2220010300", # 대구직할시 남구 대명동 -> 대구광역시 남구 대명동
    "2723000000": "2223000000", # 대구직할시 북구 -> 대구광역시 북구
    "2723010100": "2223010100", # 대구직할시 북구 칠성동1가 -> 대구광역시 북구 칠성동1가
    "2723010200": "2223010200", # 대구직할시 북구 칠성동2가 -> 대구광역시 북구 칠성동2가
    "2723010300": "2223010300", # 대구직할시 북구 고성동1가 -> 대구광역시 북구 고성동1가
    "2723010400": "2223010400", # 대구직할시 북구 고성동2가 -> 대구광역시 북구 고성동2가
    "2723010500": "2223010500", # 대구직할시 북구 고성동3가 -> 대구광역시 북구 고성동3가
    "2723010600": "2223010600", # 대구직할시 북구 침산동 -> 대구광역시 북구 침산동
    "2723010700": "2223010700", # 대구직할시 북구 노원동1가 -> 대구광역시 북구 노원동1가
    "2723010800": "2223010800", # 대구직할시 북구 노원동2가 -> 대구광역시 북구 노원동2가
    "2723010900": "2223010900", # 대구직할시 북구 노원동3가 -> 대구광역시 북구 노원동3가
    "2723011000": "2223011000", # 대구직할시 북구 대현동 -> 대구광역시 북구 대현동
    "2723011100": "2223011100", # 대구직할시 북구 산격동 -> 대구광역시 북구 산격동
    "2723011200": "2223011200", # 대구직할시 북구 복현동 -> 대구광역시 북구 복현동
    "2723011300": "2223011300", # 대구직할시 북구 검단동 -> 대구광역시 북구 검단동
    "2723011400": "2223011400", # 대구직할시 북구 동변동 -> 대구광역시 북구 동변동
    "2723011500": "2223011500", # 대구직할시 북구 서변동 -> 대구광역시 북구 서변동
    "2723011600": "2223011600", # 대구직할시 북구 조야동 -> 대구광역시 북구 조야동
    "2723011700": "2223011700", # 대구직할시 북구 노곡동 -> 대구광역시 북구 노곡동
    "2723011800": "2223011800", # 대구직할시 북구 읍내동 -> 대구광역시 북구 읍내동
    "2723011900": "2223011900", # 대구직할시 북구 동호동 -> 대구광역시 북구 동호동
    "2723012000": "2223012000", # 대구직할시 북구 학정동 -> 대구광역시 북구 학정동
    "2723012100": "2223012100", # 대구직할시 북구 도남동 -> 대구광역시 북구 도남동
    "2723012200": "2223012200", # 대구직할시 북구 국우동 -> 대구광역시 북구 국우동
    "2723012300": "2223012300", # 대구직할시 북구 구암동 -> 대구광역시 북구 구암동
    "2723012400": "2223012400", # 대구직할시 북구 동천동 -> 대구광역시 북구 동천동
    "2723012500": "2223012500", # 대구직할시 북구 관음동 -> 대구광역시 북구 관음동
    "2723012600": "2223012600", # 대구직할시 북구 태전동 -> 대구광역시 북구 태전동
    "2723012700": "2223012700", # 대구직할시 북구 매천동 -> 대구광역시 북구 매천동
    "2723012800": "2223012800", # 대구직할시 북구 팔달동 -> 대구광역시 북구 팔달동
    "2723012900": "2223012900", # 대구직할시 북구 금호동 -> 대구광역시 북구 금호동
    "2723013000": "2223013000", # 대구직할시 북구 사수동 -> 대구광역시 북구 사수동
    "2723013100": "2223013100", # 대구직할시 북구 연경동 -> 대구광역시 북구 연경동
    "2723500000": "2223500000", # 대구직할시 북구칠곡출장 -> 대구광역시 북구칠곡출장
    "2726000000": "2226000000", # 대구직할시 수성구 -> 대구광역시 수성구
    "2726010100": "2226010100", # 대구직할시 수성구 범어동 -> 대구광역시 수성구 범어동
    "2726010200": "2226010200", # 대구직할시 수성구 만촌동 -> 대구광역시 수성구 만촌동
    "2726010300": "2226010300", # 대구직할시 수성구 수성동1가 -> 대구광역시 수성구 수성동1가
    "2726010400": "2226010400", # 대구직할시 수성구 수성동2가 -> 대구광역시 수성구 수성동2가
    "2726010500": "2226010500", # 대구직할시 수성구 수성동3가 -> 대구광역시 수성구 수성동3가
    "2726010600": "2226010600", # 대구직할시 수성구 수성동4가 -> 대구광역시 수성구 수성동4가
    "2726010700": "2226010700", # 대구직할시 수성구 황금동 -> 대구광역시 수성구 황금동
    "2726010800": "2226010800", # 대구직할시 수성구 중동 -> 대구광역시 수성구 중동
    "2726010900": "2226010900", # 대구직할시 수성구 상동 -> 대구광역시 수성구 상동
    "2726011000": "2226011000", # 대구직할시 수성구 파동 -> 대구광역시 수성구 파동
    "2726011100": "2226011100", # 대구직할시 수성구 두산동 -> 대구광역시 수성구 두산동
    "2726011200": "2226011200", # 대구직할시 수성구 지산동 -> 대구광역시 수성구 지산동
    "2726011300": "2226011300", # 대구직할시 수성구 범물동 -> 대구광역시 수성구 범물동
    "2726011400": "2226011400", # 대구직할시 수성구 시지동 -> 대구광역시 수성구 시지동
    "2726011500": "2226011500", # 대구직할시 수성구 매호동 -> 대구광역시 수성구 매호동
    "2726011600": "2226011600", # 대구직할시 수성구 성동 -> 대구광역시 수성구 성동
    "2726011700": "2226011700", # 대구직할시 수성구 사월동 -> 대구광역시 수성구 사월동
    "2726011800": "2226011800", # 대구직할시 수성구 신매동 -> 대구광역시 수성구 신매동
    "2726011900": "2226011900", # 대구직할시 수성구 욱수동 -> 대구광역시 수성구 욱수동
    "2726012000": "2226012000", # 대구직할시 수성구 노변동 -> 대구광역시 수성구 노변동
    "2726012100": "2226012100", # 대구직할시 수성구 내환동 -> 대구광역시 수성구 내환동
    "2726012200": "2226012200", # 대구직할시 수성구 삼덕동 -> 대구광역시 수성구 삼덕동
    "2726012300": "2226012300", # 대구직할시 수성구 연호동 -> 대구광역시 수성구 연호동
    "2726012400": "2226012400", # 대구직할시 수성구 이천동 -> 대구광역시 수성구 이천동
    "2726012500": "2226012500", # 대구직할시 수성구 고모동 -> 대구광역시 수성구 고모동
    "2726012600": "2226012600", # 대구직할시 수성구 가천동 -> 대구광역시 수성구 가천동
    "2729000000": "2229000000", # 대구직할시 달서구 -> 대구광역시 달서구
    "2729010100": "2229010100", # 대구직할시 달서구 성당동 -> 대구광역시 달서구 성당동
    "2729010200": "2229010200", # 대구직할시 달서구 두류동 -> 대구광역시 달서구 두류동
    "2729010300": "2229010300", # 대구직할시 달서구 파산동 -> 대구광역시 달서구 파산동
    "2729010400": "2229010400", # 대구직할시 달서구 파호동 -> 대구광역시 달서구 파호동
    "2729010500": "2229010500", # 대구직할시 달서구 호림동 -> 대구광역시 달서구 호림동
    "2729010600": "2229010600", # 대구직할시 달서구 갈산동 -> 대구광역시 달서구 갈산동
    "2729010700": "2229010700", # 대구직할시 달서구 신당동 -> 대구광역시 달서구 신당동
    "2729010800": "2229010800", # 대구직할시 달서구 이곡동 -> 대구광역시 달서구 이곡동
    "2729010900": "2229010900", # 대구직할시 달서구 장동 -> 대구광역시 달서구 장동
    "2729011000": "2229011000", # 대구직할시 달서구 장기동 -> 대구광역시 달서구 장기동
    "2729011100": "2229011100", # 대구직할시 달서구 용산동 -> 대구광역시 달서구 용산동
    "2729011200": "2229011200", # 대구직할시 달서구 죽전동 -> 대구광역시 달서구 죽전동
    "2729011300": "2229011300", # 대구직할시 달서구 감삼동 -> 대구광역시 달서구 감삼동
    "2729011400": "2229011400", # 대구직할시 달서구 본리동 -> 대구광역시 달서구 본리동
    "2729011500": "2229011500", # 대구직할시 달서구 상인동 -> 대구광역시 달서구 상인동
    "2729011600": "2229011600", # 대구직할시 달서구 도원동 -> 대구광역시 달서구 도원동
    "2729011700": "2229011700", # 대구직할시 달서구 진천동 -> 대구광역시 달서구 진천동
    "2729011800": "2229011800", # 대구직할시 달서구 유천동 -> 대구광역시 달서구 유천동
    "2729011900": "2229011900", # 대구직할시 달서구 대천동 -> 대구광역시 달서구 대천동
    "2729012000": "2229012000", # 대구직할시 달서구 월성동 -> 대구광역시 달서구 월성동
    "2729012100": "2229012100", # 대구직할시 달서구 월암동 -> 대구광역시 달서구 월암동
    "2729012200": "2229012200", # 대구직할시 달서구 송현동 -> 대구광역시 달서구 송현동
    "2729012300": "2229012300", # 대구직할시 달서구 대곡동 -> 대구광역시 달서구 대곡동
    "2729012400": "2229012400", # 대구직할시 달서구 본동 -> 대구광역시 달서구 본동

    "3000000000": "2500000000", # 대전직할시 -> 대전광역시
    "3011000000": "2511000000", # 대전직할시 동구 -> 대전광역시 동구
    "3011010100": "2511010100", # 대전직할시 동구 원동 -> 대전광역시 동구 원동
    "3011010200": "2511010200", # 대전직할시 동구 인동 -> 대전광역시 동구 인동
    "3011010300": "2511010300", # 대전직할시 동구 효동 -> 대전광역시 동구 효동
    "3011010400": "2511010400", # 대전직할시 동구 천동 -> 대전광역시 동구 천동
    "3011010500": "2511010500", # 대전직할시 동구 가오동 -> 대전광역시 동구 가오동
    "3011010600": "2511010600", # 대전직할시 동구 신흥동 -> 대전광역시 동구 신흥동
    "3011010700": "2511010700", # 대전직할시 동구 판암동 -> 대전광역시 동구 판암동
    "3011010800": "2511010800", # 대전직할시 동구 삼정동 -> 대전광역시 동구 삼정동
    "3011010900": "2511010900", # 대전직할시 동구 용운동 -> 대전광역시 동구 용운동
    "3011011000": "2511011000", # 대전직할시 동구 대동 -> 대전광역시 동구 대동
    "3011011100": "2511011100", # 대전직할시 동구 자양동 -> 대전광역시 동구 자양동
    "3011011200": "2511011200", # 대전직할시 동구 신안동 -> 대전광역시 동구 신안동
    "3011011300": "2511011300", # 대전직할시 동구 소제동 -> 대전광역시 동구 소제동
    "3011011400": "2511011400", # 대전직할시 동구 가양동 -> 대전광역시 동구 가양동
    "3011011500": "2511011500", # 대전직할시 동구 용전동 -> 대전광역시 동구 용전동
    "3011011600": "2511011600", # 대전직할시 동구 성남동 -> 대전광역시 동구 성남동
    "3011011700": "2511011700", # 대전직할시 동구 홍도동 -> 대전광역시 동구 홍도동
    "3011011800": "2511011800", # 대전직할시 동구 삼성동 -> 대전광역시 동구 삼성동
    "3011011900": "2511011900", # 대전직할시 동구 정동 -> 대전광역시 동구 정동
    "3011012000": "2511012000", # 대전직할시 동구 중동 -> 대전광역시 동구 중동
    "3011012100": "2511012100", # 대전직할시 동구 추동 -> 대전광역시 동구 추동
    "3011012200": "2511012200", # 대전직할시 동구 비룡동 -> 대전광역시 동구 비룡동
    "3011012300": "2511012300", # 대전직할시 동구 주산동 -> 대전광역시 동구 주산동
    "3011012400": "2511012400", # 대전직할시 동구 용계동 -> 대전광역시 동구 용계동
    "3011012500": "2511012500", # 대전직할시 동구 마산동 -> 대전광역시 동구 마산동
    "3011012600": "2511012600", # 대전직할시 동구 효평동 -> 대전광역시 동구 효평동
    "3011012700": "2511012700", # 대전직할시 동구 직동 -> 대전광역시 동구 직동
    "3011012800": "2511012800", # 대전직할시 동구 세천동 -> 대전광역시 동구 세천동
    "3011012900": "2511012900", # 대전직할시 동구 신상동 -> 대전광역시 동구 신상동
    "3011013000": "2511013000", # 대전직할시 동구 신하동 -> 대전광역시 동구 신하동
    "3011013100": "2511013100", # 대전직할시 동구 신촌동 -> 대전광역시 동구 신촌동
    "3011013200": "2511013200", # 대전직할시 동구 사성동 -> 대전광역시 동구 사성동
    "3011013300": "2511013300", # 대전직할시 동구 내탑동 -> 대전광역시 동구 내탑동
    "3011013400": "2511013400", # 대전직할시 동구 오동 -> 대전광역시 동구 오동
    "3011013500": "2511013500", # 대전직할시 동구 주촌동 -> 대전광역시 동구 주촌동
    "3011013600": "2511013600", # 대전직할시 동구 낭월동 -> 대전광역시 동구 낭월동
    "3011013700": "2511013700", # 대전직할시 동구 대별동 -> 대전광역시 동구 대별동
    "3011013800": "2511013800", # 대전직할시 동구 이사동 -> 대전광역시 동구 이사동
    "3011013900": "2511013900", # 대전직할시 동구 대성동 -> 대전광역시 동구 대성동
    "3011014000": "2511014000", # 대전직할시 동구 장척동 -> 대전광역시 동구 장척동
    "3011014100": "2511014100", # 대전직할시 동구 소호동 -> 대전광역시 동구 소호동
    "3011014200": "2511014200", # 대전직할시 동구 구도동 -> 대전광역시 동구 구도동
    "3011014300": "2511014300", # 대전직할시 동구 삼괴동 -> 대전광역시 동구 삼괴동
    "3011014400": "2511014400", # 대전직할시 동구 상소동 -> 대전광역시 동구 상소동
    "3011014500": "2511014500", # 대전직할시 동구 하소동 -> 대전광역시 동구 하소동
    "3014000000": "2514000000", # 대전직할시 중구 -> 대전광역시 중구
    "3014010100": "2514010100", # 대전직할시 중구 은행동 -> 대전광역시 중구 은행동
    "3014010200": "2514010200", # 대전직할시 중구 선화동 -> 대전광역시 중구 선화동
    "3014010300": "2514010300", # 대전직할시 중구 목동 -> 대전광역시 중구 목동
    "3014010400": "2514010400", # 대전직할시 중구 중촌동 -> 대전광역시 중구 중촌동
    "3014010500": "2514010500", # 대전직할시 중구 대흥동 -> 대전광역시 중구 대흥동
    "3014010600": "2514010600", # 대전직할시 중구 문창동 -> 대전광역시 중구 문창동
    "3014010700": "2514010700", # 대전직할시 중구 석교동 -> 대전광역시 중구 석교동
    "3014010800": "2514010800", # 대전직할시 중구 호동 -> 대전광역시 중구 호동
    "3014010900": "2514010900", # 대전직할시 중구 옥계동 -> 대전광역시 중구 옥계동
    "3014011000": "2514011000", # 대전직할시 중구 대사동 -> 대전광역시 중구 대사동
    "3014011100": "2514011100", # 대전직할시 중구 부사동 -> 대전광역시 중구 부사동
    "3014011200": "2514011200", # 대전직할시 중구 용두동 -> 대전광역시 중구 용두동
    "3014011300": "2514011300", # 대전직할시 중구 오류동 -> 대전광역시 중구 오류동
    "3014011400": "2514011400", # 대전직할시 중구 태평동 -> 대전광역시 중구 태평동
    "3014011500": "2514011500", # 대전직할시 중구 유천동 -> 대전광역시 중구 유천동
    "3014011600": "2514011600", # 대전직할시 중구 문화동 -> 대전광역시 중구 문화동
    "3014011700": "2514011700", # 대전직할시 중구 산성동 -> 대전광역시 중구 산성동
    "3014011800": "2514011800", # 대전직할시 중구 사정동 -> 대전광역시 중구 사정동
    "3014011900": "2514011900", # 대전직할시 중구 안영동 -> 대전광역시 중구 안영동
    "3014012000": "2514012000", # 대전직할시 중구 무수동 -> 대전광역시 중구 무수동
    "3014012100": "2514012100", # 대전직할시 중구 구완동 -> 대전광역시 중구 구완동
    "3014012200": "2514012200", # 대전직할시 중구 침산동 -> 대전광역시 중구 침산동
    "3014012300": "2514012300", # 대전직할시 중구 목달동 -> 대전광역시 중구 목달동
    "3014012400": "2514012400", # 대전직할시 중구 정생동 -> 대전광역시 중구 정생동
    "3014012500": "2514012500", # 대전직할시 중구 어남동 -> 대전광역시 중구 어남동
    "3014012600": "2514012600", # 대전직할시 중구 금동 -> 대전광역시 중구 금동
    "3017000000": "2517000000", # 대전직할시 서구 -> 대전광역시 서구
    "3017010100": "2517010100", # 대전직할시 서구 복수동 -> 대전광역시 서구 복수동
    "3017010200": "2517010200", # 대전직할시 서구 변동 -> 대전광역시 서구 변동
    "3017010300": "2517010300", # 대전직할시 서구 도마동 -> 대전광역시 서구 도마동
    "3017010400": "2517010400", # 대전직할시 서구 정림동 -> 대전광역시 서구 정림동
    "3017010500": "2517010500", # 대전직할시 서구 용문동 -> 대전광역시 서구 용문동
    "3017010600": "2517010600", # 대전직할시 서구 탄방동 -> 대전광역시 서구 탄방동
    "3017010700": "2517010700", # 대전직할시 서구 삼천동 -> 대전광역시 서구 삼천동
    "3017010800": "2517010800", # 대전직할시 서구 괴정동 -> 대전광역시 서구 괴정동
    "3017010900": "2517010900", # 대전직할시 서구 가장동 -> 대전광역시 서구 가장동
    "3017011000": "2517011000", # 대전직할시 서구 내동 -> 대전광역시 서구 내동
    "3017011100": "2517011100", # 대전직할시 서구 갈마동 -> 대전광역시 서구 갈마동
    "3017011200": "2517011200", # 대전직할시 서구 둔산동 -> 대전광역시 서구 둔산동
    "3017011300": "2517011300", # 대전직할시 서구 월평동 -> 대전광역시 서구 월평동
    "3017011400": "2517011400", # 대전직할시 서구 가수원동 -> 대전광역시 서구 가수원동
    "3017011500": "2517011500", # 대전직할시 서구 도안동 -> 대전광역시 서구 도안동
    "3017011600": "2517011600", # 대전직할시 서구 관저동 -> 대전광역시 서구 관저동
    "3017011700": "2517011700", # 대전직할시 서구 흑석동 -> 대전광역시 서구 흑석동
    "3017011800": "2517011800", # 대전직할시 서구 매노동 -> 대전광역시 서구 매노동
    "3017011900": "2517011900", # 대전직할시 서구 산직동 -> 대전광역시 서구 산직동
    "3017012000": "2517012000", # 대전직할시 서구 장안동 -> 대전광역시 서구 장안동
    "3017012100": "2517012100", # 대전직할시 서구 평촌동 -> 대전광역시 서구 평촌동
    "3017012200": "2517012200", # 대전직할시 서구 오동 -> 대전광역시 서구 오동
    "3017012300": "2517012300", # 대전직할시 서구 우명동 -> 대전광역시 서구 우명동
    "3017012400": "2517012400", # 대전직할시 서구 원정동 -> 대전광역시 서구 원정동
    "3017012500": "2517012500", # 대전직할시 서구 용촌동 -> 대전광역시 서구 용촌동
    "3017012600": "2517012600", # 대전직할시 서구 봉곡동 -> 대전광역시 서구 봉곡동
    "3017012700": "2517012700", # 대전직할시 서구 괴곡동 -> 대전광역시 서구 괴곡동
    "3017012800": "2517012800", # 대전직할시 서구 만년동 -> 대전광역시 서구 만년동
    "3020000000": "2520000000", # 대전직할시 유성구 -> 대전광역시 유성구
    "3020010100": "2520010100", # 대전직할시 유성구 원내동 -> 대전광역시 유성구 원내동
    "3020010200": "2520010200", # 대전직할시 유성구 교촌동 -> 대전광역시 유성구 교촌동
    "3020010300": "2520010300", # 대전직할시 유성구 대정동 -> 대전광역시 유성구 대정동
    "3020010400": "2520010400", # 대전직할시 유성구 용계동 -> 대전광역시 유성구 용계동
    "3020010500": "2520010500", # 대전직할시 유성구 학하동 -> 대전광역시 유성구 학하동
    "3020010600": "2520010600", # 대전직할시 유성구 계산동 -> 대전광역시 유성구 계산동
    "3020010700": "2520010700", # 대전직할시 유성구 성북동 -> 대전광역시 유성구 성북동
    "3020010800": "2520010800", # 대전직할시 유성구 세동 -> 대전광역시 유성구 세동
    "3020010900": "2520010900", # 대전직할시 유성구 송정동 -> 대전광역시 유성구 송정동
    "3020011000": "2520011000", # 대전직할시 유성구 방동 -> 대전광역시 유성구 방동
    "3020011100": "2520011100", # 대전직할시 유성구 봉명동 -> 대전광역시 유성구 봉명동
    "3020011200": "2520011200", # 대전직할시 유성구 구암동 -> 대전광역시 유성구 구암동
    "3020011300": "2520011300", # 대전직할시 유성구 덕명동 -> 대전광역시 유성구 덕명동
    "3020011400": "2520011400", # 대전직할시 유성구 원신흥동 -> 대전광역시 유성구 원신흥동
    "3020011500": "2520011500", # 대전직할시 유성구 상대동 -> 대전광역시 유성구 상대동
    "3020011600": "2520011600", # 대전직할시 유성구 복용동 -> 대전광역시 유성구 복용동
    "3020011700": "2520011700", # 대전직할시 유성구 장대동 -> 대전광역시 유성구 장대동
    "3020011800": "2520011800", # 대전직할시 유성구 갑동 -> 대전광역시 유성구 갑동
    "3020011900": "2520011900", # 대전직할시 유성구 노은동 -> 대전광역시 유성구 노은동
    "3020012000": "2520012000", # 대전직할시 유성구 지족동 -> 대전광역시 유성구 지족동
    "3020012100": "2520012100", # 대전직할시 유성구 죽동 -> 대전광역시 유성구 죽동
    "3020012200": "2520012200", # 대전직할시 유성구 궁동 -> 대전광역시 유성구 궁동
    "3020012300": "2520012300", # 대전직할시 유성구 어은동 -> 대전광역시 유성구 어은동
    "3020012400": "2520012400", # 대전직할시 유성구 구성동 -> 대전광역시 유성구 구성동
    "3020012500": "2520012500", # 대전직할시 유성구 신성동 -> 대전광역시 유성구 신성동
    "3020012600": "2520012600", # 대전직할시 유성구 가정동 -> 대전광역시 유성구 가정동
    "3020012700": "2520012700", # 대전직할시 유성구 도룡동 -> 대전광역시 유성구 도룡동
    "3020012800": "2520012800", # 대전직할시 유성구 장동 -> 대전광역시 유성구 장동
    "3020012900": "2520012900", # 대전직할시 유성구 방현동 -> 대전광역시 유성구 방현동
    "3020013000": "2520013000", # 대전직할시 유성구 화암동 -> 대전광역시 유성구 화암동
    "3020013100": "2520013100", # 대전직할시 유성구 덕진동 -> 대전광역시 유성구 덕진동
    "3020013200": "2520013200", # 대전직할시 유성구 하기동 -> 대전광역시 유성구 하기동
    "3020013300": "2520013300", # 대전직할시 유성구 추목동 -> 대전광역시 유성구 추목동
    "3020013400": "2520013400", # 대전직할시 유성구 자운동 -> 대전광역시 유성구 자운동
    "3020013500": "2520013500", # 대전직할시 유성구 신봉동 -> 대전광역시 유성구 신봉동
    "3020013600": "2520013600", # 대전직할시 유성구 수남동 -> 대전광역시 유성구 수남동
    "3020013700": "2520013700", # 대전직할시 유성구 안산동 -> 대전광역시 유성구 안산동
    "3020013800": "2520013800", # 대전직할시 유성구 외삼동 -> 대전광역시 유성구 외삼동
    "3020013900": "2520013900", # 대전직할시 유성구 반석동 -> 대전광역시 유성구 반석동
    "3020014000": "2520014000", # 대전직할시 유성구 문지동 -> 대전광역시 유성구 문지동
    "3020014100": "2520014100", # 대전직할시 유성구 전민동 -> 대전광역시 유성구 전민동
    "3020014200": "2520014200", # 대전직할시 유성구 원촌동 -> 대전광역시 유성구 원촌동
    "3020014300": "2520014300", # 대전직할시 유성구 탑립동 -> 대전광역시 유성구 탑립동
    "3020014400": "2520014400", # 대전직할시 유성구 용산동 -> 대전광역시 유성구 용산동
    "3020014500": "2520014500", # 대전직할시 유성구 봉산동 -> 대전광역시 유성구 봉산동
    "3020014600": "2520014600", # 대전직할시 유성구 관평동 -> 대전광역시 유성구 관평동
    "3020014700": "2520014700", # 대전직할시 유성구 송강동 -> 대전광역시 유성구 송강동
    "3020014800": "2520014800", # 대전직할시 유성구 금고동 -> 대전광역시 유성구 금고동
    "3020014900": "2520014900", # 대전직할시 유성구 대동 -> 대전광역시 유성구 대동
    "3020015000": "2520015000", # 대전직할시 유성구 금탄동 -> 대전광역시 유성구 금탄동
    "3020015100": "2520015100", # 대전직할시 유성구 신동 -> 대전광역시 유성구 신동
    "3020015200": "2520015200", # 대전직할시 유성구 둔곡동 -> 대전광역시 유성구 둔곡동
    "3020015300": "2520015300", # 대전직할시 유성구 구룡동 -> 대전광역시 유성구 구룡동
    "3023000000": "2523000000", # 대전직할시 대덕구 -> 대전광역시 대덕구
    "3023010100": "2523010100", # 대전직할시 대덕구 오정동 -> 대전광역시 대덕구 오정동
    "3023010200": "2523010200", # 대전직할시 대덕구 대화동 -> 대전광역시 대덕구 대화동
    "3023010300": "2523010300", # 대전직할시 대덕구 읍내동 -> 대전광역시 대덕구 읍내동
    "3023010400": "2523010400", # 대전직할시 대덕구 연축동 -> 대전광역시 대덕구 연축동
    "3023010500": "2523010500", # 대전직할시 대덕구 신대동 -> 대전광역시 대덕구 신대동
    "3023010600": "2523010600", # 대전직할시 대덕구 와동 -> 대전광역시 대덕구 와동
    "3023010700": "2523010700", # 대전직할시 대덕구 송촌동 -> 대전광역시 대덕구 송촌동
    "3023010800": "2523010800", # 대전직할시 대덕구 법동 -> 대전광역시 대덕구 법동
    "3023010900": "2523010900", # 대전직할시 대덕구 중리동 -> 대전광역시 대덕구 중리동
    "3023011000": "2523011000", # 대전직할시 대덕구 비래동 -> 대전광역시 대덕구 비래동
    "3023011100": "2523011100", # 대전직할시 대덕구 석봉동 -> 대전광역시 대덕구 석봉동
    "3023011200": "2523011200", # 대전직할시 대덕구 목상동 -> 대전광역시 대덕구 목상동
    "3023011300": "2523011300", # 대전직할시 대덕구 문평동 -> 대전광역시 대덕구 문평동
    "3023011400": "2523011400", # 대전직할시 대덕구 신일동 -> 대전광역시 대덕구 신일동
    "3023011500": "2523011500", # 대전직할시 대덕구 덕암동 -> 대전광역시 대덕구 덕암동
    "3023011600": "2523011600", # 대전직할시 대덕구 상서동 -> 대전광역시 대덕구 상서동
    "3023011700": "2523011700", # 대전직할시 대덕구 평촌동 -> 대전광역시 대덕구 평촌동
    "3023011800": "2523011800", # 대전직할시 대덕구 장동 -> 대전광역시 대덕구 장동
    "3023011900": "2523011900", # 대전직할시 대덕구 용호동 -> 대전광역시 대덕구 용호동
    "3023012000": "2523012000", # 대전직할시 대덕구 이현동 -> 대전광역시 대덕구 이현동
    "3023012100": "2523012100", # 대전직할시 대덕구 갈전동 -> 대전광역시 대덕구 갈전동
    "3023012200": "2523012200", # 대전직할시 대덕구 부수동 -> 대전광역시 대덕구 부수동
    "3023012300": "2523012300", # 대전직할시 대덕구 황호동 -> 대전광역시 대덕구 황호동
    "3023012400": "2523012400", # 대전직할시 대덕구 삼정동 -> 대전광역시 대덕구 삼정동
    "3023012500": "2523012500", # 대전직할시 대덕구 미호동 -> 대전광역시 대덕구 미호동
    "3023012600": "2523090300", # 대전직할시 대덕구 신탄진동 -> 대전광역시 대덕구 신탄진동

    "2900000000": "2400000000", # 광주직할시 -> 광주광역시
    "2911000000": "2411000000", # 광주직할시 동구 -> 광주광역시 동구
    "2911010100": "2411010100", # 광주직할시 동구 대인동 -> 광주광역시 동구 대인동
    "2911010200": "2411010200", # 광주직할시 동구 금남로5가 -> 광주광역시 동구 금남로5가
    "2911010300": "2411010300", # 광주직할시 동구 충장로5가 -> 광주광역시 동구 충장로5가
    "2911010400": "2411010400", # 광주직할시 동구 수기동 -> 광주광역시 동구 수기동
    "2911010500": "2411010500", # 광주직할시 동구 대의동 -> 광주광역시 동구 대의동
    "2911010600": "2411010600", # 광주직할시 동구 궁동 -> 광주광역시 동구 궁동
    "2911010700": "2411010700", # 광주직할시 동구 장동 -> 광주광역시 동구 장동
    "2911010800": "2411010800", # 광주직할시 동구 동명동 -> 광주광역시 동구 동명동
    "2911010900": "2411010900", # 광주직할시 동구 계림동 -> 광주광역시 동구 계림동
    "2911011000": "2411011000", # 광주직할시 동구 산수동 -> 광주광역시 동구 산수동
    "2911011100": "2411011100", # 광주직할시 동구 지산동 -> 광주광역시 동구 지산동
    "2911011200": "2411011200", # 광주직할시 동구 남동 -> 광주광역시 동구 남동
    "2911011300": "2411011300", # 광주직할시 동구 광산동 -> 광주광역시 동구 광산동
    "2911011400": "2411011400", # 광주직할시 동구 금동 -> 광주광역시 동구 금동
    "2911011500": "2411011500", # 광주직할시 동구 호남동 -> 광주광역시 동구 호남동
    "2911011600": "2411011600", # 광주직할시 동구 불로동 -> 광주광역시 동구 불로동
    "2911011700": "2411011700", # 광주직할시 동구 황금동 -> 광주광역시 동구 황금동
    "2911011800": "2411011800", # 광주직할시 동구 서석동 -> 광주광역시 동구 서석동
    "2911011900": "2411011900", # 광주직할시 동구 소태동 -> 광주광역시 동구 소태동
    "2911012000": "2411012000", # 광주직할시 동구 용연동 -> 광주광역시 동구 용연동
    "2911012100": "2411012100", # 광주직할시 동구 운림동 -> 광주광역시 동구 운림동
    "2911012200": "2411012200", # 광주직할시 동구 학동 -> 광주광역시 동구 학동
    "2911012300": "2411012300", # 광주직할시 동구 월남동 -> 광주광역시 동구 월남동
    "2911012400": "2411012400", # 광주직할시 동구 선교동 -> 광주광역시 동구 선교동
    "2911012500": "2411012500", # 광주직할시 동구 내남동 -> 광주광역시 동구 내남동
    "2911012600": "2411012600", # 광주직할시 동구 용산동 -> 광주광역시 동구 용산동
    "2911012700": "2411012700", # 광주직할시 동구 충장로1가 -> 광주광역시 동구 충장로1가
    "2911012800": "2411012800", # 광주직할시 동구 충장로2가 -> 광주광역시 동구 충장로2가
    "2911012900": "2411012900", # 광주직할시 동구 충장로3가 -> 광주광역시 동구 충장로3가
    "2911013000": "2411013000", # 광주직할시 동구 충장로4가 -> 광주광역시 동구 충장로4가
    "2911013100": "2411013100", # 광주직할시 동구 금남로1가 -> 광주광역시 동구 금남로1가
    "2911013200": "2411013200", # 광주직할시 동구 금남로2가 -> 광주광역시 동구 금남로2가
    "2911013300": "2411013300", # 광주직할시 동구 금남로3가 -> 광주광역시 동구 금남로3가
    "2911013400": "2411013400", # 광주직할시 동구 금남로4가 -> 광주광역시 동구 금남로4가
    "2914000000": "2414000000", # 광주직할시 서구 -> 광주광역시 서구
    "2914010100": "2414010100", # 광주직할시 서구 사동 -> 광주광역시 서구 사동
    "2914010200": "2414010200", # 광주직할시 서구 구동 -> 광주광역시 서구 구동
    "2914010300": "2414010300", # 광주직할시 서구 서동 -> 광주광역시 서구 서동
    "2914010400": "2414010400", # 광주직할시 서구 양동 -> 광주광역시 서구 양동
    "2914010500": "2414010500", # 광주직할시 서구 월산동 -> 광주광역시 서구 월산동
    "2914010600": "2414010600", # 광주직할시 서구 농성동 -> 광주광역시 서구 농성동
    "2914010700": "2414010700", # 광주직할시 서구 백운동 -> 광주광역시 서구 백운동
    "2914010800": "2414010800", # 광주직할시 서구 주월동 -> 광주광역시 서구 주월동
    "2914010900": "2414010900", # 광주직할시 서구 노대동 -> 광주광역시 서구 노대동
    "2914011000": "2414011000", # 광주직할시 서구 진월동 -> 광주광역시 서구 진월동
    "2914011100": "2414011100", # 광주직할시 서구 덕남동 -> 광주광역시 서구 덕남동
    "2914011200": "2414011200", # 광주직할시 서구 행암동 -> 광주광역시 서구 행암동
    "2914011300": "2414011300", # 광주직할시 서구 임암동 -> 광주광역시 서구 임암동
    "2914011400": "2414011400", # 광주직할시 서구 송하동 -> 광주광역시 서구 송하동
    "2914011500": "2414011500", # 광주직할시 서구 광천동 -> 광주광역시 서구 광천동
    "2914011600": "2414011600", # 광주직할시 서구 유촌동 -> 광주광역시 서구 유촌동
    "2914011700": "2414011700", # 광주직할시 서구 덕흥동 -> 광주광역시 서구 덕흥동
    "2914011800": "2414011800", # 광주직할시 서구 쌍촌동 -> 광주광역시 서구 쌍촌동
    "2914012000": "2414012000", # 광주직할시 서구 치평동 -> 광주광역시 서구 치평동
    "2914012100": "2414012100", # 광주직할시 서구 내방동 -> 광주광역시 서구 내방동
    "2914012200": "2414012200", # 광주직할시 서구 양림동 -> 광주광역시 서구 양림동
    "2914012300": "2414012300", # 광주직할시 서구 방림동 -> 광주광역시 서구 방림동
    "2914012400": "2414012400", # 광주직할시 서구 봉선동 -> 광주광역시 서구 봉선동
    "2914011900": "2414012500", # 광주직할시 서구 화정동 -> 광주광역시 서구 화정동
    "2917000000": "2417000000", # 광주직할시 북구 -> 광주광역시 북구
    "2917010100": "2417010100", # 광주직할시 북구 중흥동 -> 광주광역시 북구 중흥동
    "2917010200": "2417010200", # 광주직할시 북구 유동 -> 광주광역시 북구 유동
    "2917010300": "2417010300", # 광주직할시 북구 누문동 -> 광주광역시 북구 누문동
    "2917010400": "2417010400", # 광주직할시 북구 북동 -> 광주광역시 북구 북동
    "2917010500": "2417010500", # 광주직할시 북구 임동 -> 광주광역시 북구 임동
    "2917010600": "2417010600", # 광주직할시 북구 신안동 -> 광주광역시 북구 신안동
    "2917010700": "2417010700", # 광주직할시 북구 용봉동 -> 광주광역시 북구 용봉동
    "2917010800": "2417010800", # 광주직할시 북구 동림동 -> 광주광역시 북구 동림동
    "2917010900": "2417010900", # 광주직할시 북구 운암동 -> 광주광역시 북구 운암동
    "2917011000": "2417011000", # 광주직할시 북구 우산동 -> 광주광역시 북구 우산동
    "2917011100": "2417011100", # 광주직할시 북구 풍향동 -> 광주광역시 북구 풍향동
    "2917011200": "2417011200", # 광주직할시 북구 문흥동 -> 광주광역시 북구 문흥동
    "2917011300": "2417011300", # 광주직할시 북구 각화동 -> 광주광역시 북구 각화동
    "2917011400": "2417011400", # 광주직할시 북구 두암동 -> 광주광역시 북구 두암동
    "2917011500": "2417011500", # 광주직할시 북구 오치동 -> 광주광역시 북구 오치동
    "2917011600": "2417011600", # 광주직할시 북구 삼각동 -> 광주광역시 북구 삼각동
    "2917011700": "2417011700", # 광주직할시 북구 매곡동 -> 광주광역시 북구 매곡동
    "2917011800": "2417011800", # 광주직할시 북구 충효동 -> 광주광역시 북구 충효동
    "2917011900": "2417011900", # 광주직할시 북구 덕의동 -> 광주광역시 북구 덕의동
    "2917012000": "2417012000", # 광주직할시 북구 금곡동 -> 광주광역시 북구 금곡동
    "2917012100": "2417012100", # 광주직할시 북구 망월동 -> 광주광역시 북구 망월동
    "2917012200": "2417012200", # 광주직할시 북구 청풍동 -> 광주광역시 북구 청풍동
    "2917012300": "2417012300", # 광주직할시 북구 화암동 -> 광주광역시 북구 화암동
    "2917012400": "2417012400", # 광주직할시 북구 장등동 -> 광주광역시 북구 장등동
    "2917012500": "2417012500", # 광주직할시 북구 운정동 -> 광주광역시 북구 운정동
    "2917012600": "2417012600", # 광주직할시 북구 본촌동 -> 광주광역시 북구 본촌동
    "2917012700": "2417012700", # 광주직할시 북구 일곡동 -> 광주광역시 북구 일곡동
    "2917012800": "2417012800", # 광주직할시 북구 양산동 -> 광주광역시 북구 양산동
    "2917012900": "2417012900", # 광주직할시 북구 연제동 -> 광주광역시 북구 연제동
    "2917013000": "2417013000", # 광주직할시 북구 신용동 -> 광주광역시 북구 신용동
    "2917013100": "2417013100", # 광주직할시 북구 용두동 -> 광주광역시 북구 용두동
    "2917013200": "2417013200", # 광주직할시 북구 지야동 -> 광주광역시 북구 지야동
    "2917013300": "2417013300", # 광주직할시 북구 태령동 -> 광주광역시 북구 태령동
    "2917013400": "2417013400", # 광주직할시 북구 수곡동 -> 광주광역시 북구 수곡동
    "2917013500": "2417013500", # 광주직할시 북구 효령동 -> 광주광역시 북구 효령동
    "2917013600": "2417013600", # 광주직할시 북구 용전동 -> 광주광역시 북구 용전동
    "2917013700": "2417013700", # 광주직할시 북구 용강동 -> 광주광역시 북구 용강동
    "2917013900": "2417013900", # 광주직할시 북구 월출동 -> 광주광역시 북구 월출동
    "2917014000": "2417014000", # 광주직할시 북구 대촌동 -> 광주광역시 북구 대촌동
    "2917014100": "2417014100", # 광주직할시 북구 오룡동 -> 광주광역시 북구 오룡동
    "2920000000": "2420000000", # 광주직할시 광산구 -> 광주광역시 광산구
    "2920010100": "2420010100", # 광주직할시 광산구 송정동 -> 광주광역시 광산구 송정동
    "2920010200": "2420010200", # 광주직할시 광산구 도산동 -> 광주광역시 광산구 도산동
    "2920010300": "2420010300", # 광주직할시 광산구 도호동 -> 광주광역시 광산구 도호동
    "2920010400": "2420010400", # 광주직할시 광산구 신촌동 -> 광주광역시 광산구 신촌동
    "2920010500": "2420010500", # 광주직할시 광산구 서봉동 -> 광주광역시 광산구 서봉동
    "2920010600": "2420010600", # 광주직할시 광산구 운수동 -> 광주광역시 광산구 운수동
    "2920010700": "2420010700", # 광주직할시 광산구 선암동 -> 광주광역시 광산구 선암동
    "2920010800": "2420010800", # 광주직할시 광산구 소촌동 -> 광주광역시 광산구 소촌동
    "2920010900": "2420010900", # 광주직할시 광산구 우산동 -> 광주광역시 광산구 우산동
    "2920011000": "2420011000", # 광주직할시 광산구 황룡동 -> 광주광역시 광산구 황룡동
    "2920011100": "2420011100", # 광주직할시 광산구 박호동 -> 광주광역시 광산구 박호동
    "2920011200": "2420011200", # 광주직할시 광산구 비아동 -> 광주광역시 광산구 비아동
    "2920011400": "2420011400", # 광주직할시 광산구 수완동 -> 광주광역시 광산구 수완동
    "2920011500": "2420011500", # 광주직할시 광산구 월계동 -> 광주광역시 광산구 월계동
    "2920011600": "2420011600", # 광주직할시 광산구 쌍암동 -> 광주광역시 광산구 쌍암동
    "2920011700": "2420011700", # 광주직할시 광산구 산월동 -> 광주광역시 광산구 산월동
    "2920011800": "2420011800", # 광주직할시 광산구 신창동 -> 광주광역시 광산구 신창동
    "2920011900": "2420011900", # 광주직할시 광산구 신가동 -> 광주광역시 광산구 신가동
    "2920012000": "2420012000", # 광주직할시 광산구 운남동 -> 광주광역시 광산구 운남동
    "2920012100": "2420012100", # 광주직할시 광산구 안청동 -> 광주광역시 광산구 안청동
    "2920012200": "2420012200", # 광주직할시 광산구 진곡동 -> 광주광역시 광산구 진곡동
    "2920013600": "2420012300", # 광주직할시 광산구 오산동 -> 광주광역시 광산구 오산동
    "2920012300": "2420012400", # 광주직할시 광산구 장덕동 -> 광주광역시 광산구 장덕동
    "2920012400": "2420012500", # 광주직할시 광산구 흑석동 -> 광주광역시 광산구 흑석동
    "2920012500": "2420012600", # 광주직할시 광산구 하남동 -> 광주광역시 광산구 하남동
    "2920012600": "2420012700", # 광주직할시 광산구 장수동 -> 광주광역시 광산구 장수동
    "2920012700": "2420012800", # 광주직할시 광산구 산정동 -> 광주광역시 광산구 산정동
    "2920012800": "2420012900", # 광주직할시 광산구 월곡동 -> 광주광역시 광산구 월곡동
    "2920012900": "2420013000", # 광주직할시 광산구 등임동 -> 광주광역시 광산구 등임동
    "2920013000": "2420013100", # 광주직할시 광산구 산막동 -> 광주광역시 광산구 산막동
    "2920013100": "2420013200", # 광주직할시 광산구 고룡동 -> 광주광역시 광산구 고룡동
    "2920013200": "2420013300", # 광주직할시 광산구 신룡동 -> 광주광역시 광산구 신룡동
    "2920013300": "2420013400", # 광주직할시 광산구 두정동 -> 광주광역시 광산구 두정동
    "2920013400": "2420013500", # 광주직할시 광산구 임곡동 -> 광주광역시 광산구 임곡동
    "2920013500": "2420013600", # 광주직할시 광산구 광산동 -> 광주광역시 광산구 광산동
    "2920013600": "2420013700", # 광주직할시 광산구 오산동 -> 광주광역시 광산구 오산동
    "2920013700": "2420013800", # 광주직할시 광산구 사호동 -> 광주광역시 광산구 사호동
    "2920013800": "2420013900", # 광주직할시 광산구 하산동 -> 광주광역시 광산구 하산동
    "2920013900": "2420014000", # 광주직할시 광산구 유계동 -> 광주광역시 광산구 유계동
    "2920014000": "2420014100", # 광주직할시 광산구 본덕동 -> 광주광역시 광산구 본덕동
    "2920014100": "2420014200", # 광주직할시 광산구 용봉동 -> 광주광역시 광산구 용봉동
    "2920014200": "2420014300", # 광주직할시 광산구 요기동 -> 광주광역시 광산구 요기동
    "2920014300": "2420014400", # 광주직할시 광산구 복룡동 -> 광주광역시 광산구 복룡동
    "2920014400": "2420014500", # 광주직할시 광산구 송대동 -> 광주광역시 광산구 송대동
    "2920014500": "2420014600", # 광주직할시 광산구 옥동 -> 광주광역시 광산구 옥동
    "2920014600": "2420014700", # 광주직할시 광산구 월전동 -> 광주광역시 광산구 월전동
    "2920014700": "2420014800", # 광주직할시 광산구 장록동 -> 광주광역시 광산구 장록동
    "2920014800": "2420014900", # 광주직할시 광산구 송촌동 -> 광주광역시 광산구 송촌동
    "2920014900": "2420015000", # 광주직할시 광산구 지죽동 -> 광주광역시 광산구 지죽동
    "2920015000": "2420015100", # 광주직할시 광산구 용동 -> 광주광역시 광산구 용동
    "2920015100": "2420015200", # 광주직할시 광산구 용곡동 -> 광주광역시 광산구 용곡동
    "2920015200": "2420015300", # 광주직할시 광산구 지정동 -> 광주광역시 광산구 지정동
    "2920015300": "2420015400", # 광주직할시 광산구 명화동 -> 광주광역시 광산구 명화동
    "2920015400": "2420015500", # 광주직할시 광산구 동산동 -> 광주광역시 광산구 동산동
    "2920015500": "2420015600", # 광주직할시 광산구 연산동 -> 광주광역시 광산구 연산동
    "2920015600": "2420015700", # 광주직할시 광산구 도덕동 -> 광주광역시 광산구 도덕동
    "2920015700": "2420015800", # 광주직할시 광산구 송산동 -> 광주광역시 광산구 송산동
    "2920015800": "2420015900", # 광주직할시 광산구 지평동 -> 광주광역시 광산구 지평동
    "2920015900": "2420016000", # 광주직할시 광산구 오운동 -> 광주광역시 광산구 오운동
    "2920016000": "2420016100", # 광주직할시 광산구 삼거동 -> 광주광역시 광산구 삼거동
    "2920016100": "2420016200", # 광주직할시 광산구 양동 -> 광주광역시 광산구 양동
    "2920016200": "2420016300", # 광주직할시 광산구 내산동 -> 광주광역시 광산구 내산동
    "2920016300": "2420016400", # 광주직할시 광산구 대산동 -> 광주광역시 광산구 대산동
    "2920016400": "2420016500", # 광주직할시 광산구 송학동 -> 광주광역시 광산구 송학동
    "2920016500": "2420016600", # 광주직할시 광산구 신동 -> 광주광역시 광산구 신동
    "2920016600": "2420016700", # 광주직할시 광산구 삼도동 -> 광주광역시 광산구 삼도동
    "2920016700": "2420016800", # 광주직할시 광산구 남산동 -> 광주광역시 광산구 남산동
    "2920016800": "2420016900", # 광주직할시 광산구 송치동 -> 광주광역시 광산구 송치동
    "2920016900": "2420017000", # 광주직할시 광산구 산수동 -> 광주광역시 광산구 산수동
    "2920017000": "2420017100", # 광주직할시 광산구 선동 -> 광주광역시 광산구 선동
    "2920017100": "2420017200", # 광주직할시 광산구 지산동 -> 광주광역시 광산구 지산동
    "2920017200": "2420017300", # 광주직할시 광산구 왕동 -> 광주광역시 광산구 왕동
    "2920017300": "2420017400", # 광주직할시 광산구 북산동 -> 광주광역시 광산구 북산동
    "2920017400": "2420017500", # 광주직할시 광산구 명도동 -> 광주광역시 광산구 명도동
    "2920017500": "2420017600", # 광주직할시 광산구 동호동 -> 광주광역시 광산구 동호동
    "2920017600": "2420017700", # 광주직할시 광산구 덕림동 -> 광주광역시 광산구 덕림동
    "2920017700": "2420017800", # 광주직할시 광산구 양산동 -> 광주광역시 광산구 양산동
    "2920017800": "2420017900", # 광주직할시 광산구 동림동 -> 광주광역시 광산구 동림동
    "2920017900": "2420018000", # 광주직할시 광산구 구소동 -> 광주광역시 광산구 구소동
    "2920018000": "2420018100", # 광주직할시 광산구 양촌동 -> 광주광역시 광산구 양촌동
    "2920018200": "2420018300", # 광주직할시 광산구 승촌동 -> 광주광역시 광산구 승촌동
    "2920018300": "2420018400", # 광주직할시 광산구 지석동 -> 광주광역시 광산구 지석동
    "2920018400": "2420018500", # 광주직할시 광산구 압촌동 -> 광주광역시 광산구 압촌동
    "2920018500": "2420018600", # 광주직할시 광산구 화장동 -> 광주광역시 광산구 화장동
    "2920018600": "2420018700", # 광주직할시 광산구 칠석동 -> 광주광역시 광산구 칠석동
    "2920018700": "2420018800", # 광주직할시 광산구 석정동 -> 광주광역시 광산구 석정동
    "2920018800": "2420018900", # 광주직할시 광산구 신장동 -> 광주광역시 광산구 신장동
    "2920018900": "2420019000", # 광주직할시 광산구 양과동 -> 광주광역시 광산구 양과동
    "2920019000": "2420019100", # 광주직할시 광산구 이장동 -> 광주광역시 광산구 이장동
    "2920019100": "2420019200", # 광주직할시 광산구 대지동 -> 광주광역시 광산구 대지동
    "2920019200": "2420019300", # 광주직할시 광산구 원산동 -> 광주광역시 광산구 원산동
    "2920019300": "2420019400", # 광주직할시 광산구 월성동 -> 광주광역시 광산구 월성동
    "2920019400": "2420019500", # 광주직할시 광산구 서창동 -> 광주광역시 광산구 서창동
    "2920019500": "2420019600", # 광주직할시 광산구 세하동 -> 광주광역시 광산구 세하동
    "2920019600": "2420019700", # 광주직할시 광산구 용두동 -> 광주광역시 광산구 용두동
    "2920019700": "2420019800", # 광주직할시 광산구 풍암동 -> 광주광역시 광산구 풍암동
    "2920019800": "2420019900", # 광주직할시 광산구 벽진동 -> 광주광역시 광산구 벽진동
    "2920019900": "2420020000", # 광주직할시 광산구 금호동 -> 광주광역시 광산구 금호동
    "2920020000": "2420020100", # 광주직할시 광산구 마륵동 -> 광주광역시 광산구 마륵동
    "2920000100": "2420020200", # 광주직할시 광산구 매월동 -> 광주광역시 광산구 매월동
    "2920011300": "2420020300", # 광주직할시 광산구 도천동 -> 광주광역시 광산구 도천동
    "2920018100": "2420020400", # 광주직할시 광산구 도금동 -> 광주광역시 광산구 도금동
    "2920020200": "2420020500", # 광주직할시 광산구 오선동 -> 광주광역시 광산구 오선동

    "2800000000": "2300000000", # 인천직할시 -> 인천광역시
    "2811000000": "2311000000", # 인천직할시 중구 -> 인천광역시 중구
    "2811010100": "2311010100", # 인천직할시 중구 중앙동1가 -> 인천광역시 중구 중앙동1가
    "2811010200": "2311010200", # 인천직할시 중구 중앙동2가 -> 인천광역시 중구 중앙동2가
    "2811010300": "2311010300", # 인천직할시 중구 중앙동3가 -> 인천광역시 중구 중앙동3가
    "2811010400": "2311010400", # 인천직할시 중구 중앙동4가 -> 인천광역시 중구 중앙동4가
    "2811010500": "2311010500", # 인천직할시 중구 해안동1가 -> 인천광역시 중구 해안동1가
    "2811010600": "2311010600", # 인천직할시 중구 해안동2가 -> 인천광역시 중구 해안동2가
    "2811010700": "2311010700", # 인천직할시 중구 해안동3가 -> 인천광역시 중구 해안동3가
    "2811010800": "2311010800", # 인천직할시 중구 해안동4가 -> 인천광역시 중구 해안동4가
    "2811010900": "2311010900", # 인천직할시 중구 관동1가 -> 인천광역시 중구 관동1가
    "2811011000": "2311011000", # 인천직할시 중구 관동2가 -> 인천광역시 중구 관동2가
    "2811011100": "2311011100", # 인천직할시 중구 관동3가 -> 인천광역시 중구 관동3가
    "2811011200": "2311011200", # 인천직할시 중구 항동1가 -> 인천광역시 중구 항동1가
    "2811011300": "2311011300", # 인천직할시 중구 항동2가 -> 인천광역시 중구 항동2가
    "2811011400": "2311011400", # 인천직할시 중구 항동3가 -> 인천광역시 중구 항동3가
    "2811011500": "2311011500", # 인천직할시 중구 항동4가 -> 인천광역시 중구 항동4가
    "2811011600": "2311011600", # 인천직할시 중구 항동5가 -> 인천광역시 중구 항동5가
    "2811011700": "2311011700", # 인천직할시 중구 항동6가 -> 인천광역시 중구 항동6가
    "2811011800": "2311011800", # 인천직할시 중구 항동7가 -> 인천광역시 중구 항동7가
    "2811011900": "2311011900", # 인천직할시 중구 송학동1가 -> 인천광역시 중구 송학동1가
    "2811012000": "2311012000", # 인천직할시 중구 송학동2가 -> 인천광역시 중구 송학동2가
    "2811012100": "2311012100", # 인천직할시 중구 송학동3가 -> 인천광역시 중구 송학동3가
    "2811012200": "2311012200", # 인천직할시 중구 사동 -> 인천광역시 중구 사동
    "2811012300": "2311012300", # 인천직할시 중구 신생동 -> 인천광역시 중구 신생동
    "2811012400": "2311012400", # 인천직할시 중구 신포동 -> 인천광역시 중구 신포동
    "2811012500": "2311012500", # 인천직할시 중구 답동 -> 인천광역시 중구 답동
    "2811012600": "2311012600", # 인천직할시 중구 신흥동1가 -> 인천광역시 중구 신흥동1가
    "2811012700": "2311012700", # 인천직할시 중구 신흥동2가 -> 인천광역시 중구 신흥동2가
    "2811012800": "2311012800", # 인천직할시 중구 신흥동3가 -> 인천광역시 중구 신흥동3가
    "2811012900": "2311012900", # 인천직할시 중구 선화동 -> 인천광역시 중구 선화동
    "2811013000": "2311013000", # 인천직할시 중구 유동 -> 인천광역시 중구 유동
    "2811013100": "2311013100", # 인천직할시 중구 율목동 -> 인천광역시 중구 율목동
    "2811013200": "2311013200", # 인천직할시 중구 도원동 -> 인천광역시 중구 도원동
    "2811013300": "2311013300", # 인천직할시 중구 내동 -> 인천광역시 중구 내동
    "2811013400": "2311013400", # 인천직할시 중구 경동 -> 인천광역시 중구 경동
    "2811013500": "2311013500", # 인천직할시 중구 용동 -> 인천광역시 중구 용동
    "2811013600": "2311013600", # 인천직할시 중구 인현동 -> 인천광역시 중구 인현동
    "2811013700": "2311013700", # 인천직할시 중구 전동 -> 인천광역시 중구 전동
    "2811013800": "2311013800", # 인천직할시 중구 북성동1가 -> 인천광역시 중구 북성동1가
    "2811013900": "2311013900", # 인천직할시 중구 북성동2가 -> 인천광역시 중구 북성동2가
    "2811014000": "2311014000", # 인천직할시 중구 북성동3가 -> 인천광역시 중구 북성동3가
    "2811014100": "2311014100", # 인천직할시 중구 선린동 -> 인천광역시 중구 선린동
    "2811014200": "2311014200", # 인천직할시 중구 송월동1가 -> 인천광역시 중구 송월동1가
    "2811014300": "2311014300", # 인천직할시 중구 송월동2가 -> 인천광역시 중구 송월동2가
    "2811014400": "2311014400", # 인천직할시 중구 송월동3가 -> 인천광역시 중구 송월동3가
    "2811014500": "2311014500", # 인천직할시 중구 중산동 -> 인천광역시 중구 중산동
    "2811014600": "2311014600", # 인천직할시 중구 운남동 -> 인천광역시 중구 운남동
    "2811014700": "2311014700", # 인천직할시 중구 운서동 -> 인천광역시 중구 운서동
    "2811014800": "2311014800", # 인천직할시 중구 운북동 -> 인천광역시 중구 운북동
    "2811014900": "2311014900", # 인천직할시 중구 을왕동 -> 인천광역시 중구 을왕동
    "2811015000": "2311015000", # 인천직할시 중구 남북동 -> 인천광역시 중구 남북동
    "2811015100": "2311015100", # 인천직할시 중구 덕교동 -> 인천광역시 중구 덕교동
    "2811015200": "2311015200", # 인천직할시 중구 무의동 -> 인천광역시 중구 무의동
    "2811500000": "2311500000", # 인천직할시 중구영종출장 -> 인천광역시 중구영종출장
    "2811600000": "2311600000", # 인천직할시 중구용유출장 -> 인천광역시 중구용유출장
    "2814000000": "2314000000", # 인천직할시 동구 -> 인천광역시 동구
    "2814010100": "2314010100", # 인천직할시 동구 만석동 -> 인천광역시 동구 만석동
    "2814010200": "2314010200", # 인천직할시 동구 화수동 -> 인천광역시 동구 화수동
    "2814010300": "2314010300", # 인천직할시 동구 송현동 -> 인천광역시 동구 송현동
    "2814010400": "2314010400", # 인천직할시 동구 화평동 -> 인천광역시 동구 화평동
    "2814010500": "2314010500", # 인천직할시 동구 창영동 -> 인천광역시 동구 창영동
    "2814010600": "2314010600", # 인천직할시 동구 금곡동 -> 인천광역시 동구 금곡동
    "2814010700": "2314010700", # 인천직할시 동구 송림동 -> 인천광역시 동구 송림동
    "2817000000": "2317000000", # 인천직할시 남구 -> 인천광역시 남구
    "2817010100": "2317010100", # 인천직할시 남구 숭의동 -> 인천광역시 남구 숭의동
    "2817010200": "2317010200", # 인천직할시 남구 용현동 -> 인천광역시 남구 용현동
    "2817010300": "2317010300", # 인천직할시 남구 학익동 -> 인천광역시 남구 학익동
    "2817010400": "2317010400", # 인천직할시 남구 옥련동 -> 인천광역시 남구 옥련동
    "2817010500": "2317010500", # 인천직할시 남구 도화동 -> 인천광역시 남구 도화동
    "2817010600": "2317010600", # 인천직할시 남구 주안동 -> 인천광역시 남구 주안동
    "2817010700": "2317010700", # 인천직할시 남구 선학동 -> 인천광역시 남구 선학동
    "2817010800": "2317010800", # 인천직할시 남구 관교동 -> 인천광역시 남구 관교동
    "2817010900": "2317010900", # 인천직할시 남구 문학동 -> 인천광역시 남구 문학동
    "2817011000": "2317011000", # 인천직할시 남구 연수동 -> 인천광역시 남구 연수동
    "2817011100": "2317011100", # 인천직할시 남구 청학동 -> 인천광역시 남구 청학동
    "2817011200": "2317011200", # 인천직할시 남구 동춘동 -> 인천광역시 남구 동춘동
    "2820000000": "2320000000", # 인천직할시 남동구 -> 인천광역시 남동구
    "2820010100": "2320010100", # 인천직할시 남동구 구월동 -> 인천광역시 남동구 구월동
    "2820010200": "2320010200", # 인천직할시 남동구 간석동 -> 인천광역시 남동구 간석동
    "2820010300": "2320010300", # 인천직할시 남동구 만수동 -> 인천광역시 남동구 만수동
    "2820010400": "2320010400", # 인천직할시 남동구 장수동 -> 인천광역시 남동구 장수동
    "2820010500": "2320010500", # 인천직할시 남동구 서창동 -> 인천광역시 남동구 서창동
    "2820010600": "2320010600", # 인천직할시 남동구 운연동 -> 인천광역시 남동구 운연동
    "2820010700": "2320010700", # 인천직할시 남동구 남촌동 -> 인천광역시 남동구 남촌동
    "2820010800": "2320010800", # 인천직할시 남동구 수산동 -> 인천광역시 남동구 수산동
    "2820010900": "2320010900", # 인천직할시 남동구 도림동 -> 인천광역시 남동구 도림동
    "2820011000": "2320011000", # 인천직할시 남동구 논현동 -> 인천광역시 남동구 논현동
    "2820011100": "2320011100", # 인천직할시 남동구 고잔동 -> 인천광역시 남동구 고잔동
    "2823000000": "2323000000", # 인천직할시 북구 -> 인천광역시 북구
    "2823010100": "2323010100", # 인천직할시 북구 부평동 -> 인천광역시 북구 부평동
    "2823010200": "2323010200", # 인천직할시 북구 십정동 -> 인천광역시 북구 십정동
    "2823010300": "2323010300", # 인천직할시 북구 산곡동 -> 인천광역시 북구 산곡동
    "2823010400": "2323010400", # 인천직할시 북구 청천동 -> 인천광역시 북구 청천동
    "2823010500": "2323010500", # 인천직할시 북구 효성동 -> 인천광역시 북구 효성동
    "2823010600": "2323010600", # 인천직할시 북구 계산동 -> 인천광역시 북구 계산동
    "2823010700": "2323010700", # 인천직할시 북구 작전동 -> 인천광역시 북구 작전동
    "2823010800": "2323010800", # 인천직할시 북구 서운동 -> 인천광역시 북구 서운동
    "2823010900": "2323010900", # 인천직할시 북구 삼산동 -> 인천광역시 북구 삼산동
    "2823011000": "2323011000", # 인천직할시 북구 갈산동 -> 인천광역시 북구 갈산동
    "2823011100": "2323011100", # 인천직할시 북구 부개동 -> 인천광역시 북구 부개동
    "2823011200": "2323011200", # 인천직할시 북구 일신동 -> 인천광역시 북구 일신동
    "2823011300": "2323011300", # 인천직할시 북구 구산동 -> 인천광역시 북구 구산동
    "2823011400": "2323011400", # 인천직할시 북구 임학동 -> 인천광역시 북구 임학동
    "2823011500": "2323011500", # 인천직할시 북구 용종동 -> 인천광역시 북구 용종동
    "2823011600": "2323011600", # 인천직할시 북구 병방동 -> 인천광역시 북구 병방동
    "2823011700": "2323011700", # 인천직할시 북구 방축동 -> 인천광역시 북구 방축동
    "2823011800": "2323011800", # 인천직할시 북구 박촌동 -> 인천광역시 북구 박촌동
    "2823011900": "2323011900", # 인천직할시 북구 동양동 -> 인천광역시 북구 동양동
    "2823012000": "2323012000", # 인천직할시 북구 귤현동 -> 인천광역시 북구 귤현동
    "2823012100": "2323012100", # 인천직할시 북구 상야동 -> 인천광역시 북구 상야동
    "2823012200": "2323012200", # 인천직할시 북구 하야동 -> 인천광역시 북구 하야동
    "2823012300": "2323012300", # 인천직할시 북구 평동 -> 인천광역시 북구 평동
    "2823012400": "2323012400", # 인천직할시 북구 노오지동 -> 인천광역시 북구 노오지동
    "2823012500": "2323012500", # 인천직할시 북구 선주지동 -> 인천광역시 북구 선주지동
    "2823012600": "2323012600", # 인천직할시 북구 이화동 -> 인천광역시 북구 이화동
    "2823012700": "2323012700", # 인천직할시 북구 오류동 -> 인천광역시 북구 오류동
    "2823012800": "2323012800", # 인천직할시 북구 갈현동 -> 인천광역시 북구 갈현동
    "2823012900": "2323012900", # 인천직할시 북구 둑실동 -> 인천광역시 북구 둑실동
    "2823013000": "2323013000", # 인천직할시 북구 목상동 -> 인천광역시 북구 목상동
    "2823013100": "2323013100", # 인천직할시 북구 다남동 -> 인천광역시 북구 다남동
    "2823013200": "2323013200", # 인천직할시 북구 장기동 -> 인천광역시 북구 장기동
    "2823500000": "2323500000", # 인천직할시 북구계양출장 -> 인천광역시 북구계양출장
    "2826000000": "2326000000", # 인천직할시 서구 -> 인천광역시 서구
    "2826010100": "2326010100", # 인천직할시 서구 백석동 -> 인천광역시 서구 백석동
    "2826010200": "2326010200", # 인천직할시 서구 시천동 -> 인천광역시 서구 시천동
    "2826010300": "2326010300", # 인천직할시 서구 검암동 -> 인천광역시 서구 검암동
    "2826010400": "2326010400", # 인천직할시 서구 경서동 -> 인천광역시 서구 경서동
    "2826010500": "2326010500", # 인천직할시 서구 공촌동 -> 인천광역시 서구 공촌동
    "2826010600": "2326010600", # 인천직할시 서구 연희동 -> 인천광역시 서구 연희동
    "2826010700": "2326010700", # 인천직할시 서구 심곡동 -> 인천광역시 서구 심곡동
    "2826010800": "2326010800", # 인천직할시 서구 가정동 -> 인천광역시 서구 가정동
    "2826010900": "2326010900", # 인천직할시 서구 신현동 -> 인천광역시 서구 신현동
    "2826011000": "2326011000", # 인천직할시 서구 석남동 -> 인천광역시 서구 석남동
    "2826011100": "2326011100", # 인천직할시 서구 원창동 -> 인천광역시 서구 원창동
    "2826011200": "2326011200", # 인천직할시 서구 가좌동 -> 인천광역시 서구 가좌동

    "3111000000": "4813000000", # 경상남도 울산시 -> 울산광역시 중구
    "3111010200": "4813000100", # 경상남도 울산시 학산동 -> 울산광역시 중구 학산동
    "3111010100": "4813000200", # 경상남도 울산시 학성동 -> 울산광역시 중구 학성동
    "3111010300": "4813000300", # 경상남도 울산시 복산동 -> 울산광역시 중구 복산동
    "3111010400": "4813000400", # 경상남도 울산시 북정동 -> 울산광역시 중구 북정동
    "3111010500": "4813000500", # 경상남도 울산시 옥교동 -> 울산광역시 중구 옥교동
    "3111010600": "4813000600", # 경상남도 울산시 성남동 -> 울산광역시 중구 성남동
    "3111010700": "4813000700", # 경상남도 울산시 교동 -> 울산광역시 중구 교동
    "3111010800": "4813000800", # 경상남도 울산시 우정동 -> 울산광역시 중구 우정동
    "3111010900": "4813000900", # 경상남도 울산시 성안동 -> 울산광역시 중구 성안동
    "3111011000": "4813001000", # 경상남도 울산시 유곡동 -> 울산광역시 중구 유곡동
    "3111011100": "4813001100", # 경상남도 울산시 태화동 -> 울산광역시 중구 태화동
    "3111011200": "4813001200", # 경상남도 울산시 다운동 -> 울산광역시 중구 다운동
    "3111011600": "4813004800", # 경상남도 울산시 장현동 -> 울산광역시 중구 장현동
    "3111011300": "4813004900", # 경상남도 울산시 동동 -> 울산광역시 중구 동동
    "3111011400": "4813005000", # 경상남도 울산시 서동 -> 울산광역시 중구 서동
    "3111011500": "4813005100", # 경상남도 울산시 남외동 -> 울산광역시 중구 남외동
    "3111011700": "4813005200", # 경상남도 울산시 약사동 -> 울산광역시 중구 약사동
    "3111011800": "4813005300", # 경상남도 울산시 반구동 -> 울산광역시 중구 반구동
    "3114000000": "4813000000", # 경상남도 울산시 -> 울산광역시 남구
    "3114010100": "4813001300", # 경상남도 울산시 무거동 -> 울산광역시 남구 무거동
    "3114010200": "4813001400", # 경상남도 울산시 옥동 -> 울산광역시 남구 옥동
    "3114010300": "4813001500", # 경상남도 울산시 두왕동 -> 울산광역시 남구 두왕동
    "3114010400": "4813001600", # 경상남도 울산시 신정동 -> 울산광역시 남구 신정동
    "3114010500": "4813001700", # 경상남도 울산시 달동 -> 울산광역시 남구 달동
    "3114010600": "4813001800", # 경상남도 울산시 삼산동 -> 울산광역시 남구 삼산동
    "3114010700": "4813001900", # 경상남도 울산시 여천동 -> 울산광역시 남구 여천동
    "3114010800": "4813002000", # 경상남도 울산시 야음동 -> 울산광역시 남구 야음동
    "3114010900": "4813002100", # 경상남도 울산시 선암동 -> 울산광역시 남구 선암동
    "3114011000": "4813002200", # 경상남도 울산시 상개동 -> 울산광역시 남구 상개동
    "3114011100": "4813002300", # 경상남도 울산시 부곡동 -> 울산광역시 남구 부곡동
    "3114011200": "4813002400", # 경상남도 울산시 고사동 -> 울산광역시 남구 고사동
    "3114011300": "4813002500", # 경상남도 울산시 성암동 -> 울산광역시 남구 성암동
    "3114011400": "4813002600", # 경상남도 울산시 황성동 -> 울산광역시 남구 황성동
    "3114011500": "4813002700", # 경상남도 울산시 용연동 -> 울산광역시 남구 용연동
    "3114011600": "4813002800", # 경상남도 울산시 남화동 -> 울산광역시 남구 남화동
    "3114011700": "4813002900", # 경상남도 울산시 용잠동 -> 울산광역시 남구 용잠동
    "3114011800": "4813003000", # 경상남도 울산시 장생포동 -> 울산광역시 남구 장생포동
    "3114011900": "4813003100", # 경상남도 울산시 매암동 -> 울산광역시 남구 매암동
    "3117000000": "4813000000", # 경상남도 울산시 -> 울산광역시 동구
    "3117010100": "4813003200", # 경상남도 울산시 방어동 -> 울산광역시 동구 방어동
    "3117010200": "4813003300", # 경상남도 울산시 화정동 -> 울산광역시 동구 화정동
    "3117010300": "4813003400", # 경상남도 울산시 일산동 -> 울산광역시 동구 일산동
    "3117010400": "4813003500", # 경상남도 울산시 전하동 -> 울산광역시 동구 전하동
    "3117010500": "4813003600", # 경상남도 울산시 미포동 -> 울산광역시 동구 미포동
    "3117010600": "4813003700", # 경상남도 울산시 주전동 -> 울산광역시 동구 주전동
    "3117010700": "4813003800", # 경상남도 울산시 동부동 -> 울산광역시 동구 동부동
    "3117010800": "4813003900", # 경상남도 울산시 서부동 -> 울산광역시 동구 서부동
    "3117010900": "4813004000", # 경상남도 울산시 염포동 -> 울산광역시 동구 염포동
    "3120000000": "4813000000", # 경상남도 울산시 -> 울산광역시 북구
    "3120012700": "4813004000", # 경상남도 울산시 염포동 -> 울산광역시 북구 염포동
    "3120012400": "4813004100", # 경상남도 울산시 양정동 -> 울산광역시 북구 양정동
    "3120012300": "4813004200", # 경상남도 울산시 효문동 -> 울산광역시 북구 효문동
    "3120012000": "4813004300", # 경상남도 울산시 명촌동 -> 울산광역시 북구 명촌동
    "3120012100": "4813004400", # 경상남도 울산시 진장동 -> 울산광역시 북구 진장동
    "3120012200": "4813004500", # 경상남도 울산시 연암동 -> 울산광역시 북구 연암동
    "3120012500": "4813004600", # 경상남도 울산시 화봉동 -> 울산광역시 북구 화봉동
    "3120012600": "4813004700", # 경상남도 울산시 송정동 -> 울산광역시 북구 송정동
    "3171000000": "4813700000", # 경상남도 울산시 울주구 -> 울산광역시 울주군
    "3171025000": "4813725300", # 경상남도 울산시 울주구 온산읍 -> 울산광역시 울주군 온산읍
    "3171025021": "4813725321", # 경상남도 울산시 울주구 온산읍 화산리 -> 울산광역시 울주군 온산읍 화산리
    "3171025022": "4813725322", # 경상남도 울산시 울주구 온산읍 삼평리 -> 울산광역시 울주군 온산읍 삼평리
    "3171025023": "4813725323", # 경상남도 울산시 울주구 온산읍 강양리 -> 울산광역시 울주군 온산읍 강양리
    "3171025024": "4813725324", # 경상남도 울산시 울주구 온산읍 우봉리 -> 울산광역시 울주군 온산읍 우봉리
    "3171025025": "4813725325", # 경상남도 울산시 울주구 온산읍 당월리 -> 울산광역시 울주군 온산읍 당월리
    "3171025026": "4813725326", # 경상남도 울산시 울주구 온산읍 처용리 -> 울산광역시 울주군 온산읍 처용리
    "3171025027": "4813725327", # 경상남도 울산시 울주구 온산읍 산암리 -> 울산광역시 울주군 온산읍 산암리
    "3171025028": "4813725328", # 경상남도 울산시 울주구 온산읍 대정리 -> 울산광역시 울주군 온산읍 대정리
    "3171025029": "4813725329", # 경상남도 울산시 울주구 온산읍 방도리 -> 울산광역시 울주군 온산읍 방도리
    "3171025030": "4813725330", # 경상남도 울산시 울주구 온산읍 이진리 -> 울산광역시 울주군 온산읍 이진리
    "3171025031": "4813725331", # 경상남도 울산시 울주구 온산읍 원산리 -> 울산광역시 울주군 온산읍 원산리
    "3171025032": "4813725332", # 경상남도 울산시 울주구 온산읍 덕신리 -> 울산광역시 울주군 온산읍 덕신리
    "3171025033": "4813725333", # 경상남도 울산시 울주구 온산읍 학남리 -> 울산광역시 울주군 온산읍 학남리
    "3171025300": "4813725600", # 경상남도 울산시 울주구 언양읍 -> 울산광역시 울주군 언양읍
    "3171025321": "4813725621", # 경상남도 울산시 울주구 언양읍 반송리 -> 울산광역시 울주군 언양읍 반송리
    "3171025322": "4813725622", # 경상남도 울산시 울주구 언양읍 반천리 -> 울산광역시 울주군 언양읍 반천리
    "3171025323": "4813725623", # 경상남도 울산시 울주구 언양읍 반곡리 -> 울산광역시 울주군 언양읍 반곡리
    "3171025324": "4813725624", # 경상남도 울산시 울주구 언양읍 어음리 -> 울산광역시 울주군 언양읍 어음리
    "3171025325": "4813725625", # 경상남도 울산시 울주구 언양읍 송대리 -> 울산광역시 울주군 언양읍 송대리
    "3171025326": "4813725626", # 경상남도 울산시 울주구 언양읍 평리 -> 울산광역시 울주군 언양읍 평리
    "3171025327": "4813725627", # 경상남도 울산시 울주구 언양읍 다개리 -> 울산광역시 울주군 언양읍 다개리
    "3171025328": "4813725628", # 경상남도 울산시 울주구 언양읍 대곡리 -> 울산광역시 울주군 언양읍 대곡리
    "3171025329": "4813725629", # 경상남도 울산시 울주구 언양읍 직동리 -> 울산광역시 울주군 언양읍 직동리
    "3171025330": "4813725630", # 경상남도 울산시 울주구 언양읍 동부리 -> 울산광역시 울주군 언양읍 동부리
    "3171025331": "4813725631", # 경상남도 울산시 울주구 언양읍 서부리 -> 울산광역시 울주군 언양읍 서부리
    "3171025332": "4813725632", # 경상남도 울산시 울주구 언양읍 남부리 -> 울산광역시 울주군 언양읍 남부리
    "3171025333": "4813725633", # 경상남도 울산시 울주구 언양읍 반연리 -> 울산광역시 울주군 언양읍 반연리
    "3171025334": "4813725634", # 경상남도 울산시 울주구 언양읍 태기리 -> 울산광역시 울주군 언양읍 태기리
    "3171025335": "4813725635", # 경상남도 울산시 울주구 언양읍 구수리 -> 울산광역시 울주군 언양읍 구수리
    "3171031000": "4813734000", # 경상남도 울산시 울주구 서생면 -> 울산광역시 울주군 서생면
    "3171031021": "4813734021", # 경상남도 울산시 울주구 서생면 신암리 -> 울산광역시 울주군 서생면 신암리
    "3171031022": "4813734022", # 경상남도 울산시 울주구 서생면 명산리 -> 울산광역시 울주군 서생면 명산리
    "3171031023": "4813734023", # 경상남도 울산시 울주구 서생면 나사리 -> 울산광역시 울주군 서생면 나사리
    "3171031024": "4813734024", # 경상남도 울산시 울주구 서생면 화산리 -> 울산광역시 울주군 서생면 화산리
    "3171031025": "4813734025", # 경상남도 울산시 울주구 서생면 대송리 -> 울산광역시 울주군 서생면 대송리
    "3171031026": "4813734026", # 경상남도 울산시 울주구 서생면 용리 -> 울산광역시 울주군 서생면 용리
    "3171031027": "4813734027", # 경상남도 울산시 울주구 서생면 서생리 -> 울산광역시 울주군 서생면 서생리
    "3171031028": "4813734028", # 경상남도 울산시 울주구 서생면 진하리 -> 울산광역시 울주군 서생면 진하리
    "3171031029": "4813734029", # 경상남도 울산시 울주구 서생면 화정리 -> 울산광역시 울주군 서생면 화정리
    "3171031030": "4813734030", # 경상남도 울산시 울주구 서생면 위양리 -> 울산광역시 울주군 서생면 위양리
    "3171032000": "4813735000", # 경상남도 울산시 울주구 온양면 -> 울산광역시 울주군 온양면
    "3171032021": "4813735021", # 경상남도 울산시 울주구 온양면 발리 -> 울산광역시 울주군 온양면 발리
    "3171032022": "4813735022", # 경상남도 울산시 울주구 온양면 대안리 -> 울산광역시 울주군 온양면 대안리
    "3171032023": "4813735023", # 경상남도 울산시 울주구 온양면 망양리 -> 울산광역시 울주군 온양면 망양리
    "3171032024": "4813735024", # 경상남도 울산시 울주구 온양면 남창리 -> 울산광역시 울주군 온양면 남창리
    "3171032025": "4813735025", # 경상남도 울산시 울주구 온양면 동상리 -> 울산광역시 울주군 온양면 동상리
    "3171032026": "4813735026", # 경상남도 울산시 울주구 온양면 삼광리 -> 울산광역시 울주군 온양면 삼광리
    "3171032027": "4813735027", # 경상남도 울산시 울주구 온양면 내광리 -> 울산광역시 울주군 온양면 내광리
    "3171032028": "4813735028", # 경상남도 울산시 울주구 온양면 외광리 -> 울산광역시 울주군 온양면 외광리
    "3171032029": "4813735029", # 경상남도 울산시 울주구 온양면 운화리 -> 울산광역시 울주군 온양면 운화리
    "3171032030": "4813735030", # 경상남도 울산시 울주구 온양면 고산리 -> 울산광역시 울주군 온양면 고산리
    "3171033000": "4813736000", # 경상남도 울산시 울주구 청량면 -> 울산광역시 울주군 청량면
    "3171033021": "4813736021", # 경상남도 울산시 울주구 청량면 덕하리 -> 울산광역시 울주군 청량면 덕하리
    "3171033022": "4813736022", # 경상남도 울산시 울주구 청량면 동천리 -> 울산광역시 울주군 청량면 동천리
    "3171033023": "4813736023", # 경상남도 울산시 울주구 청량면 상남리 -> 울산광역시 울주군 청량면 상남리
    "3171033024": "4813736024", # 경상남도 울산시 울주구 청량면 개곡리 -> 울산광역시 울주군 청량면 개곡리
    "3171033025": "4813736025", # 경상남도 울산시 울주구 청량면 중리 -> 울산광역시 울주군 청량면 중리
    "3171033026": "4813736026", # 경상남도 울산시 울주구 청량면 문죽리 -> 울산광역시 울주군 청량면 문죽리
    "3171033027": "4813736027", # 경상남도 울산시 울주구 청량면 삼정리 -> 울산광역시 울주군 청량면 삼정리
    "3171033028": "4813736028", # 경상남도 울산시 울주구 청량면 율리 -> 울산광역시 울주군 청량면 율리
    "3171033029": "4813736029", # 경상남도 울산시 울주구 청량면 용암리 -> 울산광역시 울주군 청량면 용암리
    "3171034000": "4813737000", # 경상남도 울산시 울주구 웅촌면 -> 울산광역시 울주군 웅촌면
    "3171034021": "4813737021", # 경상남도 울산시 울주구 웅촌면 초천리 -> 울산광역시 울주군 웅촌면 초천리
    "3171034022": "4813737022", # 경상남도 울산시 울주구 웅촌면 석천리 -> 울산광역시 울주군 웅촌면 석천리
    "3171034023": "4813737023", # 경상남도 울산시 울주구 웅촌면 곡천리 -> 울산광역시 울주군 웅촌면 곡천리
    "3171034024": "4813737024", # 경상남도 울산시 울주구 웅촌면 검단리 -> 울산광역시 울주군 웅촌면 검단리
    "3171034025": "4813737025", # 경상남도 울산시 울주구 웅촌면 은현리 -> 울산광역시 울주군 웅촌면 은현리
    "3171034026": "4813737026", # 경상남도 울산시 울주구 웅촌면 고연리 -> 울산광역시 울주군 웅촌면 고연리
    "3171034027": "4813737027", # 경상남도 울산시 울주구 웅촌면 대대리 -> 울산광역시 울주군 웅촌면 대대리
    "3171034028": "4813737028", # 경상남도 울산시 울주구 웅촌면 통천리 -> 울산광역시 울주군 웅촌면 통천리
    "3171034029": "4813737029", # 경상남도 울산시 울주구 웅촌면 대복리 -> 울산광역시 울주군 웅촌면 대복리
    "3171035000": "4813738000", # 경상남도 울산시 울주구 범서면 -> 울산광역시 울주군 범서면
    "3171035021": "4813738021", # 경상남도 울산시 울주구 범서면 사연리 -> 울산광역시 울주군 범서면 사연리
    "3171035022": "4813738022", # 경상남도 울산시 울주구 범서면 천상리 -> 울산광역시 울주군 범서면 천상리
    "3171035023": "4813738023", # 경상남도 울산시 울주구 범서면 입암리 -> 울산광역시 울주군 범서면 입암리
    "3171035024": "4813738024", # 경상남도 울산시 울주구 범서면 굴화리 -> 울산광역시 울주군 범서면 굴화리
    "3171035025": "4813738025", # 경상남도 울산시 울주구 범서면 서사리 -> 울산광역시 울주군 범서면 서사리
    "3171035026": "4813738026", # 경상남도 울산시 울주구 범서면 두산리 -> 울산광역시 울주군 범서면 두산리
    "3171035027": "4813738027", # 경상남도 울산시 울주구 범서면 구영리 -> 울산광역시 울주군 범서면 구영리
    "3171035028": "4813738028", # 경상남도 울산시 울주구 범서면 중리 -> 울산광역시 울주군 범서면 중리
    "3171035029": "4813738029", # 경상남도 울산시 울주구 범서면 망성리 -> 울산광역시 울주군 범서면 망성리
    "3171035030": "4813738030", # 경상남도 울산시 울주구 범서면 척과리 -> 울산광역시 울주군 범서면 척과리
    "3171036000": "4813739000", # 경상남도 울산시 울주구 두동면 -> 울산광역시 울주군 두동면
    "3171036021": "4813739021", # 경상남도 울산시 울주구 두동면 만화리 -> 울산광역시 울주군 두동면 만화리
    "3171036022": "4813739022", # 경상남도 울산시 울주구 두동면 구미리 -> 울산광역시 울주군 두동면 구미리
    "3171036023": "4813739023", # 경상남도 울산시 울주구 두동면 월평리 -> 울산광역시 울주군 두동면 월평리
    "3171036024": "4813739024", # 경상남도 울산시 울주구 두동면 삼정리 -> 울산광역시 울주군 두동면 삼정리
    "3171036025": "4813739025", # 경상남도 울산시 울주구 두동면 이전리 -> 울산광역시 울주군 두동면 이전리
    "3171036026": "4813739026", # 경상남도 울산시 울주구 두동면 봉계리 -> 울산광역시 울주군 두동면 봉계리
    "3171036027": "4813739027", # 경상남도 울산시 울주구 두동면 천전리 -> 울산광역시 울주군 두동면 천전리
    "3171036028": "4813739028", # 경상남도 울산시 울주구 두동면 은편리 -> 울산광역시 울주군 두동면 은편리
    "3171037000": "4813740000", # 경상남도 울산시 울주구 두서면 -> 울산광역시 울주군 두서면
    "3171037021": "4813740021", # 경상남도 울산시 울주구 두서면 차리 -> 울산광역시 울주군 두서면 차리
    "3171037022": "4813740022", # 경상남도 울산시 울주구 두서면 구량리 -> 울산광역시 울주군 두서면 구량리
    "3171037023": "4813740023", # 경상남도 울산시 울주구 두서면 복안리 -> 울산광역시 울주군 두서면 복안리
    "3171037024": "4813740024", # 경상남도 울산시 울주구 두서면 미호리 -> 울산광역시 울주군 두서면 미호리
    "3171037025": "4813740025", # 경상남도 울산시 울주구 두서면 활천리 -> 울산광역시 울주군 두서면 활천리
    "3171037026": "4813740026", # 경상남도 울산시 울주구 두서면 내와리 -> 울산광역시 울주군 두서면 내와리
    "3171037027": "4813740027", # 경상남도 울산시 울주구 두서면 전읍리 -> 울산광역시 울주군 두서면 전읍리
    "3171037028": "4813740028", # 경상남도 울산시 울주구 두서면 인보리 -> 울산광역시 울주군 두서면 인보리
    "3171037029": "4813740029", # 경상남도 울산시 울주구 두서면 서하리 -> 울산광역시 울주군 두서면 서하리
    "3171038000": "4813742000", # 경상남도 울산시 울주구 상북면 -> 울산광역시 울주군 상북면
    "3171038021": "4813742021", # 경상남도 울산시 울주구 상북면 지내리 -> 울산광역시 울주군 상북면 지내리
    "3171038022": "4813742022", # 경상남도 울산시 울주구 상북면 양등리 -> 울산광역시 울주군 상북면 양등리
    "3171038023": "4813742023", # 경상남도 울산시 울주구 상북면 산전리 -> 울산광역시 울주군 상북면 산전리
    "3171038024": "4813742024", # 경상남도 울산시 울주구 상북면 길천리 -> 울산광역시 울주군 상북면 길천리
    "3171038025": "4813742025", # 경상남도 울산시 울주구 상북면 이천리 -> 울산광역시 울주군 상북면 이천리
    "3171038026": "4813742026", # 경상남도 울산시 울주구 상북면 덕현리 -> 울산광역시 울주군 상북면 덕현리
    "3171038027": "4813742027", # 경상남도 울산시 울주구 상북면 명촌리 -> 울산광역시 울주군 상북면 명촌리
    "3171038028": "4813742028", # 경상남도 울산시 울주구 상북면 천전리 -> 울산광역시 울주군 상북면 천전리
    "3171038029": "4813742029", # 경상남도 울산시 울주구 상북면 거리 -> 울산광역시 울주군 상북면 거리
    "3171038030": "4813742030", # 경상남도 울산시 울주구 상북면 궁근정리 -> 울산광역시 울주군 상북면 궁근정리
    "3171038031": "4813742031", # 경상남도 울산시 울주구 상북면 등억리 -> 울산광역시 울주군 상북면 등억리
    "3171038032": "4813742032", # 경상남도 울산시 울주구 상북면 향산리 -> 울산광역시 울주군 상북면 향산리
    "3171038033": "4813742033", # 경상남도 울산시 울주구 상북면 소호리 -> 울산광역시 울주군 상북면 소호리
    "3171039000": "4813743000", # 경상남도 울산시 울주구 삼남면 -> 울산광역시 울주군 삼남면
    "3171039021": "4813743021", # 경상남도 울산시 울주구 삼남면 교동리 -> 울산광역시 울주군 삼남면 교동리
    "3171039022": "4813743022", # 경상남도 울산시 울주구 삼남면 상천리 -> 울산광역시 울주군 삼남면 상천리
    "3171039023": "4813743023", # 경상남도 울산시 울주구 삼남면 신화리 -> 울산광역시 울주군 삼남면 신화리
    "3171039024": "4813743024", # 경상남도 울산시 울주구 삼남면 방기리 -> 울산광역시 울주군 삼남면 방기리
    "3171039025": "4813743025", # 경상남도 울산시 울주구 삼남면 가천리 -> 울산광역시 울주군 삼남면 가천리
    "3171040000": "4813744000", # 경상남도 울산시 울주구 삼동면 -> 울산광역시 울주군 삼동면
    "3171040021": "4813744021", # 경상남도 울산시 울주구 삼동면 둔기리 -> 울산광역시 울주군 삼동면 둔기리
    "3171040022": "4813744022", # 경상남도 울산시 울주구 삼동면 조일리 -> 울산광역시 울주군 삼동면 조일리
    "3171040023": "4813744023", # 경상남도 울산시 울주구 삼동면 출강리 -> 울산광역시 울주군 삼동면 출강리
    "3171040024": "4813744024", # 경상남도 울산시 울주구 삼동면 작동리 -> 울산광역시 울주군 삼동면 작동리
    "3171040025": "4813744025", # 경상남도 울산시 울주구 삼동면 보은리 -> 울산광역시 울주군 삼동면 보은리
    "3171040026": "4813744026", # 경상남도 울산시 울주구 삼동면 하잠리 -> 울산광역시 울주군 삼동면 하잠리
    "3171040027": "4813744027", # 경상남도 울산시 울주구 삼동면 금곡리 -> 울산광역시 울주군 삼동면 금곡리

    "2771000000": "4771000000", # 경상북도 달성군 -> 대구광역시 달성군
    "2771025000": "4771011000", # 경상북도 달성군 화원읍 -> 대구광역시 달성군 화원읍
    "2771025021": "4771011021", # 경상북도 달성군 화원읍 천내리 -> 대구광역시 달성군 화원읍 천내리
    "2771025022": "4771011022", # 경상북도 달성군 화원읍 구라리 -> 대구광역시 달성군 화원읍 구라리
    "2771025023": "4771011023", # 경상북도 달성군 화원읍 성산리 -> 대구광역시 달성군 화원읍 성산리
    "2771025024": "4771011024", # 경상북도 달성군 화원읍 설화리 -> 대구광역시 달성군 화원읍 설화리
    "2771025025": "4771011025", # 경상북도 달성군 화원읍 명곡리 -> 대구광역시 달성군 화원읍 명곡리
    "2771025026": "4771011026", # 경상북도 달성군 화원읍 본리리 -> 대구광역시 달성군 화원읍 본리리
    "2771031000": "4771031000", # 경상북도 달성군 가창면 -> 대구광역시 달성군 가창면
    "2771031021": "4771031033", # 경상북도 달성군 가창면 용계리 -> 대구광역시 달성군 가창면 용계리
    "2771031022": "4771031034", # 경상북도 달성군 가창면 오리 -> 대구광역시 달성군 가창면 오리
    "2771031023": "4771031035", # 경상북도 달성군 가창면 정대리 -> 대구광역시 달성군 가창면 정대리
    "2771031024": "4771031036", # 경상북도 달성군 가창면 냉천리 -> 대구광역시 달성군 가창면 냉천리
    "2771031025": "4771031037", # 경상북도 달성군 가창면 행정리 -> 대구광역시 달성군 가창면 행정리
    "2771031026": "4771031038", # 경상북도 달성군 가창면 상원리 -> 대구광역시 달성군 가창면 상원리
    "2771031027": "4771031039", # 경상북도 달성군 가창면 단산리 -> 대구광역시 달성군 가창면 단산리
    "2771031028": "4771031040", # 경상북도 달성군 가창면 대일리 -> 대구광역시 달성군 가창면 대일리
    "2771031029": "4771031041", # 경상북도 달성군 가창면 주리 -> 대구광역시 달성군 가창면 주리
    "2771031030": "4771031042", # 경상북도 달성군 가창면 옥분리 -> 대구광역시 달성군 가창면 옥분리
    "2771031031": "4771031043", # 경상북도 달성군 가창면 삼산리 -> 대구광역시 달성군 가창면 삼산리
    "2771031032": "4771031044", # 경상북도 달성군 가창면 우록리 -> 대구광역시 달성군 가창면 우록리
    "2771032000": "4771032000", # 경상북도 달성군 다사면 -> 대구광역시 달성군 다사면
    "2771032032": "4771032032", # 경상북도 달성군 다사면 이천리 -> 대구광역시 달성군 다사면 이천리
    "2771032033": "4771032033", # 경상북도 달성군 다사면 달천리 -> 대구광역시 달성군 다사면 달천리
    "2771032034": "4771032034", # 경상북도 달성군 다사면 박곡리 -> 대구광역시 달성군 다사면 박곡리
    "2771032035": "4771032035", # 경상북도 달성군 다사면 방천리 -> 대구광역시 달성군 다사면 방천리
    "2771032036": "4771032036", # 경상북도 달성군 다사면 서재리 -> 대구광역시 달성군 다사면 서재리
    "2771032037": "4771032037", # 경상북도 달성군 다사면 세천리 -> 대구광역시 달성군 다사면 세천리
    "2771032038": "4771032038", # 경상북도 달성군 다사면 죽곡리 -> 대구광역시 달성군 다사면 죽곡리
    "2771032039": "4771032039", # 경상북도 달성군 다사면 매곡리 -> 대구광역시 달성군 다사면 매곡리
    "2771032040": "4771032040", # 경상북도 달성군 다사면 부곡리 -> 대구광역시 달성군 다사면 부곡리
    "2771032041": "4771032041", # 경상북도 달성군 다사면 문양리 -> 대구광역시 달성군 다사면 문양리
    "2771032042": "4771032042", # 경상북도 달성군 다사면 문산리 -> 대구광역시 달성군 다사면 문산리
    "2771033000": "4771033000", # 경상북도 달성군 하빈면 -> 대구광역시 달성군 하빈면
    "2771033021": "4771033030", # 경상북도 달성군 하빈면 하산리 -> 대구광역시 달성군 하빈면 하산리
    "2771033022": "4771033031", # 경상북도 달성군 하빈면 묘리 -> 대구광역시 달성군 하빈면 묘리
    "2771033023": "4771033032", # 경상북도 달성군 하빈면 기곡리 -> 대구광역시 달성군 하빈면 기곡리
    "2771033024": "4771033033", # 경상북도 달성군 하빈면 대평리 -> 대구광역시 달성군 하빈면 대평리
    "2771033025": "4771033034", # 경상북도 달성군 하빈면 무등리 -> 대구광역시 달성군 하빈면 무등리
    "2771033026": "4771033035", # 경상북도 달성군 하빈면 현내리 -> 대구광역시 달성군 하빈면 현내리
    "2771033027": "4771033036", # 경상북도 달성군 하빈면 감문리 -> 대구광역시 달성군 하빈면 감문리
    "2771033028": "4771033037", # 경상북도 달성군 하빈면 동곡리 -> 대구광역시 달성군 하빈면 동곡리
    "2771033029": "4771033038", # 경상북도 달성군 하빈면 봉촌리 -> 대구광역시 달성군 하빈면 봉촌리
    "2771034000": "4771035000", # 경상북도 달성군 옥포면 -> 대구광역시 달성군 옥포면
    "2771034021": "4771035030", # 경상북도 달성군 옥포면 신당리 -> 대구광역시 달성군 옥포면 신당리
    "2771034022": "4771035031", # 경상북도 달성군 옥포면 교항리 -> 대구광역시 달성군 옥포면 교항리
    "2771034023": "4771035032", # 경상북도 달성군 옥포면 강림리 -> 대구광역시 달성군 옥포면 강림리
    "2771034024": "4771035033", # 경상북도 달성군 옥포면 송촌리 -> 대구광역시 달성군 옥포면 송촌리
    "2771034025": "4771035034", # 경상북도 달성군 옥포면 간경리 -> 대구광역시 달성군 옥포면 간경리
    "2771034026": "4771035035", # 경상북도 달성군 옥포면 기세리 -> 대구광역시 달성군 옥포면 기세리
    "2771034027": "4771035036", # 경상북도 달성군 옥포면 반송리 -> 대구광역시 달성군 옥포면 반송리
    "2771034028": "4771035037", # 경상북도 달성군 옥포면 김흥리 -> 대구광역시 달성군 옥포면 김흥리
    "2771034029": "4771035038", # 경상북도 달성군 옥포면 본리리 -> 대구광역시 달성군 옥포면 본리리
    "2771035000": "4771036000", # 경상북도 달성군 논공면 -> 대구광역시 달성군 논공면
    "2771035021": "4771036030", # 경상북도 달성군 논공면 노이리 -> 대구광역시 달성군 논공면 노이리
    "2771035022": "4771036031", # 경상북도 달성군 논공면 금포리 -> 대구광역시 달성군 논공면 금포리
    "2771035023": "4771036032", # 경상북도 달성군 논공면 삼리리 -> 대구광역시 달성군 논공면 삼리리
    "2771035024": "4771036033", # 경상북도 달성군 논공면 위천리 -> 대구광역시 달성군 논공면 위천리
    "2771035025": "4771036034", # 경상북도 달성군 논공면 상리 -> 대구광역시 달성군 논공면 상리
    "2771035026": "4771036035", # 경상북도 달성군 논공면 하리 -> 대구광역시 달성군 논공면 하리
    "2771035027": "4771036036", # 경상북도 달성군 논공면 남리 -> 대구광역시 달성군 논공면 남리
    "2771035028": "4771036037", # 경상북도 달성군 논공면 북리 -> 대구광역시 달성군 논공면 북리
    "2771035029": "4771036038", # 경상북도 달성군 논공면 본리리 -> 대구광역시 달성군 논공면 본리리
    "2771036000": "4771037000", # 경상북도 달성군 현풍면 -> 대구광역시 달성군 현풍면
    "2771036021": "4771037032", # 경상북도 달성군 현풍면 상리 -> 대구광역시 달성군 현풍면 상리
    "2771036022": "4771037033", # 경상북도 달성군 현풍면 중리 -> 대구광역시 달성군 현풍면 중리
    "2771036023": "4771037034", # 경상북도 달성군 현풍면 부리 -> 대구광역시 달성군 현풍면 부리
    "2771036024": "4771037035", # 경상북도 달성군 현풍면 하리 -> 대구광역시 달성군 현풍면 하리
    "2771036025": "4771037036", # 경상북도 달성군 현풍면 성하리 -> 대구광역시 달성군 현풍면 성하리
    "2771036026": "4771037037", # 경상북도 달성군 현풍면 원교리 -> 대구광역시 달성군 현풍면 원교리
    "2771036027": "4771037038", # 경상북도 달성군 현풍면 자모리 -> 대구광역시 달성군 현풍면 자모리
    "2771036028": "4771037039", # 경상북도 달성군 현풍면 오산리 -> 대구광역시 달성군 현풍면 오산리
    "2771036029": "4771037040", # 경상북도 달성군 현풍면 지리 -> 대구광역시 달성군 현풍면 지리
    "2771036030": "4771037041", # 경상북도 달성군 현풍면 대리 -> 대구광역시 달성군 현풍면 대리
    "2771036031": "4771037042", # 경상북도 달성군 현풍면 신기리 -> 대구광역시 달성군 현풍면 신기리
    "2771037000": "4771038000", # 경상북도 달성군 유가면 -> 대구광역시 달성군 유가면
    "2771037021": "4771038034", # 경상북도 달성군 유가면 음리 -> 대구광역시 달성군 유가면 음리
    "2771037022": "4771038035", # 경상북도 달성군 유가면 양리 -> 대구광역시 달성군 유가면 양리
    "2771037023": "4771038036", # 경상북도 달성군 유가면 용리 -> 대구광역시 달성군 유가면 용리
    "2771037024": "4771038037", # 경상북도 달성군 유가면 봉리 -> 대구광역시 달성군 유가면 봉리
    "2771037025": "4771038038", # 경상북도 달성군 유가면 쌍계리 -> 대구광역시 달성군 유가면 쌍계리
    "2771037026": "4771038039", # 경상북도 달성군 유가면 초곡리 -> 대구광역시 달성군 유가면 초곡리
    "2771037027": "4771038040", # 경상북도 달성군 유가면 상리 -> 대구광역시 달성군 유가면 상리
    "2771037028": "4771038041", # 경상북도 달성군 유가면 금리 -> 대구광역시 달성군 유가면 금리
    "2771037029": "4771038042", # 경상북도 달성군 유가면 유곡리 -> 대구광역시 달성군 유가면 유곡리
    "2771037030": "4771038043", # 경상북도 달성군 유가면 도의리 -> 대구광역시 달성군 유가면 도의리
    "2771037031": "4771038044", # 경상북도 달성군 유가면 가태리 -> 대구광역시 달성군 유가면 가태리
    "2771037032": "4771038045", # 경상북도 달성군 유가면 한정리 -> 대구광역시 달성군 유가면 한정리
    "2771037033": "4771038046", # 경상북도 달성군 유가면 본말리 -> 대구광역시 달성군 유가면 본말리
    "2771038000": "4771039000", # 경상북도 달성군 구지면 -> 대구광역시 달성군 구지면
    "2771038021": "4771039036", # 경상북도 달성군 구지면 창리 -> 대구광역시 달성군 구지면 창리
    "2771038022": "4771039037", # 경상북도 달성군 구지면 응암리 -> 대구광역시 달성군 구지면 응암리
    "2771038023": "4771039038", # 경상북도 달성군 구지면 고봉리 -> 대구광역시 달성군 구지면 고봉리
    "2771038024": "4771039039", # 경상북도 달성군 구지면 가천리 -> 대구광역시 달성군 구지면 가천리
    "2771038025": "4771039040", # 경상북도 달성군 구지면 평촌리 -> 대구광역시 달성군 구지면 평촌리
    "2771038026": "4771039041", # 경상북도 달성군 구지면 예현리 -> 대구광역시 달성군 구지면 예현리
    "2771038027": "4771039042", # 경상북도 달성군 구지면 유산리 -> 대구광역시 달성군 구지면 유산리
    "2771038028": "4771039043", # 경상북도 달성군 구지면 목단리 -> 대구광역시 달성군 구지면 목단리
    "2771038029": "4771039044", # 경상북도 달성군 구지면 대암리 -> 대구광역시 달성군 구지면 대암리
    "2771038030": "4771039045", # 경상북도 달성군 구지면 내리 -> 대구광역시 달성군 구지면 내리
    "2771038031": "4771039046", # 경상북도 달성군 구지면 화산리 -> 대구광역시 달성군 구지면 화산리
    "2771038032": "4771039047", # 경상북도 달성군 구지면 수리리 -> 대구광역시 달성군 구지면 수리리
    "2771038033": "4771039048", # 경상북도 달성군 구지면 징리 -> 대구광역시 달성군 구지면 징리
    "2771038034": "4771039049", # 경상북도 달성군 구지면 오설리 -> 대구광역시 달성군 구지면 오설리
    "2771038035": "4771039050", # 경상북도 달성군 구지면 도동리 -> 대구광역시 달성군 구지면 도동리

}

CORRECT_ERROR_BJD = {
    "4139013500": {
        "과거법정동코드": None, # 경기도 시흥시 배곧동, 배곧동은 정왕동에서 분리된거라서 배곧동도 여전히 존재함
        "삭제일자": None
    },
    "4176003502": {
        "읍면동명": "서면" # 경기도 시흥군 서면 옥길리, 소래읍으로 되어있음
    },
    "4176001002": {
        "읍면동명": "소하읍" # 경기도 시흥군 소하읍 옥길리, 소래면으로 되어있음
    },
    "3611031028": {
        "삭제일자": "2020-07-15" # 세종특별자치시 연기면 산울리 산울동으로 변경됨
    },
    "3611031029": {
        "삭제일자": "2020-07-15" # 세종특별자치시 연기면 해밀리 해밀동으로 변경됨
    },
    "3611034047": {
        "삭제일자": "2020-07-15" # 세종특별자치시 금남면 집현리 집현동으로 변경됨
    },
    "4122012800": {
        "리명": None, # 경기도 평택시 고덕동, 읍면동에 고덕면으로 되어있음
        "읍면동명": "고덕동"
    }
}

ADD_BJD = [
    {
        "과거법정동코드": "3611031028",
        "리명": None,
        "법정동코드": "3611011500",
        "삭제일자": "0",
        "생성일자": "2020-07-15",
        "순위": "0",
        "시군구명": None,
        "시도명": "세종특별자치시",
        "읍면동명": "산울동"
    },
    {
        "과거법정동코드": "3611031029",
        "리명": None,
        "법정동코드": "3611011600",
        "삭제일자": "0",
        "생성일자": "2020-07-15",
        "순위": "0",
        "시군구명": None,
        "시도명": "세종특별자치시",
        "읍면동명": "해밀동"
    },
    {
        "과거법정동코드": "0",
        "리명": None,
        "법정동코드": "3611011700",
        "삭제일자": "0",
        "생성일자": "2020-07-15",
        "순위": "0",
        "시군구명": None,
        "시도명": "세종특별자치시",
        "읍면동명": "합강동"
    },
    {
        "과거법정동코드": "3611034047",
        "리명": None,
        "법정동코드": "3611011800",
        "삭제일자": "0",
        "생성일자": "2020-07-15",
        "순위": "0",
        "시군구명": None,
        "시도명": "세종특별자치시",
        "읍면동명": "집현동"
    },
    {
        "과거법정동코드": "0",
        "리명": "대흥리",
        "법정동코드": "4518032031",
        "삭제일자": "0",
        "생성일자": "2021-04-09",
        "순위": "0",
        "시군구명": "정읍시",
        "시도명": "전라북도",
        "읍면동명": "입암면"
    }
]

DELETE_BJD = [
    "3600000000", # 세종특별자치시 법정동코드 [3600000000, 3611000000] 복수 존재로 3600000000 삭제
]

SGG_SPLIT_LIST: List[str] = {
    "고양덕양구",
    "고양일산동구",
    "고양일산서구",
    "성남분당구",
    "성남수정구",
    "성남중원구",
    "수원권선구",
    "수원영통구",
    "수원장안구",
    "수원팔달구",
    "안산단원구",
    "안산상록구",
    "안양동안구",
    "안양만안구",
    "용인기흥구",
    "용인수지구",
    "용인처인구",
    "전주덕진구",
    "전주완산구",
    "창원마산합포구",
    "창원마산회원구",
    "창원성산구",
    "창원의창구",
    "창원진해구",
    "천안동남구",
    "천안서북구",
    "청주상당구",
    "청주서원구",
    "청주청원구",
    "청주흥덕구",
    "포항남구",
    "포항북구",
    "부천오정구",
    "부천원미구",
    "부천소사구",
}

LAST_NM_REFINE_MAP: Dict[str, str] = {
    "북문로1가동": "북문로1가",
    "북문로2가동": "북문로2가",
    "북문로3가동": "북문로3가",
    "남문로1가동": "남문로1가",
    "남문로2가동": "남문로2가",
    "대율리": "대률리",
    "어용리": "어룡리",
    "청룡리": "청용리",
}
